/* automatically generated by rust-bindgen 0.72.1 */

#[repr(C)]
#[derive(Copy, Clone, Debug, Default, Eq, Hash, Ord, PartialEq, PartialOrd)]
pub struct __BindgenBitfieldUnit<Storage> {
    storage: Storage,
}
impl<Storage> __BindgenBitfieldUnit<Storage> {
    #[inline]
    pub const fn new(storage: Storage) -> Self {
        Self { storage }
    }
}
impl<Storage> __BindgenBitfieldUnit<Storage>
where
    Storage: AsRef<[u8]> + AsMut<[u8]>,
{
    #[inline]
    fn extract_bit(byte: u8, index: usize) -> bool {
        let bit_index = if cfg!(target_endian = "big") {
            7 - (index % 8)
        } else {
            index % 8
        };
        let mask = 1 << bit_index;
        byte & mask == mask
    }
    #[inline]
    pub fn get_bit(&self, index: usize) -> bool {
        debug_assert!(index / 8 < self.storage.as_ref().len());
        let byte_index = index / 8;
        let byte = self.storage.as_ref()[byte_index];
        Self::extract_bit(byte, index)
    }
    #[inline]
    pub unsafe fn raw_get_bit(this: *const Self, index: usize) -> bool {
        debug_assert!(index / 8 < core::mem::size_of::<Storage>());
        let byte_index = index / 8;
        let byte = unsafe {
            *(core::ptr::addr_of!((*this).storage) as *const u8).offset(byte_index as isize)
        };
        Self::extract_bit(byte, index)
    }
    #[inline]
    fn change_bit(byte: u8, index: usize, val: bool) -> u8 {
        let bit_index = if cfg!(target_endian = "big") {

    #[doc = "Function to cancel an alarm callback which has been registered before. If\nused outside alarm callback it wait for all callbacks to finish execution.\n\n# Arguments\n\n* `cb_fn` -\nalarm callback\n* `cb_arg` -\nPointer parameter to be passed to the callback function. To remove all\ncopies of a given callback function, irrespective of parameter, (void *)-1\ncan be used here.\n\n# Returns\n\n- value greater than 0 and rte_errno not changed - returned value is\nthe number of canceled alarm callback functions\n- value greater or equal 0 and rte_errno set to EINPROGRESS, at least one\nalarm could not be canceled because cancellation was requested from alarm\ncallback context. Returned value is the number of successfully canceled\nalarm callbacks\n-  0 and rte_errno set to ENOENT - no alarm found\n- -1 and rte_errno set to EINVAL - invalid parameter (NULL callback)"]
    pub fn rte_eal_alarm_cancel(
        cb_fn: rte_eal_alarm_callback,
        cb_arg: *mut ::core::ffi::c_void,
    ) -> ::core::ffi::c_int;
}
pub type __gnuc_va_list = __builtin_va_list;
#[doc = "The opaque type of streams.  This is the definition used elsewhere."]
pub type FILE = _IO_FILE;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _IO_marker {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _IO_codecvt {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _IO_wide_data {
    _unused: [u8; 0],
}
pub type _IO_lock_t = ::core::ffi::c_void;
#[doc = "The tag name of this struct is _IO_FILE to preserve historic\nC++ mangled names for functions taking FILE* arguments.\nThat name should not be used in new code."]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _IO_FILE {
    #[doc = "High-order word is _IO_MAGIC; rest is flags."]
    pub _flags: ::core::ffi::c_int,
    #[doc = "Current read pointer"]
    pub _IO_read_ptr: *mut ::core::ffi::c_char,
    #[doc = "End of get area."]
    pub _IO_read_end: *mut ::core::ffi::c_char,
    #[doc = "Start of putback+get area."]
    pub _IO_read_base: *mut ::core::ffi::c_char,
    #[doc = "Start of put area."]
    pub _IO_write_base: *mut ::core::ffi::c_char,
    #[doc = "Current put pointer."]
    pub _IO_write_ptr: *mut ::core::ffi::c_char,
    #[doc = "End of put area."]
    pub _IO_write_end: *mut ::core::ffi::c_char,
    #[doc = "Start of reserve area."]
    pub _IO_buf_base: *mut ::core::ffi::c_char,
    #[doc = "End of reserve area."]
    pub _IO_buf_end: *mut ::core::ffi::c_char,
    #[doc = "Pointer to start of non-current get area."]
    pub _IO_save_base: *mut ::core::ffi::c_char,
    #[doc = "Pointer to first valid character of backup area"]
    pub _IO_backup_base: *mut ::core::ffi::c_char,
    #[doc = "Pointer to end of non-current get area."]
    pub _IO_save_end: *mut ::core::ffi::c_char,
    pub _markers: *mut _IO_marker,
    pub _chain: *mut _IO_FILE,
    pub _fileno: ::core::ffi::c_int,
    pub _flags2: ::core::ffi::c_int,
    #[doc = "This used to be _offset but it's too small."]
    pub _old_offset: __off_t,
    #[doc = "1+column number of pbase(); 0 is unknown."]
    pub _cur_column: ::core::ffi::c_ushort,
    pub _vtable_offset: ::core::ffi::c_schar,
    pub _shortbuf: [::core::ffi::c_char; 1usize],
    pub _lock: *mut _IO_lock_t,
    pub _offset: __off64_t,
    #[doc = "Wide character stream stuff."]
    pub _codecvt: *mut _IO_codecvt,
    pub _wide_data: *mut _IO_wide_data,
    pub _freeres_list: *mut _IO_FILE,
    pub _freeres_buf: *mut ::core::ffi::c_void,
    pub _prevchain: *mut *mut _IO_FILE,
    pub _mode: ::core::ffi::c_int,
    #[doc = "Make sure we don't get into trouble again."]
    pub _unused2: [::core::ffi::c_char; 20usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _IO_FILE"][::core::mem::size_of::<_IO_FILE>() - 216usize];
    ["Alignment of _IO_FILE"][::core::mem::align_of::<_IO_FILE>() - 8usize];
    ["Offset of field: _IO_FILE::_flags"][::core::mem::offset_of!(_IO_FILE, _flags) - 0usize];
    ["Offset of field: _IO_FILE::_IO_read_ptr"]
        [::core::mem::offset_of!(_IO_FILE, _IO_read_ptr) - 8usize];
    ["Offset of field: _IO_FILE::_IO_read_end"]
        [::core::mem::offset_of!(_IO_FILE, _IO_read_end) - 16usize];
    ["Offset of field: _IO_FILE::_IO_read_base"]
        [::core::mem::offset_of!(_IO_FILE, _IO_read_base) - 24usize];
    ["Offset of field: _IO_FILE::_IO_write_base"]
        [::core::mem::offset_of!(_IO_FILE, _IO_write_base) - 32usize];
    ["Offset of field: _IO_FILE::_IO_write_ptr"]
        [::core::mem::offset_of!(_IO_FILE, _IO_write_ptr) - 40usize];
    ["Offset of field: _IO_FILE::_IO_write_end"]
        [::core::mem::offset_of!(_IO_FILE, _IO_write_end) - 48usize];
    ["Offset of field: _IO_FILE::_IO_buf_base"]
        [::core::mem::offset_of!(_IO_FILE, _IO_buf_base) - 56usize];
    ["Offset of field: _IO_FILE::_IO_buf_end"]
        [::core::mem::offset_of!(_IO_FILE, _IO_buf_end) - 64usize];
    ["Offset of field: _IO_FILE::_IO_save_base"]
        [::core::mem::offset_of!(_IO_FILE, _IO_save_base) - 72usize];
    ["Offset of field: _IO_FILE::_IO_backup_base"]
        [::core::mem::offset_of!(_IO_FILE, _IO_backup_base) - 80usize];
    ["Offset of field: _IO_FILE::_IO_save_end"]
        [::core::mem::offset_of!(_IO_FILE, _IO_save_end) - 88usize];
    ["Offset of field: _IO_FILE::_markers"][::core::mem::offset_of!(_IO_FILE, _markers) - 96usize];
    ["Offset of field: _IO_FILE::_chain"][::core::mem::offset_of!(_IO_FILE, _chain) - 104usize];
    ["Offset of field: _IO_FILE::_fileno"][::core::mem::offset_of!(_IO_FILE, _fileno) - 112usize];
    ["Offset of field: _IO_FILE::_flags2"][::core::mem::offset_of!(_IO_FILE, _flags2) - 116usize];
    ["Offset of field: _IO_FILE::_old_offset"]
        [::core::mem::offset_of!(_IO_FILE, _old_offset) - 120usize];
    ["Offset of field: _IO_FILE::_cur_column"]
        [::core::mem::offset_of!(_IO_FILE, _cur_column) - 128usize];
    ["Offset of field: _IO_FILE::_vtable_offset"]
        [::core::mem::offset_of!(_IO_FILE, _vtable_offset) - 130usize];
    ["Offset of field: _IO_FILE::_shortbuf"]
        [::core::mem::offset_of!(_IO_FILE, _shortbuf) - 131usize];
    ["Offset of field: _IO_FILE::_lock"][::core::mem::offset_of!(_IO_FILE, _lock) - 136usize];
    ["Offset of field: _IO_FILE::_offset"][::core::mem::offset_of!(_IO_FILE, _offset) - 144usize];
    ["Offset of field: _IO_FILE::_codecvt"][::core::mem::offset_of!(_IO_FILE, _codecvt) - 152usize];
    ["Offset of field: _IO_FILE::_wide_data"]
        [::core::mem::offset_of!(_IO_FILE, _wide_data) - 160usize];
    ["Offset of field: _IO_FILE::_freeres_list"]
        [::core::mem::offset_of!(_IO_FILE, _freeres_list) - 168usize];
    ["Offset of field: _IO_FILE::_freeres_buf"]
        [::core::mem::offset_of!(_IO_FILE, _freeres_buf) - 176usize];
    ["Offset of field: _IO_FILE::_prevchain"]
        [::core::mem::offset_of!(_IO_FILE, _prevchain) - 184usize];
    ["Offset of field: _IO_FILE::_mode"][::core::mem::offset_of!(_IO_FILE, _mode) - 192usize];
    ["Offset of field: _IO_FILE::_unused2"][::core::mem::offset_of!(_IO_FILE, _unused2) - 196usize];
};
impl Default for _IO_FILE {
    fn default() -> Self {
        let mut s = ::core::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::core::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
pub type va_list = __gnuc_va_list;
pub type off_t = __off_t;
unsafe extern "C" {
    #[doc = "Seed the pseudo-random generator.\nThe generator is automatically seeded by the EAL init with a timer\nvalue. It may need to be re-seeded by the user with a real random\nvalue.\nThis function is not multi-thread safe in regards to other\nrte_srand() calls, nor is it in relation to concurrent rte_rand(),\nrte_rand_max() or rte_drand() calls.\n\n# Arguments\n\n* `seedval` -\nThe value of the seed."]
    pub fn rte_srand(seedval: u64);
}
unsafe extern "C" {
    #[doc = "Get a pseudo-random value.\nThe generator is not cryptographically secure.\nrte_rand(), rte_rand_max() and rte_drand() are multi-thread safe,\nwith the exception that they may not be called by multiple\n_unregistered_ non-EAL threads in parallel.\n\n# Returns\n\nA pseudo-random value between 0 and (1<<64)-1."]
    pub fn rte_rand() -> u64;
}
unsafe extern "C" {
    #[doc = "Generates a pseudo-random number with an upper bound.\nThis function returns an uniformly distributed (unbiased) random\nnumber less than a user-specified maximum value.\nrte_rand(), rte_rand_max() and rte_drand() are multi-thread safe,\nwith the exception that they may not be called by multiple\n_unregistered_ non-EAL threads in parallel.\n\n# Arguments\n\n* `upper_bound` -\nThe upper bound of the generated number.\n\n# Returns\n\nA pseudo-random value between 0 and (upper_bound-1)."]
    pub fn rte_rand_max(upper_bound: u64) -> u64;
}
unsafe extern "C" {
    #[doc = "Generates a pseudo-random floating point number.\nThis function returns a non-negative double-precision floating random\nnumber uniformly distributed over the interval [0.0, 1.0).\nThe generator is not cryptographically secure.\nrte_rand(), rte_rand_max() and rte_drand() are multi-thread safe,\nwith the exception that they may not be called by multiple\n_unregistered_ non-EAL threads in parallel.\n\n# Returns\n\nA pseudo-random value between 0 and 1.0."]
    pub fn rte_drand() -> f64;
}
#[doc = "POSIX.1b structure for a time value.  This is like a `struct timeval' but\nhas nanoseconds instead of microseconds."]
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct timespec {
    #[doc = "Seconds."]
    pub tv_sec: __time_t,
    #[doc = "Nanoseconds."]
    pub tv_nsec: __syscall_slong_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of timespec"][::core::mem::size_of::<timespec>() - 16usize];
    ["Alignment of timespec"][::core::mem::align_of::<timespec>() - 8usize];
    ["Offset of field: timespec::tv_sec"][::core::mem::offset_of!(timespec, tv_sec) - 0usize];
    ["Offset of field: timespec::tv_nsec"][::core::mem::offset_of!(timespec, tv_nsec) - 8usize];
};
unsafe extern "C" {
    #[doc = "Checks if a pointer is aligned to a given power-of-two value\n\n# Arguments\n\n* `ptr` -\nThe pointer whose alignment is to be checked\n* `align` -\nThe power-of-two value to which the ptr should be aligned\n\n# Returns\n\nTrue(1) where the pointer is correctly aligned, false(0) otherwise"]
    #[link_name = "rte_is_aligned_w"]
    pub fn rte_is_aligned(
        ptr: *const ::core::ffi::c_void,
        align: ::core::ffi::c_uint,
    ) -> ::core::ffi::c_int;
}
#[doc = "Physical address"]
pub type phys_addr_t = u64;
#[doc = "IO virtual address type.\nWhen the physical addressing mode (IOVA as PA) is in use,\nthe translation from an IO virtual address (IOVA) to a physical address\nis a direct mapping, i.e. the same value.\nOtherwise, in virtual mode (IOVA as VA), an IOMMU may do the translation."]
pub type rte_iova_t = u64;
#[doc = "Generic marker for any place in a structure."]
pub type RTE_MARKER = [*mut ::core::ffi::c_void; 0usize];
#[doc = "Marker for 1B alignment in a structure."]
pub type RTE_MARKER8 = [u8; 0usize];
#[doc = "Marker for 2B alignment in a structure."]
pub type RTE_MARKER16 = [u16; 0usize];
#[doc = "Marker for 4B alignment in a structure."]
pub type RTE_MARKER32 = [u32; 0usize];
#[doc = "Marker for 8B alignment in a structure."]
pub type RTE_MARKER64 = [u64; 0usize];
unsafe extern "C" {
    #[doc = "Converts a numeric string to the equivalent uint64_t value.\nAs well as straight number conversion, also recognises the suffixes\nk, m and g for kilobytes, megabytes and gigabytes respectively.\nIf a negative number is passed in  i.e. a string with the first non-black\ncharacter being \"-\", zero is returned. Zero is also returned in the case of\nan error with the strtoull call in the function.\n\n# Arguments\n\n* `str` -\nString containing number to convert.\n\n# Returns\n\nNumber."]
    pub fn rte_str_to_size(str_: *const ::core::ffi::c_char) -> u64;
}
unsafe extern "C" {
    #[doc = "Function to terminate the application immediately, printing an error\nmessage and returning the exit_code back to the shell.\nThis function never returns\n\n# Arguments\n\n* `exit_code` -\nThe exit code to be returned by the application\n* `format` -\nThe format string to be used for printing the message. This can include\nprintf format characters which will be expanded using any further parameters\nto the function."]
    pub fn rte_exit(exit_code: ::core::ffi::c_int, format: *const ::core::ffi::c_char, ...) -> !;
}
#[doc = "Struct describing a Universal Unique Identifier"]
pub type rte_uuid_t = [::core::ffi::c_uchar; 16usize];
unsafe extern "C" {
    #[doc = "Test if UUID is all zeros.\n\n# Arguments\n\n* `uu` -\nThe uuid to check.\n\n# Returns\n\ntrue if uuid is NULL value, false otherwise"]
    pub fn rte_uuid_is_null(uu: *const ::core::ffi::c_uchar) -> bool;
}
unsafe extern "C" {
    #[doc = "Copy uuid.\n\n# Arguments\n\n* `dst` -\nDestination uuid\n* `src` -\nSource uuid"]
    #[link_name = "rte_uuid_copy_w"]
    pub fn rte_uuid_copy(dst: *mut ::core::ffi::c_uchar, src: *const ::core::ffi::c_uchar);
}
unsafe extern "C" {
    #[doc = "Compare two UUID's\n\n# Arguments\n\n* `a` -\nA UUID to compare\n* `b` -\nA UUID to compare\n\n# Returns\n\nreturns an integer less than, equal to, or greater than zero if UUID a is\nis less than, equal, or greater than UUID b."]
    pub fn rte_uuid_compare(
        a: *const ::core::ffi::c_uchar,
        b: *const ::core::ffi::c_uchar,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    #[doc = "Extract UUID from string\n\n# Arguments\n\n* `in` -\nPointer to string of characters to convert\n* `uu` -\nDestination UUID\n\n# Returns\n\nReturns 0 on success, and -1 if string is not a valid UUID."]
    pub fn rte_uuid_parse(
        in_: *const ::core::ffi::c_char,
        uu: *mut ::core::ffi::c_uchar,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    #[doc = "Convert UUID to string\n\n# Arguments\n\n* `uu` -\nUUID to format\n* `out` -\nResulting string buffer\n* `len` -\nSizeof the available string buffer"]
    pub fn rte_uuid_unparse(
        uu: *const ::core::ffi::c_uchar,
        out: *mut ::core::ffi::c_char,
        len: usize,
    );
}
pub mod rte_intr_mode {
    #[doc = "interrupt mode"]
    pub type Type = ::core::ffi::c_uint;
    pub const RTE_INTR_MODE_NONE: Type = 0;
    pub const RTE_INTR_MODE_LEGACY: Type = 1;
    pub const RTE_INTR_MODE_MSI: Type = 2;
    pub const RTE_INTR_MODE_MSIX: Type = 3;
}
pub mod rte_proc_type_t {
    #[doc = "The type of process in a linux, multi-process setup"]
    pub type Type = ::core::ffi::c_int;
    #[doc = "allow auto-detection of primary/secondary"]
    pub const RTE_PROC_AUTO: Type = -1;
    #[doc = "set to zero, so primary is the default"]
    pub const RTE_PROC_PRIMARY: Type = 0;
    pub const RTE_PROC_SECONDARY: Type = 1;
    pub const RTE_PROC_INVALID: Type = 2;
}
unsafe extern "C" {
    #[doc = "Get the process type in a multi-process setup\n\n# Returns\n\nThe process type"]
    pub fn rte_eal_process_type() -> rte_proc_type_t::Type;
}
unsafe extern "C" {
    #[doc = "Request iopl privilege for all RPL.\nThis function should be called by pmds which need access to ioports.\n\n# Returns\n\n- On success, returns 0.\n- On failure, returns -1."]
    pub fn rte_eal_iopl_init() -> ::core::ffi::c_int;
}
unsafe extern "C" {
    #[doc = "Initialize the Environment Abstraction Layer (EAL).\nThis function is to be executed on the MAIN lcore only, as soon\nas possible in the application's main() function.\nIt puts the WORKER lcores in the WAIT state.\n\n# Arguments\n\n* `argc` -\nA non-negative value.  If it is greater than 0, the array members\nfor argv[0] through argv[argc] (non-inclusive) shall contain pointers\nto strings.\n* `argv` -\nAn array of strings.  The contents of the array, as well as the strings\nwhich are pointed to by the array, may be modified by this function.\nThe program name pointer argv[0] is copied into the last parsed argv\nso that argv[0] is still the same after deducing the parsed arguments.\n\n# Returns\n\n- On success, the number of parsed arguments, which is greater or\nequal to zero. After the call to rte_eal_init(),\nall arguments argv[x] with x < ret may have been modified by this\nfunction call and should not be further interpreted by the\napplication.  The EAL does not take any ownership of the memory used\nfor either the argv array, or its members.\n- On failure, -1 and rte_errno is set to a value indicating the cause\nfor failure.  In some instances, the application will need to be\nrestarted as part of clearing the issue.\nError codes returned via rte_errno:\nEACCES indicates a permissions issue.\nEAGAIN indicates either a bus or system resource was not available,\nsetup may be attempted again.\nEALREADY indicates that the rte_eal_init function has already been\ncalled, and cannot be called again.\nEFAULT indicates the tailq configuration name was not found in\nmemory configuration.\nEINVAL indicates invalid parameters were passed as argv/argc.\nENOMEM indicates failure likely caused by an out-of-memory condition.\nENODEV indicates memory setup issues.\nENOTSUP indicates that the EAL cannot initialize on this system.\nEPROTO indicates that the PCI bus is either not present, or is not\nreadable by the eal.\nENOEXEC indicates that a service core failed to launch successfully."]
    pub fn rte_eal_init(
        argc: ::core::ffi::c_int,
        argv: *mut *mut ::core::ffi::c_char,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    #[doc = "Clean up the Environment Abstraction Layer (EAL)\nThis function must be called to release any internal resources that EAL has\nallocated during rte_eal_init(). After this call, no DPDK function calls may\nbe made. It is expected that common usage of this function is to call it\njust before terminating the process.\n\n# Returns\n\n- 0 Successfully released all internal EAL resources.\n- -EFAULT There was an error in releasing all resources."]
    pub fn rte_eal_cleanup() -> ::core::ffi::c_int;
}
unsafe extern "C" {
    #[doc = "Check if a primary process is currently alive\nThis function returns true when a primary process is currently\nactive.\n\n# Arguments\n\n* `config_file_path` -\nThe config_file_path argument provided should point at the location\nthat the primary process will create its config file. If NULL, the default\nconfig file path is used.\n\n# Returns\n\n- If alive, returns 1.\n- If dead, returns 0."]
    pub fn rte_eal_primary_proc_alive(
        config_file_path: *const ::core::ffi::c_char,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    #[doc = "Disable multiprocess.\nThis function can be called to indicate that multiprocess won't be used for\nthe rest of the application life.\n\n# Returns\n\n- true if called from a primary process that had no secondary processes\nattached,\n- false, otherwise."]
    pub fn rte_mp_disable() -> bool;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct rte_mp_msg {
    pub name: [::core::ffi::c_char; 64usize],
    pub len_param: ::core::ffi::c_int,
    pub num_fds: ::core::ffi::c_int,
    pub param: [u8; 256usize],
    pub fds: [::core::ffi::c_int; 253usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of rte_mp_msg"][::core::mem::size_of::<rte_mp_msg>() - 1340usize];
    ["Alignment of rte_mp_msg"][::core::mem::align_of::<rte_mp_msg>() - 4usize];
    ["Offset of field: rte_mp_msg::name"][::core::mem::offset_of!(rte_mp_msg, name) - 0usize];
    ["Offset of field: rte_mp_msg::len_param"]
        [::core::mem::offset_of!(rte_mp_msg, len_param) - 64usize];
    ["Offset of field: rte_mp_msg::num_fds"]
        [::core::mem::offset_of!(rte_mp_msg, num_fds) - 68usize];
    ["Offset of field: rte_mp_msg::param"][::core::mem::offset_of!(rte_mp_msg, param) - 72usize];
    ["Offset of field: rte_mp_msg::fds"][::core::mem::offset_of!(rte_mp_msg, fds) - 328usize];
};
impl Default for rte_mp_msg {
    fn default() -> Self {
        let mut s = ::core::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::core::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct rte_mp_reply {
    pub nb_sent: ::core::ffi::c_int,
    pub nb_received: ::core::ffi::c_int,
    #[doc = "caller to free"]
    pub msgs: *mut rte_mp_msg,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of rte_mp_reply"][::core::mem::size_of::<rte_mp_reply>() - 16usize];
    ["Alignment of rte_mp_reply"][::core::mem::align_of::<rte_mp_reply>() - 8usize];
    ["Offset of field: rte_mp_reply::nb_sent"]
        [::core::mem::offset_of!(rte_mp_reply, nb_sent) - 0usize];
    ["Offset of field: rte_mp_reply::nb_received"]
        [::core::mem::offset_of!(rte_mp_reply, nb_received) - 4usize];
    ["Offset of field: rte_mp_reply::msgs"][::core::mem::offset_of!(rte_mp_reply, msgs) - 8usize];
};
impl Default for rte_mp_reply {
    fn default() -> Self {
        let mut s = ::core::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::core::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[doc = "Action function typedef used by other components.\nAs we create  socket channel for primary/secondary communication, use\nthis function typedef to register action for coming messages.\n> **Note** When handling IPC request callbacks, the reply must be sent even in\ncases of error handling. Simply returning success or failure will *not*\nsend a response to the requestor.\nImplementation of error signalling mechanism is up to the application.\n> **Note** No memory allocations should take place inside the callback."]
pub type rte_mp_t = ::core::option::Option<
    unsafe extern "C" fn(
        msg: *const rte_mp_msg,
        peer: *const ::core::ffi::c_void,
    ) -> ::core::ffi::c_int,
>;
#[doc = "Asynchronous reply function typedef used by other components.\nAs we create socket channel for primary/secondary communication, use\nthis function typedef to register action for coming responses to asynchronous\nrequests.\n> **Note** When handling IPC request callbacks, the reply must be sent even in\ncases of error handling. Simply returning success or failure will *not*\nsend a response to the requestor.\nImplementation of error signalling mechanism is up to the application.\n> **Note** No memory allocations should take place inside the callback."]
pub type rte_mp_async_reply_t = ::core::option::Option<
    unsafe extern "C" fn(
        request: *const rte_mp_msg,
        reply: *const rte_mp_reply,
    ) -> ::core::ffi::c_int,
>;
unsafe extern "C" {
    #[doc = "Register an action function for primary/secondary communication.\nCall this function to register an action, if the calling component wants\nto response the messages from the corresponding component in its primary\nprocess or secondary processes.\n> **Note** IPC may be unsupported in certain circumstances, so caller should check\nfor ENOTSUP error.\n\n# Arguments\n\n* `name` -\nThe name argument plays as the nonredundant key to find the action.\n* `action` -\nThe action argument is the function pointer to the action function.\n\n# Returns\n\n- 0 on success.\n- (<0) on failure."]
    pub fn rte_mp_action_register(
        name: *const ::core::ffi::c_char,
        action: rte_mp_t,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    #[doc = "Unregister an action function for primary/secondary communication.\nCall this function to unregister an action  if the calling component does\nnot want to response the messages from the corresponding component in its\nprimary process or secondary processes.\n> **Note** IPC may be unsupported in certain circumstances, so caller should check\nfor ENOTSUP error.\n\n# Arguments\n\n* `name` -\nThe name argument plays as the nonredundant key to find the action."]
    pub fn rte_mp_action_unregister(name: *const ::core::ffi::c_char);
}
unsafe extern "C" {
    #[doc = "Send a message to the peer process.\nThis function will send a message which will be responded by the action\nidentified by name in the peer process.\n\n# Arguments\n\n* `msg` -\nThe msg argument contains the customized message.\n\n# Returns\n\n- On success, return 0.\n- On failure, return -1, and the reason will be stored in rte_errno."]
    pub fn rte_mp_sendmsg(msg: *mut rte_mp_msg) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    #[doc = "Send a request to the peer process and expect a reply.\nThis function sends a request message to the peer process, and will\nblock until receiving reply message from the peer process.\n> **Note** The caller is responsible to free reply->replies.\n> **Note** This API must not be used inside memory-related or IPC callbacks, and\nno memory allocations should take place inside such callback.\n> **Note** IPC may be unsupported in certain circumstances, so caller should check\nfor ENOTSUP error.\n\n# Arguments\n\n* `req` -\nThe req argument contains the customized request message.\n* `reply` -\nThe reply argument will be for storing all the replied messages;\nthe caller is responsible for free reply->msgs.\n* `ts` -\nThe ts argument specifies how long we can wait for the peer(s) to reply.\n\n# Returns\n\n- On success, return 0.\n- On failure, return -1, and the reason will be stored in rte_errno."]
    pub fn rte_mp_request_sync(
        req: *mut rte_mp_msg,
        reply: *mut rte_mp_reply,
        ts: *const timespec,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    #[doc = "Send a request to the peer process and expect a reply in a separate callback.\nThis function sends a request message to the peer process, and will not\nblock. Instead, reply will be received in a separate callback.\n> **Note** IPC may be unsupported in certain circumstances, so caller should check\nfor ENOTSUP error.\n\n# Arguments\n\n* `req` -\nThe req argument contains the customized request message.\n* `ts` -\nThe ts argument specifies how long we can wait for the peer(s) to reply.\n* `clb` -\nThe callback to trigger when all responses for this request have arrived.\n\n# Returns\n\n- On success, return 0.\n- On failure, return -1, and the reason will be stored in rte_errno."]
    pub fn rte_mp_request_async(
        req: *mut rte_mp_msg,
        ts: *const timespec,
        clb: rte_mp_async_reply_t,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    #[doc = "Send a reply to the peer process.\nThis function will send a reply message in response to a request message\nreceived previously.\n> **Note** When handling IPC request callbacks, the reply must be sent even in\ncases of error handling. Simply returning success or failure will *not*\nsend a response to the requestor.\nImplementation of error signalling mechanism is up to the application.\n\n# Arguments\n\n* `msg` -\nThe msg argument contains the customized message.\n* `peer` -\nThe peer argument is the pointer to the peer socket path.\n\n# Returns\n\n- On success, return 0.\n- On failure, return -1, and the reason will be stored in rte_errno."]
    pub fn rte_mp_reply(
        msg: *mut rte_mp_msg,
        peer: *const ::core::ffi::c_char,
    ) -> ::core::ffi::c_int;
}
#[doc = "Usage function typedef used by the application usage function.\nUse this function typedef to define and call rte_set_application_usage_hook()\nroutine."]
pub type rte_usage_hook_t =
    ::core::option::Option<unsafe extern "C" fn(prgname: *const ::core::ffi::c_char)>;
unsafe extern "C" {
    #[doc = "Add application usage routine callout from the eal_usage() routine.\nThis function allows the application to include its usage message\nin the EAL system usage message. The routine rte_set_application_usage_hook()\nneeds to be called before the rte_eal_init() routine in the application.\nThis routine is optional for the application and will behave as if the set\nroutine was never called as the default behavior.\n\n# Arguments\n\n* `usage_func` -\nThe func argument is a function pointer to the application usage routine.\nCalled function is defined using rte_usage_hook_t typedef, which is of\nthe form void rte_usage_func(const char * prgname).\nCalling this routine with a NULL value will reset the usage hook routine and\nreturn the current value, which could be NULL.\n\n# Returns\n\n- Returns the current value of the rte_application_usage pointer to allow\nthe caller to daisy chain the usage routines if needing more then one."]
    pub fn rte_set_application_usage_hook(usage_func: rte_usage_hook_t) -> rte_usage_hook_t;
}
unsafe extern "C" {
    #[doc = "Whether EAL is using huge pages (disabled by --no-huge option).\nThe no-huge mode is not compatible with all drivers or features.\n\n# Returns\n\nNonzero if hugepages are enabled."]
    pub fn rte_eal_has_hugepages() -> ::core::ffi::c_int;
}
unsafe extern "C" {
    #[doc = "Whether EAL is using PCI bus.\nDisabled by --no-pci option.\n\n# Returns\n\nNonzero if the PCI bus is enabled."]
    pub fn rte_eal_has_pci() -> ::core::ffi::c_int;
}
unsafe extern "C" {
    #[doc = "Whether the EAL was asked to create UIO device.\n\n# Returns\n\nNonzero if true."]
    pub fn rte_eal_create_uio_dev() -> ::core::ffi::c_int;
}
unsafe extern "C" {
    #[doc = "The user-configured vfio interrupt mode.\n\n# Returns\n\nInterrupt mode configured with the command line,\nRTE_INTR_MODE_NONE by default."]
    pub fn rte_eal_vfio_intr_mode() -> rte_intr_mode::Type;
}
unsafe extern "C" {
    #[doc = "Copy the user-configured vfio VF token.\n\n# Arguments\n\n* `vf_token` -\nvfio VF token configured with the command line is copied\ninto this parameter, zero uuid by default."]
    pub fn rte_eal_vfio_get_vf_token(vf_token: *mut ::core::ffi::c_uchar);
}
unsafe extern "C" {
    #[doc = "A wrap API for syscall gettid.\n\n# Returns\n\nOn success, returns the thread ID of calling process.\nIt is always successful."]
    pub fn rte_sys_gettid() -> ::core::ffi::c_int;
}
unsafe extern "C" {
    #[doc = "Get system unique thread id.\n\n# Returns\n\nOn success, returns the thread ID of calling process.\nIt is always successful."]
    #[link_name = "rte_gettid_w"]
    pub fn rte_gettid() -> ::core::ffi::c_int;
}
unsafe extern "C" {
    #[doc = "Get the OS-specific EAL base address.\n\n# Returns\n\nThe base address."]
    pub fn rte_eal_get_baseaddr() -> u64;
}
pub mod rte_iova_mode {
    #[doc = "IOVA mapping mode.\nIOVA mapping mode is iommu programming mode of a device.\nThat device (for example: IOMMU backed DMA device) based\non rte_iova_mode will generate physical or virtual address."]
    pub type Type = ::core::ffi::c_uint;
    #[doc = "Don't care mode"]
    pub const RTE_IOVA_DC: Type = 0;
    #[doc = "DMA using physical address"]
    pub const RTE_IOVA_PA: Type = 1;
    #[doc = "DMA using virtual address"]
    pub const RTE_IOVA_VA: Type = 2;
}
unsafe extern "C" {
    #[doc = "Get the iova mode\n\n# Returns\n\nenum rte_iova_mode value."]
    pub fn rte_eal_iova_mode() -> rte_iova_mode::Type;
}
unsafe extern "C" {
    #[doc = "Get user provided pool ops name for mbuf\n\n# Returns\n\nreturns user provided pool ops name."]
    pub fn rte_eal_mbuf_user_pool_ops() -> *const ::core::ffi::c_char;
}
unsafe extern "C" {
    #[doc = "Get the runtime directory of DPDK\n\n# Returns\n\nThe runtime directory path of DPDK"]
    pub fn rte_eal_get_runtime_dir() -> *const ::core::ffi::c_char;
}
unsafe extern "C" {
    #[doc = "Convert a string describing a mask of core ids into an array of core ids.\nOn success, the passed array is filled with the orders of the core ids\npresent in the mask (-1 indicating that a core id is absent).\nFor example, passing a 0xa coremask results in cores[1] = 0, cores[3] = 1,\nand the rest of the array is set to -1.\n\n# Arguments\n\n* `coremask` -\nA string describing a mask of core ids.\n* `cores` -\nAn array where to store the core ids orders.\nThis array must be at least RTE_MAX_LCORE large.\n\n# Returns\n\n0 on success, -1 if the string content was invalid."]
    pub fn rte_eal_parse_coremask(
        coremask: *const ::core::ffi::c_char,
        cores: *mut ::core::ffi::c_int,
    ) -> ::core::ffi::c_int;
}
pub mod rte_lcore_state_t {
    #[doc = "State of an lcore."]
    pub type Type = ::core::ffi::c_uint;
    pub const WAIT: Type = 0;
    pub const RUNNING: Type = 1;
}
#[doc = "Definition of a remote launch function."]
pub type lcore_function_t = ::core::option::Option<
    unsafe extern "C" fn(arg1: *mut ::core::ffi::c_void) -> ::core::ffi::c_int,
>;
unsafe extern "C" {
    #[doc = "Launch a function on another lcore.\nTo be executed on the MAIN lcore only.\nSends a message to a worker lcore (identified by the worker_id) that\nis in the WAIT state (this is true after the first call to\nrte_eal_init()). This can be checked by first calling\nrte_eal_wait_lcore(worker_id).\nWhen the remote lcore receives the message, it switches to\nthe RUNNING state, then calls the function f with argument arg. Once the\nexecution is done, the remote lcore switches to WAIT state and\nthe return value of f is stored in a local variable to be read using\nrte_eal_wait_lcore().\nThe MAIN lcore returns as soon as the message is sent and knows\nnothing about the completion of f.\nNote: This function is not designed to offer optimum\nperformance. It is just a practical way to launch a function on\nanother lcore at initialization time.\n\n# Arguments\n\n* `f` -\nThe function to be called.\n* `arg` -\nThe argument for the function.\n* `worker_id` -\nThe identifier of the lcore on which the function should be executed.\n\n# Returns\n\n- 0: Success. Execution of function f started on the remote lcore.\n- (-EBUSY): The remote lcore is not in a WAIT state.\n- (-EPIPE): Error reading or writing pipe to worker thread"]
    pub fn rte_eal_remote_launch(
        f: lcore_function_t,
        arg: *mut ::core::ffi::c_void,
        worker_id: ::core::ffi::c_uint,
    ) -> ::core::ffi::c_int;
}
pub mod rte_rmt_call_main_t {
    #[doc = "This enum indicates whether the main core must execute the handler\nlaunched on all logical cores."]
    pub type Type = ::core::ffi::c_uint;
    #[doc = "< lcore handler not executed by main core."]
    pub const SKIP_MAIN: Type = 0;
    #[doc = "< lcore handler executed by main core."]
    pub const CALL_MAIN: Type = 1;
}
unsafe extern "C" {
    #[doc = "Launch a function on all lcores.\nCheck that each WORKER lcore is in a WAIT state, then call\nrte_eal_remote_launch() for each lcore.\n\n# Arguments\n\n* `f` -\nThe function to be called.\n* `arg` -\nThe argument for the function.\n* `call_main` -\nIf call_main set to SKIP_MAIN, the MAIN lcore does not call\nthe function. If call_main is set to CALL_MAIN, the function\nis also called on main before returning. In any case, the main\nlcore returns as soon as it finished its job and knows nothing\nabout the completion of f on the other lcores.\n\n# Returns\n\n- 0: Success. Execution of function f started on all remote lcores.\n- (-EBUSY): At least one remote lcore is not in a WAIT state. In this\ncase, no message is sent to any of the lcores."]
    pub fn rte_eal_mp_remote_launch(
        f: lcore_function_t,
        arg: *mut ::core::ffi::c_void,
        call_main: rte_rmt_call_main_t::Type,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    #[doc = "Get the state of the lcore identified by worker_id.\nTo be executed on the MAIN lcore only.\n\n# Arguments\n\n* `worker_id` -\nThe identifier of the lcore.\n\n# Returns\n\nThe state of the lcore."]
    pub fn rte_eal_get_lcore_state(worker_id: ::core::ffi::c_uint) -> rte_lcore_state_t::Type;
}
unsafe extern "C" {
    #[doc = "Wait until an lcore finishes its job.\nTo be executed on the MAIN lcore only.\nIf the lcore identified by the worker_id is in RUNNING state, wait until\nthe lcore finishes its job and moves to the WAIT state.\n\n# Arguments\n\n* `worker_id` -\nThe identifier of the lcore.\n\n# Returns\n\n- 0: If the remote launch function was never called on the lcore\nidentified by the worker_id.\n- The value that was returned by the previous remote launch\nfunction call."]
    pub fn rte_eal_wait_lcore(worker_id: ::core::ffi::c_uint) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    #[doc = "Wait until all lcores finish their jobs.\nTo be executed on the MAIN lcore only. Issue an\nrte_eal_wait_lcore() for every lcore. The return values are\nignored.\nAfter a call to rte_eal_mp_wait_lcore(), the caller can assume\nthat all worker lcores are in a WAIT state."]
    pub fn rte_eal_mp_wait_lcore();
}
#[doc = "Thread id descriptor."]
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct rte_thread_t {
    #[doc = "< thread identifier"]
    pub opaque_id: usize,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of rte_thread_t"][::core::mem::size_of::<rte_thread_t>() - 8usize];
    ["Alignment of rte_thread_t"][::core::mem::align_of::<rte_thread_t>() - 8usize];
    ["Offset of field: rte_thread_t::opaque_id"]
        [::core::mem::offset_of!(rte_thread_t, opaque_id) - 0usize];
};
#[doc = "Thread function\nFunction pointer to thread start routine.\n\n# Arguments\n\n* `arg` -\nArgument passed to rte_thread_create().\n\n# Returns\n\nThread function exit value."]
pub type rte_thread_func =
    ::core::option::Option<unsafe extern "C" fn(arg: *mut ::core::ffi::c_void) -> u32>;
pub mod rte_thread_priority {
    #[doc = "Thread priority values."]
    pub type Type = ::core::ffi::c_uint;
    pub const RTE_THREAD_PRIORITY_NORMAL: Type = 0;
    pub const RTE_THREAD_PRIORITY_REALTIME_CRITICAL: Type = 1;
}
#[doc = "Representation for thread attributes."]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct rte_thread_attr_t {
    #[doc = "< thread priority"]
    pub priority: rte_thread_priority::Type,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of rte_thread_attr_t"][::core::mem::size_of::<rte_thread_attr_t>() - 4usize];
    ["Alignment of rte_thread_attr_t"][::core::mem::align_of::<rte_thread_attr_t>() - 4usize];
    ["Offset of field: rte_thread_attr_t::priority"]
        [::core::mem::offset_of!(rte_thread_attr_t, priority) - 0usize];
};
impl Default for rte_thread_attr_t {
    fn default() -> Self {
        let mut s = ::core::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::core::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct eal_tls_key {
    _unused: [u8; 0],
}
#[doc = "TLS key type, an opaque pointer."]
pub type rte_thread_key = *mut eal_tls_key;
unsafe extern "C" {
    #[doc = "Create a new thread that will invoke the 'thread_func' routine.\n\n# Arguments\n\n* `thread_id` -\nA pointer that will store the id of the newly created thread.\n* `thread_attr` -\nAttributes that are used at the creation of the new thread.\n* `thread_func` -\nThe routine that the new thread will invoke when starting execution.\n* `arg` -\nArgument to be passed to the 'thread_func' routine.\n\n# Returns\n\nOn success, return 0.\nOn failure, return a positive errno-style error number."]
    pub fn rte_thread_create(
        thread_id: *mut rte_thread_t,
        thread_attr: *const rte_thread_attr_t,
        thread_func: rte_thread_func,
        arg: *mut ::core::ffi::c_void,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    #[doc = "Create a control thread.\nCreates a control thread with the given name and attributes. The\naffinity of the new thread is based on the CPU affinity retrieved\nat the time rte_eal_init() was called, the EAL threads are then\nexcluded. If setting the name of the thread fails, the error is\nignored and a debug message is logged.\n\n# Arguments\n\n* `thread` -\nFilled with the thread id of the new created thread.\n* `name` -\nThe name of the control thread\n(max RTE_THREAD_NAME_SIZE characters including '\\0'). * `thread_func` -\nFunction to be executed by the new thread.\n* `arg` -\nArgument passed to thread_func.\n\n# Returns\n\nOn success, returns 0; on error, it returns a negative value\ncorresponding to the error number."]
    pub fn rte_thread_create_control(
        thread: *mut rte_thread_t,
        name: *const ::core::ffi::c_char,
        thread_func: rte_thread_func,
        arg: *mut ::core::ffi::c_void,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    #[doc = "Create an internal control thread.\nCreates a control thread with the given name prefixed.\nIf setting the name of the thread fails, the error is ignored and logged.\nThe affinity of the new thread is based on the CPU affinity retrieved\nat the time rte_eal_init() was called, the EAL threads are then excluded.\n\n# Arguments\n\n* `id` -\nFilled with the thread ID of the new created thread.\n* `name` -\nThe name of the control thread.\nSee RTE_THREAD_INTERNAL_NAME_SIZE for maximum length.\nThe name of the driver or library should be first,\nthen followed by a hyphen and more details.\nIt will be prefixed with RTE_THREAD_INTERNAL_PREFIX by this function.\n* `func` -\nFunction to be executed by the new thread.\n* `arg` -\nArgument passed to func.\n\n# Returns\n\nOn success, returns 0; a negative value otherwise."]
    pub fn rte_thread_create_internal_control(
        id: *mut rte_thread_t,
        name: *const ::core::ffi::c_char,
        func: rte_thread_func,
        arg: *mut ::core::ffi::c_void,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    #[doc = "Waits for the thread identified by 'thread_id' to terminate\n\n# Arguments\n\n* `thread_id` -\nThe identifier of the thread.\n* `value_ptr` -\nStores the exit status of the thread.\n\n# Returns\n\nOn success, return 0.\nOn failure, return a positive errno-style error number."]
    pub fn rte_thread_join(thread_id: rte_thread_t, value_ptr: *mut u32) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    #[doc = "Indicate that the return value of the thread is not needed and\nall thread resources should be release when the thread terminates.\n\n# Arguments\n\n* `thread_id` -\nThe id of the thread to be detached.\n\n# Returns\n\nOn success, return 0.\nOn failure, return a positive errno-style error number."]
    pub fn rte_thread_detach(thread_id: rte_thread_t) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    #[doc = "Get the id of the calling thread.\n\n# Returns\n\nReturn the thread id of the calling thread."]
    pub fn rte_thread_self() -> rte_thread_t;
}
unsafe extern "C" {
    #[doc = "Set the name of the thread.\nThis API is a noop if the underlying platform does not\nsupport setting the thread name or the platform-specific\nAPI used to set the thread name fails.\n\n# Arguments\n\n* `thread_id` -\nThe id of the thread to set name.\n* `thread_name` -\nThe name to set. Truncated to RTE_THREAD_NAME_SIZE,\nincluding terminating NUL if necessary."]
    pub fn rte_thread_set_name(thread_id: rte_thread_t, thread_name: *const ::core::ffi::c_char);
}
unsafe extern "C" {
    #[doc = "Set the name of an internal thread with the common prefix.\nThis API is a noop if the underlying platform does not support\nsetting the thread name, or if it fails.\n\n# Arguments\n\n* `id` -\nThe ID of the thread to set name.\n* `name` -\nThe name to set after being prefixed.\nSee RTE_THREAD_INTERNAL_NAME_SIZE for maximum length.\nThe name of the driver or library should be first,\nthen followed by a hyphen and more details.\nIt will be prefixed with RTE_THREAD_INTERNAL_PREFIX by this function."]
    pub fn rte_thread_set_prefixed_name(id: rte_thread_t, name: *const ::core::ffi::c_char);
}
unsafe extern "C" {
    #[doc = "Check if 2 thread ids are equal.\n\n# Arguments\n\n* `t1` -\nFirst thread id.\n* `t2` -\nSecond thread id.\n\n# Returns\n\nIf the ids are equal, return nonzero.\nOtherwise, return 0."]
    pub fn rte_thread_equal(t1: rte_thread_t, t2: rte_thread_t) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    #[doc = "Initialize the attributes of a thread.\nThese attributes can be passed to the rte_thread_create() function\nthat will create a new thread and set its attributes according to attr.\n\n# Arguments\n\n* `attr` -\nThread attributes to initialize.\n\n# Returns\n\nOn success, return 0.\nOn failure, return a positive errno-style error number."]
    pub fn rte_thread_attr_init(attr: *mut rte_thread_attr_t) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    #[doc = "Set the thread priority value in the thread attributes pointed to\nby 'thread_attr'.\n\n# Arguments\n\n* `thread_attr` -\nPoints to the thread attributes in which priority will be updated.\n* `priority` -\nPoints to the value of the priority to be set.\n\n# Returns\n\nOn success, return 0.\nOn failure, return a positive errno-style error number."]
    pub fn rte_thread_attr_set_priority(
        thread_attr: *mut rte_thread_attr_t,
        priority: rte_thread_priority::Type,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    #[doc = "Get the priority of a thread.\n\n# Arguments\n\n* `thread_id` -\nId of the thread for which to get priority.\n* `priority` -\nLocation to store the retrieved priority.\n\n# Returns\n\nOn success, return 0.\nOn failure, return a positive errno-style error number."]
    pub fn rte_thread_get_priority(
        thread_id: rte_thread_t,
        priority: *mut rte_thread_priority::Type,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    #[doc = "Set the priority of a thread.\n\n# Arguments\n\n* `thread_id` -\nId of the thread for which to set priority.\n* `priority` -\nPriority value to be set.\n\n# Returns\n\nOn success, return 0.\nOn failure, return a positive errno-style error number."]
    pub fn rte_thread_set_priority(
        thread_id: rte_thread_t,
        priority: rte_thread_priority::Type,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    #[doc = "Create a TLS data key visible to all threads in the process.\nthe created key is later used to get/set a value.\nand optional destructor can be set to be called when a thread exits.\n\n# Arguments\n\n* `key` -\nPointer to store the allocated key.\n* `destructor` -\nThe function to be called when the thread exits.\nIgnored on Windows OS.\n\n# Returns\n\nOn success, zero.\nOn failure, a negative number and an error number is set in rte_errno.\nrte_errno can be: ENOMEM  - Memory allocation error.\nENOEXEC - Specific OS error."]
    pub fn rte_thread_key_create(
        key: *mut rte_thread_key,
        destructor: ::core::option::Option<unsafe extern "C" fn(arg1: *mut ::core::ffi::c_void)>,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    #[doc = "Delete a TLS data key visible to all threads in the process.\n\n# Arguments\n\n* `key` -\nThe key allocated by rte_thread_key_create().\n\n# Returns\n\nOn success, zero.\nOn failure, a negative number and an error number is set in rte_errno.\nrte_errno can be: EINVAL  - Invalid parameter passed.\nENOEXEC - Specific OS error."]
    pub fn rte_thread_key_delete(key: rte_thread_key) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    #[doc = "Set value bound to the TLS key on behalf of the calling thread.\n\n# Arguments\n\n* `key` -\nThe key allocated by rte_thread_key_create().\n* `value` -\nThe value bound to the rte_thread_key key for the calling thread.\n\n# Returns\n\nOn success, zero.\nOn failure, a negative number and an error number is set in rte_errno.\nrte_errno can be: EINVAL  - Invalid parameter passed.\nENOEXEC - Specific OS error."]
    pub fn rte_thread_value_set(
        key: rte_thread_key,
        value: *const ::core::ffi::c_void,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    #[doc = "Get value bound to the TLS key on behalf of the calling thread.\n\n# Arguments\n\n* `key` -\nThe key allocated by rte_thread_key_create().\n\n# Returns\n\nOn success, value data pointer (can also be NULL).\nOn failure, NULL and an error number is set in rte_errno.\nrte_errno can be: EINVAL  - Invalid parameter passed.\nENOEXEC - Specific OS error."]
    pub fn rte_thread_value_get(key: rte_thread_key) -> *mut ::core::ffi::c_void;
}
pub mod rte_lcore_role_t {
    #[doc = "The lcore role (used in RTE or not)."]
    pub type Type = ::core::ffi::c_uint;
    pub const ROLE_RTE: Type = 0;
    pub const ROLE_OFF: Type = 1;
    pub const ROLE_SERVICE: Type = 2;
    pub const ROLE_NON_EAL: Type = 3;
}
unsafe extern "C" {
    #[doc = "Get a lcore's role.\n\n# Arguments\n\n* `lcore_id` -\nThe identifier of the lcore, which MUST be between 0 and RTE_MAX_LCORE-1.\n\n# Returns\n\nThe role of the lcore."]
    pub fn rte_eal_lcore_role(lcore_id: ::core::ffi::c_uint) -> rte_lcore_role_t::Type;
}
unsafe extern "C" {
    #[doc = "Test if the core supplied has a specific role\n\n# Arguments\n\n* `lcore_id` -\nThe identifier of the lcore, which MUST be between 0 and\nRTE_MAX_LCORE-1.\n* `role` -\nThe role to be checked against.\n\n# Returns\n\nBoolean value: positive if test is true; otherwise returns 0."]
    pub fn rte_lcore_has_role(
        lcore_id: ::core::ffi::c_uint,
        role: rte_lcore_role_t::Type,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    #[doc = "Return the Application thread ID of the execution unit.\nNote: in most cases the lcore id returned here will also correspond\nto the processor id of the CPU on which the thread is pinned, this\nwill not be the case if the user has explicitly changed the thread to\ncore affinities using --lcores EAL argument e.g. --lcores '(0-3)@10' to run threads with lcore IDs 0, 1, 2 and 3 on physical core 10..\n\n# Returns\n\nLogical core ID (in EAL thread or registered non-EAL thread) or\nLCORE_ID_ANY (in unregistered non-EAL thread)"]
    #[link_name = "rte_lcore_id_w"]
    pub fn rte_lcore_id() -> ::core::ffi::c_uint;
}
unsafe extern "C" {
    #[doc = "Get the id of the main lcore\n\n# Returns\n\nthe id of the main lcore"]
    pub fn rte_get_main_lcore() -> ::core::ffi::c_uint;
}
unsafe extern "C" {
    #[doc = "Return the number of execution units (lcores) on the system.\n\n# Returns\n\nthe number of execution units (lcores) on the system."]
    pub fn rte_lcore_count() -> ::core::ffi::c_uint;
}
unsafe extern "C" {
    #[doc = "Return the index of the lcore starting from zero.\nWhen option -c or -l is given, the index corresponds\nto the order in the list.\nFor example:\n-c 0x30, lcore 4 has index 0, and 5 has index 1.\n-l 22,18 lcore 22 has index 0, and 18 has index 1.\n\n# Arguments\n\n* `lcore_id` -\nThe targeted lcore, or -1 for the current one.\n\n# Returns\n\nThe relative index, or -1 if not enabled."]
    pub fn rte_lcore_index(lcore_id: ::core::ffi::c_int) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    #[doc = "Return the ID of the physical socket of the logical core we are\nrunning on.\n\n# Returns\n\nthe ID of current lcoreid's physical socket"]
    pub fn rte_socket_id() -> ::core::ffi::c_uint;
}
unsafe extern "C" {
    #[doc = "Return number of physical sockets detected on the system.\nNote that number of nodes may not be correspondent to their physical id's:\nfor example, a system may report two socket id's, but the actual socket id's\nmay be 0 and 8.\n\n# Returns\n\nthe number of physical sockets as recognized by EAL"]
    pub fn rte_socket_count() -> ::core::ffi::c_uint;
}
unsafe extern "C" {
    #[doc = "Return socket id with a particular index.\nThis will return socket id at a particular position in list of all detected\nphysical socket id's. For example, on a machine with sockets [0, 8], passing\n1 as a parameter will return 8.\n\n# Arguments\n\n* `idx` -\nindex of physical socket id to return\n\n# Returns\n\n- physical socket id as recognized by EAL\n- -1 on error, with errno set to EINVAL"]
    pub fn rte_socket_id_by_idx(idx: ::core::ffi::c_uint) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    #[doc = "Get the ID of the physical socket of the specified lcore\n\n# Arguments\n\n* `lcore_id` -\nthe targeted lcore, which MUST be between 0 and RTE_MAX_LCORE-1.\n\n# Returns\n\nthe ID of lcoreid's physical socket"]
    pub fn rte_lcore_to_socket_id(lcore_id: ::core::ffi::c_uint) -> ::core::ffi::c_uint;
}
unsafe extern "C" {
    #[doc = "Return the id of the lcore on a socket starting from zero.\n\n# Arguments\n\n* `lcore_id` -\nThe targeted lcore, or -1 for the current one.\n\n# Returns\n\nThe relative index, or -1 if not enabled."]
    pub fn rte_lcore_to_cpu_id(lcore_id: ::core::ffi::c_int) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    #[doc = "Test if an lcore is enabled.\n\n# Arguments\n\n* `lcore_id` -\nThe identifier of the lcore, which MUST be between 0 and\nRTE_MAX_LCORE-1.\n\n# Returns\n\nTrue if the given lcore is enabled; false otherwise."]
    pub fn rte_lcore_is_enabled(lcore_id: ::core::ffi::c_uint) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    #[doc = "Get the next enabled lcore ID.\n\n# Arguments\n\n* `i` -\nThe current lcore (reference).\n* `skip_main` -\nIf true, do not return the ID of the main lcore.\n* `wrap` -\nIf true, go back to 0 when RTE_MAX_LCORE is reached; otherwise,\nreturn RTE_MAX_LCORE.\n\n# Returns\n\nThe next lcore_id or RTE_MAX_LCORE if not found."]
    pub fn rte_get_next_lcore(
        i: ::core::ffi::c_uint,
        skip_main: ::core::ffi::c_int,
        wrap: ::core::ffi::c_int,
    ) -> ::core::ffi::c_uint;
}
#[doc = "Callback prototype for initializing lcores.\n\n# Arguments\n\n* `lcore_id` -\nThe lcore to consider.\n* `arg` -\nAn opaque pointer passed at callback registration.\n\n# Returns\n\n- -1 when refusing this operation,\n- 0 otherwise."]
pub type rte_lcore_init_cb = ::core::option::Option<
    unsafe extern "C" fn(
        lcore_id: ::core::ffi::c_uint,
        arg: *mut ::core::ffi::c_void,
    ) -> ::core::ffi::c_int,
>;
#[doc = "Callback prototype for uninitializing lcores.\n\n# Arguments\n\n* `lcore_id` -\nThe lcore to consider.\n* `arg` -\nAn opaque pointer passed at callback registration."]
pub type rte_lcore_uninit_cb = ::core::option::Option<
    unsafe extern "C" fn(lcore_id: ::core::ffi::c_uint, arg: *mut ::core::ffi::c_void),
>;
unsafe extern "C" {
    #[doc = "Register callbacks invoked when initializing and uninitializing a lcore.\nThis function calls the init callback with all initialized lcores.\nAny error reported by the init callback triggers a rollback calling the\nuninit callback for each lcore.\nIf this step succeeds, the callbacks are put in the lcore callbacks list\nthat will get called for each lcore allocation/release.\nNote: callbacks execution is serialised under a write lock protecting the\nlcores and callbacks list.\n\n# Arguments\n\n* `name` -\nA name serving as a small description for this callback.\n* `init` -\nThe callback invoked when a lcore_id is initialized.\ninit can be NULL.\n* `uninit` -\nThe callback invoked when a lcore_id is uninitialized.\nuninit can be NULL.\n* `arg` -\nAn optional argument that gets passed to the callback when it gets\ninvoked.\n\n# Returns\n\nOn success, returns an opaque pointer for the registered object.\nOn failure (either memory allocation issue in the function itself or an\nerror is returned by the init callback itself), returns NULL."]
    pub fn rte_lcore_callback_register(
        name: *const ::core::ffi::c_char,
        init: rte_lcore_init_cb,
        uninit: rte_lcore_uninit_cb,
        arg: *mut ::core::ffi::c_void,
    ) -> *mut ::core::ffi::c_void;
}
unsafe extern "C" {
    #[doc = "Unregister callbacks previously registered with rte_lcore_callback_register.\nThis function calls the uninit callback with all initialized lcores.\nThe callbacks are then removed from the lcore callbacks list.\n\n# Arguments\n\n* `handle` -\nThe handle pointer returned by a former successful call to\nrte_lcore_callback_register."]
    pub fn rte_lcore_callback_unregister(handle: *mut ::core::ffi::c_void);
}
#[doc = "Callback prototype for iterating over lcores.\n\n# Arguments\n\n* `lcore_id` -\nThe lcore to consider.\n* `arg` -\nAn opaque pointer coming from the caller.\n\n# Returns\n\n- 0 lets the iteration continue.\n- !0 makes the iteration stop."]
pub type rte_lcore_iterate_cb = ::core::option::Option<
    unsafe extern "C" fn(
        lcore_id: ::core::ffi::c_uint,
        arg: *mut ::core::ffi::c_void,
    ) -> ::core::ffi::c_int,
>;
unsafe extern "C" {
    #[doc = "Iterate on all active lcores (ROLE_RTE, ROLE_SERVICE and ROLE_NON_EAL).\nNo modification on the lcore states is allowed in the callback.\nNote: as opposed to init/uninit callbacks, iteration callbacks can be\ninvoked in parallel as they are run under a read lock protecting the lcores\nand callbacks list.\n\n# Arguments\n\n* `cb` -\nThe callback that gets passed each lcore.\n* `arg` -\nAn opaque pointer passed to cb.\n\n# Returns\n\nSame return code as the callback last invocation (see rte_lcore_iterate_cb\ndescription)."]
    pub fn rte_lcore_iterate(
        cb: rte_lcore_iterate_cb,
        arg: *mut ::core::ffi::c_void,
    ) -> ::core::ffi::c_int;
}
#[doc = "lcore usage statistics."]
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct rte_lcore_usage {
    #[doc = "The total amount of time that the application has been running on\nthis lcore, in TSC cycles."]
    pub total_cycles: u64,
    #[doc = "The amount of time the application was busy, handling some\nworkload on this lcore, in TSC cycles."]
    pub busy_cycles: u64,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of rte_lcore_usage"][::core::mem::size_of::<rte_lcore_usage>() - 16usize];
    ["Alignment of rte_lcore_usage"][::core::mem::align_of::<rte_lcore_usage>() - 8usize];
    ["Offset of field: rte_lcore_usage::total_cycles"]
        [::core::mem::offset_of!(rte_lcore_usage, total_cycles) - 0usize];
    ["Offset of field: rte_lcore_usage::busy_cycles"]
        [::core::mem::offset_of!(rte_lcore_usage, busy_cycles) - 8usize];
};
#[doc = "Callback to allow applications to report lcore usage.\n\n# Arguments\n\n* `lcore_id` [in]  -\nThe lcore to consider.\n* `usage` [out]  -\nCounters representing this lcore usage. This can never be NULL.\n\n# Returns\n\n- 0 if fields in usage were updated successfully. The fields that the\napplication does not support must not be modified.\n- a negative value if the information is not available or if any error\noccurred."]
pub type rte_lcore_usage_cb = ::core::option::Option<
    unsafe extern "C" fn(
        lcore_id: ::core::ffi::c_uint,
        usage: *mut rte_lcore_usage,
    ) -> ::core::ffi::c_int,
>;
unsafe extern "C" {
    #[doc = "Register a callback from an application to be called in rte_lcore_dump() and\nthe /eal/lcore/info telemetry endpoint handler. Applications are expected to\nreport lcore usage statistics via this callback.\nIf a callback was already registered, it can be replaced with another callback\nor unregistered with NULL. The previously registered callback may remain in\nuse for an undetermined period of time.\n\n# Arguments\n\n* `cb` -\nThe callback function."]
    pub fn rte_lcore_register_usage_cb(cb: rte_lcore_usage_cb);
}
unsafe extern "C" {
    #[doc = "List all lcores.\n\n# Arguments\n\n* `f` -\nThe output stream where the dump should be sent."]
    pub fn rte_lcore_dump(f: *mut FILE);
}
unsafe extern "C" {
    #[doc = "Register current non-EAL thread as a lcore.\n> **Note** This API is not compatible with the multi-process feature:\n- if a primary process registers a non-EAL thread, then no secondary process\nwill initialise.\n- if a secondary process initialises successfully, trying to register a\nnon-EAL thread from either primary or secondary processes will always end\nup with the thread getting LCORE_ID_ANY as lcore.\n\n# Returns\n\nOn success, return 0; otherwise return -1 with rte_errno set."]
    pub fn rte_thread_register() -> ::core::ffi::c_int;
}
unsafe extern "C" {
    #[doc = "Unregister current thread and release lcore if one was associated."]
    pub fn rte_thread_unregister();
}
#[doc = "SSE/SSE2 types"]
pub type __m128i = [::core::ffi::c_longlong; 2usize];
#[doc = "The memory order is an integer type in GCC built-ins,\nnot an enumerated type like in C11."]
pub type rte_memory_order = ::core::ffi::c_int;
#[doc = "128-bit integer structure."]
#[repr(C)]
#[repr(align(16))]
#[derive(Copy, Clone)]
pub struct rte_int128_t {
    pub anon1: rte_int128_t__bindgen_ty_1,
}
#[repr(C)]
#[repr(align(16))]
#[derive(Copy, Clone)]
pub union rte_int128_t__bindgen_ty_1 {
    pub val: [u64; 2usize],
    pub int128: i128,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of rte_int128_t__bindgen_ty_1"]
        [::core::mem::size_of::<rte_int128_t__bindgen_ty_1>() - 16usize];
    ["Alignment of rte_int128_t__bindgen_ty_1"]
        [::core::mem::align_of::<rte_int128_t__bindgen_ty_1>() - 16usize];
    ["Offset of field: rte_int128_t__bindgen_ty_1::val"]
        [::core::mem::offset_of!(rte_int128_t__bindgen_ty_1, val) - 0usize];
    ["Offset of field: rte_int128_t__bindgen_ty_1::int128"]
        [::core::mem::offset_of!(rte_int128_t__bindgen_ty_1, int128) - 0usize];
};
impl Default for rte_int128_t__bindgen_ty_1 {
    fn default() -> Self {
        let mut s = ::core::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::core::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of rte_int128_t"][::core::mem::size_of::<rte_int128_t>() - 16usize];
    ["Alignment of rte_int128_t"][::core::mem::align_of::<rte_int128_t>() - 16usize];
};
impl Default for rte_int128_t {
    fn default() -> Self {
        let mut s = ::core::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::core::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
unsafe extern "C" {
    #[doc = "From Intel Software Development Manual; Vol 3;\n8.2.2 Memory Ordering in P6 and More Recent Processor Families:\n...\n. Reads are not reordered with other reads.\n. Writes are not reordered with older reads.\n. Writes to memory are not reordered with other writes,\nwith the following exceptions:\n. streaming stores (writes) executed with the non-temporal move\ninstructions (MOVNTI, MOVNTQ, MOVNTDQ, MOVNTPS, and MOVNTPD); and\n. string operations (see Section 8.2.4.1).\n...\n. Reads may be reordered with older writes to different locations but not\nwith older writes to the same location.\n. Reads or writes cannot be reordered with I/O instructions,\nlocked instructions, or serializing instructions.\n. Reads cannot pass earlier LFENCE and MFENCE instructions.\n. Writes ... cannot pass earlier LFENCE, SFENCE, and MFENCE instructions.\n. LFENCE instructions cannot pass earlier reads.\n. SFENCE instructions cannot pass earlier writes ...\n. MFENCE instructions cannot pass earlier reads, writes ...\nAs pointed by Java guys, that makes possible to use lock-prefixed\ninstructions to get the same effect as mfence and on most modern HW\nthat gives a better performance then using mfence:\nhttps://shipilev.net/blog/2014/on-the-fence-with-dependencies/\nBasic idea is to use lock prefixed add with some dummy memory location\nas the destination. From their experiments 128B(2 cache lines) below\ncurrent stack pointer looks like a good candidate.\nSo below we use that technique for rte_smp_mb() implementation."]
    #[link_name = "rte_smp_mb_w"]
    pub fn rte_smp_mb();
}
unsafe extern "C" {
    #[doc = "Pause CPU execution for a short while\nThis call is intended for tight loops which poll a shared resource or wait\nfor an event. A short pause within the loop may reduce the power consumption."]
    #[link_name = "rte_pause_w"]
    pub fn rte_pause();
}
unsafe extern "C" {
    #[doc = "Wait for *addr to be updated with a 16-bit expected value, with a relaxed\nmemory ordering model meaning the loads around this API can be reordered.\n\n# Arguments\n\n* `addr` -\nA pointer to the memory location.\n* `expected` -\nA 16-bit expected value to be in the memory location.\n* `memorder` -\nTwo different memory orders that can be specified:\nrte_memory_order_acquire and rte_memory_order_relaxed."]
    #[link_name = "rte_wait_until_equal_16_w"]
    pub fn rte_wait_until_equal_16(addr: *mut u16, expected: u16, memorder: rte_memory_order);
}
unsafe extern "C" {
    #[doc = "Wait for *addr to be updated with a 32-bit expected value, with a relaxed\nmemory ordering model meaning the loads around this API can be reordered.\n\n# Arguments\n\n* `addr` -\nA pointer to the memory location.\n* `expected` -\nA 32-bit expected value to be in the memory location.\n* `memorder` -\nTwo different memory orders that can be specified:\nrte_memory_order_acquire and rte_memory_order_relaxed."]
    #[link_name = "rte_wait_until_equal_32_w"]
    pub fn rte_wait_until_equal_32(addr: *mut u32, expected: u32, memorder: rte_memory_order);
}
unsafe extern "C" {
    #[doc = "Wait for *addr to be updated with a 64-bit expected value, with a relaxed\nmemory ordering model meaning the loads around this API can be reordered.\n\n# Arguments\n\n* `addr` -\nA pointer to the memory location.\n* `expected` -\nA 64-bit expected value to be in the memory location.\n* `memorder` -\nTwo different memory orders that can be specified:\nrte_memory_order_acquire and rte_memory_order_relaxed."]
    #[link_name = "rte_wait_until_equal_64_w"]
    pub fn rte_wait_until_equal_64(addr: *mut u64, expected: u64, memorder: rte_memory_order);
}
#[doc = "The rte_spinlock_t type."]
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct rte_spinlock_t {
    #[doc = "< lock status 0 = unlocked, 1 = locked"]
    pub locked: ::core::ffi::c_int,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of rte_spinlock_t"][::core::mem::size_of::<rte_spinlock_t>() - 4usize];
    ["Alignment of rte_spinlock_t"][::core::mem::align_of::<rte_spinlock_t>() - 4usize];
    ["Offset of field: rte_spinlock_t::locked"]
        [::core::mem::offset_of!(rte_spinlock_t, locked) - 0usize];
};
unsafe extern "C" {
    #[doc = "Initialize the spinlock to an unlocked state.\n\n# Arguments\n\n* `sl` -\nA pointer to the spinlock."]
    #[link_name = "rte_spinlock_init_w"]
    pub fn rte_spinlock_init(sl: *mut rte_spinlock_t);
}
unsafe extern "C" {
    #[doc = "Take the spinlock.\n\n# Arguments\n\n* `sl` -\nA pointer to the spinlock."]
    #[link_name = "rte_spinlock_lock_w"]
    pub fn rte_spinlock_lock(sl: *mut rte_spinlock_t);
}
unsafe extern "C" {
    #[doc = "Release the spinlock.\n\n# Arguments\n\n* `sl` -\nA pointer to the spinlock."]
    #[link_name = "rte_spinlock_unlock_w"]
    pub fn rte_spinlock_unlock(sl: *mut rte_spinlock_t);
}
unsafe extern "C" {
    #[doc = "Try to take the lock.\n\n# Arguments\n\n* `sl` -\nA pointer to the spinlock.\n\n# Returns\n\n1 if the lock is successfully taken; 0 otherwise."]
    #[link_name = "rte_spinlock_trylock_w"]
    pub fn rte_spinlock_trylock(sl: *mut rte_spinlock_t) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    #[doc = "Test if the lock is taken.\n\n# Arguments\n\n* `sl` -\nA pointer to the spinlock.\n\n# Returns\n\n1 if the lock is currently taken; 0 otherwise."]
    #[link_name = "rte_spinlock_is_locked_w"]
    pub fn rte_spinlock_is_locked(sl: *mut rte_spinlock_t) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    #[doc = "Test if hardware transactional memory (lock elision) is supported\n\n# Returns\n\n1 if the hardware transactional memory is supported; 0 otherwise."]
    #[link_name = "rte_tm_supported_w"]
    pub fn rte_tm_supported() -> ::core::ffi::c_int;
}
unsafe extern "C" {
    #[doc = "Try to execute critical section in a hardware memory transaction,\nif it fails or not available take the spinlock.\nNOTE: An attempt to perform a HW I/O operation inside a hardware memory\ntransaction always aborts the transaction since the CPU is not able to\nroll-back should the transaction fail. Therefore, hardware transactional\nlocks are not advised to be used around rte_eth_rx_burst() and\nrte_eth_tx_burst() calls.\n\n# Arguments\n\n* `sl` -\nA pointer to the spinlock."]
    #[link_name = "rte_spinlock_lock_tm_w"]
    pub fn rte_spinlock_lock_tm(sl: *mut rte_spinlock_t);
}
unsafe extern "C" {
    #[doc = "Commit hardware memory transaction or release the spinlock if\nthe spinlock is used as a fall-back\n\n# Arguments\n\n* `sl` -\nA pointer to the spinlock."]
    #[link_name = "rte_spinlock_unlock_tm_w"]
    pub fn rte_spinlock_unlock_tm(sl: *mut rte_spinlock_t);
}
unsafe extern "C" {
    #[doc = "Try to execute critical section in a hardware memory transaction,\nif it fails or not available try to take the lock.\nNOTE: An attempt to perform a HW I/O operation inside a hardware memory\ntransaction always aborts the transaction since the CPU is not able to\nroll-back should the transaction fail. Therefore, hardware transactional\nlocks are not advised to be used around rte_eth_rx_burst() and\nrte_eth_tx_burst() calls.\n\n# Arguments\n\n* `sl` -\nA pointer to the spinlock.\n\n# Returns\n\n1 if the hardware memory transaction is successfully started\nor lock is successfully taken; 0 otherwise."]
    #[link_name = "rte_spinlock_trylock_tm_w"]
    pub fn rte_spinlock_trylock_tm(sl: *mut rte_spinlock_t) -> ::core::ffi::c_int;
}
#[doc = "The rte_spinlock_recursive_t type."]
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct rte_spinlock_recursive_t {
    #[doc = "< the actual spinlock"]
    pub sl: rte_spinlock_t,
    #[doc = "< core id using lock, -1 for unused"]
    pub user: ::core::ffi::c_int,
    #[doc = "< count of time this lock has been called"]
    pub count: ::core::ffi::c_int,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of rte_spinlock_recursive_t"]
        [::core::mem::size_of::<rte_spinlock_recursive_t>() - 12usize];
    ["Alignment of rte_spinlock_recursive_t"]
        [::core::mem::align_of::<rte_spinlock_recursive_t>() - 4usize];
    ["Offset of field: rte_spinlock_recursive_t::sl"]
        [::core::mem::offset_of!(rte_spinlock_recursive_t, sl) - 0usize];
    ["Offset of field: rte_spinlock_recursive_t::user"]
        [::core::mem::offset_of!(rte_spinlock_recursive_t, user) - 4usize];
    ["Offset of field: rte_spinlock_recursive_t::count"]
        [::core::mem::offset_of!(rte_spinlock_recursive_t, count) - 8usize];
};
unsafe extern "C" {
    #[doc = "Initialize the recursive spinlock to an unlocked state.\n\n# Arguments\n\n* `slr` -\nA pointer to the recursive spinlock."]
    #[link_name = "rte_spinlock_recursive_init_w"]
    pub fn rte_spinlock_recursive_init(slr: *mut rte_spinlock_recursive_t);
}
unsafe extern "C" {
    #[doc = "Take the recursive spinlock.\n\n# Arguments\n\n* `slr` -\nA pointer to the recursive spinlock."]
    #[link_name = "rte_spinlock_recursive_lock_w"]
    pub fn rte_spinlock_recursive_lock(slr: *mut rte_spinlock_recursive_t);
}
unsafe extern "C" {
    #[doc = "Release the recursive spinlock.\n\n# Arguments\n\n* `slr` -\nA pointer to the recursive spinlock."]
    #[link_name = "rte_spinlock_recursive_unlock_w"]
    pub fn rte_spinlock_recursive_unlock(slr: *mut rte_spinlock_recursive_t);
}
unsafe extern "C" {
    #[doc = "Try to take the recursive lock.\n\n# Arguments\n\n* `slr` -\nA pointer to the recursive spinlock.\n\n# Returns\n\n1 if the lock is successfully taken; 0 otherwise."]
    #[link_name = "rte_spinlock_recursive_trylock_w"]
    pub fn rte_spinlock_recursive_trylock(slr: *mut rte_spinlock_recursive_t)
    -> ::core::ffi::c_int;
}
unsafe extern "C" {
    #[doc = "Try to execute critical section in a hardware memory transaction,\nif it fails or not available take the recursive spinlocks\nNOTE: An attempt to perform a HW I/O operation inside a hardware memory\ntransaction always aborts the transaction since the CPU is not able to\nroll-back should the transaction fail. Therefore, hardware transactional\nlocks are not advised to be used around rte_eth_rx_burst() and\nrte_eth_tx_burst() calls.\n\n# Arguments\n\n* `slr` -\nA pointer to the recursive spinlock."]
    #[link_name = "rte_spinlock_recursive_lock_tm_w"]
    pub fn rte_spinlock_recursive_lock_tm(slr: *mut rte_spinlock_recursive_t);
}
unsafe extern "C" {
    #[doc = "Commit hardware memory transaction or release the recursive spinlock\nif the recursive spinlock is used as a fall-back\n\n# Arguments\n\n* `slr` -\nA pointer to the recursive spinlock."]
    #[link_name = "rte_spinlock_recursive_unlock_tm_w"]
    pub fn rte_spinlock_recursive_unlock_tm(slr: *mut rte_spinlock_recursive_t);
}
unsafe extern "C" {
    #[doc = "Try to execute critical section in a hardware memory transaction,\nif it fails or not available try to take the recursive lock\nNOTE: An attempt to perform a HW I/O operation inside a hardware memory\ntransaction always aborts the transaction since the CPU is not able to\nroll-back should the transaction fail. Therefore, hardware transactional\nlocks are not advised to be used around rte_eth_rx_burst() and\nrte_eth_tx_burst() calls.\n\n# Arguments\n\n* `slr` -\nA pointer to the recursive spinlock.\n\n# Returns\n\n1 if the hardware memory transaction is successfully started\nor lock is successfully taken; 0 otherwise."]
    #[link_name = "rte_spinlock_recursive_trylock_tm_w"]
    pub fn rte_spinlock_recursive_trylock_tm(
        slr: *mut rte_spinlock_recursive_t,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    #[link_name = "rte_xbegin_w"]
    pub fn rte_xbegin() -> ::core::ffi::c_uint;
}
unsafe extern "C" {
    #[link_name = "rte_xend_w"]
    pub fn rte_xend();
}
unsafe extern "C" {
    #[link_name = "rte_xtest_w"]
    pub fn rte_xtest() -> ::core::ffi::c_int;
}
pub mod rte_cpu_flag_t {
    #[doc = "Enumeration of all CPU features supported"]
    pub type Type = ::core::ffi::c_uint;
    #[doc = "< SSE3"]
    pub const RTE_CPUFLAG_SSE3: Type = 0;
    #[doc = "< PCLMULQDQ"]
    pub const RTE_CPUFLAG_PCLMULQDQ: Type = 1;
    #[doc = "< DTES64"]
    pub const RTE_CPUFLAG_DTES64: Type = 2;
    #[doc = "< MONITOR"]
    pub const RTE_CPUFLAG_MONITOR: Type = 3;
    #[doc = "< DS_CPL"]
    pub const RTE_CPUFLAG_DS_CPL: Type = 4;
    #[doc = "< VMX"]
    pub const RTE_CPUFLAG_VMX: Type = 5;
    #[doc = "< SMX"]
    pub const RTE_CPUFLAG_SMX: Type = 6;
    #[doc = "< EIST"]
    pub const RTE_CPUFLAG_EIST: Type = 7;
    #[doc = "< TM2"]
    pub const RTE_CPUFLAG_TM2: Type = 8;
    #[doc = "< SSSE3"]
    pub const RTE_CPUFLAG_SSSE3: Type = 9;
    #[doc = "< CNXT_ID"]
    pub const RTE_CPUFLAG_CNXT_ID: Type = 10;
    #[doc = "< FMA"]
    pub const RTE_CPUFLAG_FMA: Type = 11;
    #[doc = "< CMPXCHG16B"]
    pub const RTE_CPUFLAG_CMPXCHG16B: Type = 12;
    #[doc = "< XTPR"]
    pub const RTE_CPUFLAG_XTPR: Type = 13;
    #[doc = "< PDCM"]
    pub const RTE_CPUFLAG_PDCM: Type = 14;
    #[doc = "< PCID"]
    pub const RTE_CPUFLAG_PCID: Type = 15;
    #[doc = "< DCA"]
    pub const RTE_CPUFLAG_DCA: Type = 16;
    #[doc = "< SSE4_1"]
    pub const RTE_CPUFLAG_SSE4_1: Type = 17;
    #[doc = "< SSE4_2"]
    pub const RTE_CPUFLAG_SSE4_2: Type = 18;
    #[doc = "< X2APIC"]
    pub const RTE_CPUFLAG_X2APIC: Type = 19;
    #[doc = "< MOVBE"]
    pub const RTE_CPUFLAG_MOVBE: Type = 20;
    #[doc = "< POPCNT"]
    pub const RTE_CPUFLAG_POPCNT: Type = 21;
    #[doc = "< TSC_DEADLINE"]
    pub const RTE_CPUFLAG_TSC_DEADLINE: Type = 22;
    #[doc = "< AES"]
    pub const RTE_CPUFLAG_AES: Type = 23;
    #[doc = "< XSAVE"]
    pub const RTE_CPUFLAG_XSAVE: Type = 24;
    #[doc = "< OSXSAVE"]
    pub const RTE_CPUFLAG_OSXSAVE: Type = 25;
    #[doc = "< AVX"]
    pub const RTE_CPUFLAG_AVX: Type = 26;
    #[doc = "< F16C"]
    pub const RTE_CPUFLAG_F16C: Type = 27;
    #[doc = "< RDRAND"]
    pub const RTE_CPUFLAG_RDRAND: Type = 28;
    #[doc = "< Running in a VM"]
    pub const RTE_CPUFLAG_HYPERVISOR: Type = 29;
    #[doc = "< FPU"]
    pub const RTE_CPUFLAG_FPU: Type = 30;
    #[doc = "< VME"]
    pub const RTE_CPUFLAG_VME: Type = 31;
    #[doc = "< DE"]
    pub const RTE_CPUFLAG_DE: Type = 32;
    #[doc = "< PSE"]
    pub const RTE_CPUFLAG_PSE: Type = 33;
    #[doc = "< TSC"]
    pub const RTE_CPUFLAG_TSC: Type = 34;
    #[doc = "< MSR"]
    pub const RTE_CPUFLAG_MSR: Type = 35;
    #[doc = "< PAE"]
    pub const RTE_CPUFLAG_PAE: Type = 36;
    #[doc = "< MCE"]
    pub const RTE_CPUFLAG_MCE: Type = 37;
    #[doc = "< CX8"]
    pub const RTE_CPUFLAG_CX8: Type = 38;
    #[doc = "< APIC"]
    pub const RTE_CPUFLAG_APIC: Type = 39;
    #[doc = "< SEP"]
    pub const RTE_CPUFLAG_SEP: Type = 40;
    #[doc = "< MTRR"]
    pub const RTE_CPUFLAG_MTRR: Type = 41;
    #[doc = "< PGE"]
    pub const RTE_CPUFLAG_PGE: Type = 42;
    #[doc = "< MCA"]
    pub const RTE_CPUFLAG_MCA: Type = 43;
    #[doc = "< CMOV"]
    pub const RTE_CPUFLAG_CMOV: Type = 44;
    #[doc = "< PAT"]
    pub const RTE_CPUFLAG_PAT: Type = 45;
    #[doc = "< PSE36"]
    pub const RTE_CPUFLAG_PSE36: Type = 46;
    #[doc = "< PSN"]
    pub const RTE_CPUFLAG_PSN: Type = 47;
    #[doc = "< CLFSH"]
    pub const RTE_CPUFLAG_CLFSH: Type = 48;
    #[doc = "< DS"]
    pub const RTE_CPUFLAG_DS: Type = 49;
    #[doc = "< ACPI"]
    pub const RTE_CPUFLAG_ACPI: Type = 50;
    #[doc = "< MMX"]
    pub const RTE_CPUFLAG_MMX: Type = 51;
    #[doc = "< FXSR"]
    pub const RTE_CPUFLAG_FXSR: Type = 52;
    #[doc = "< SSE"]
    pub const RTE_CPUFLAG_SSE: Type = 53;
    #[doc = "< SSE2"]
    pub const RTE_CPUFLAG_SSE2: Type = 54;
    #[doc = "< SS"]
    pub const RTE_CPUFLAG_SS: Type = 55;
    #[doc = "< HTT"]
    pub const RTE_CPUFLAG_HTT: Type = 56;
    #[doc = "< TM"]
    pub const RTE_CPUFLAG_TM: Type = 57;
    #[doc = "< PBE"]
    pub const RTE_CPUFLAG_PBE: Type = 58;
    #[doc = "< DIGTEMP"]
    pub const RTE_CPUFLAG_DIGTEMP: Type = 59;
    #[doc = "< TRBOBST"]
    pub const RTE_CPUFLAG_TRBOBST: Type = 60;
    #[doc = "< ARAT"]
    pub const RTE_CPUFLAG_ARAT: Type = 61;
    #[doc = "< PLN"]
    pub const RTE_CPUFLAG_PLN: Type = 62;
    #[doc = "< ECMD"]
    pub const RTE_CPUFLAG_ECMD: Type = 63;
    #[doc = "< PTM"]
    pub const RTE_CPUFLAG_PTM: Type = 64;
    #[doc = "< MPERF_APERF_MSR"]
    pub const RTE_CPUFLAG_MPERF_APERF_MSR: Type = 65;
    #[doc = "< ACNT2"]
    pub const RTE_CPUFLAG_ACNT2: Type = 66;
    #[doc = "< ENERGY_EFF"]
    pub const RTE_CPUFLAG_ENERGY_EFF: Type = 67;
    #[doc = "< FSGSBASE"]
    pub const RTE_CPUFLAG_FSGSBASE: Type = 68;
    #[doc = "< BMI1"]
    pub const RTE_CPUFLAG_BMI1: Type = 69;
    #[doc = "< Hardware Lock elision"]
    pub const RTE_CPUFLAG_HLE: Type = 70;
    #[doc = "< AVX2"]
    pub const RTE_CPUFLAG_AVX2: Type = 71;
    #[doc = "< SMEP"]
    pub const RTE_CPUFLAG_SMEP: Type = 72;
    #[doc = "< BMI2"]
    pub const RTE_CPUFLAG_BMI2: Type = 73;
    #[doc = "< ERMS"]
    pub const RTE_CPUFLAG_ERMS: Type = 74;
    #[doc = "< INVPCID"]
    pub const RTE_CPUFLAG_INVPCID: Type = 75;
    #[doc = "< Transactional memory"]
    pub const RTE_CPUFLAG_RTM: Type = 76;
    #[doc = "< AVX512F"]
    pub const RTE_CPUFLAG_AVX512F: Type = 77;
    #[doc = "< RDSEED instruction"]
    pub const RTE_CPUFLAG_RDSEED: Type = 78;
    #[doc = "< LAHF_SAHF"]
    pub const RTE_CPUFLAG_LAHF_SAHF: Type = 79;
    #[doc = "< LZCNT"]
    pub const RTE_CPUFLAG_LZCNT: Type = 80;
    #[doc = "< SYSCALL"]
    pub const RTE_CPUFLAG_SYSCALL: Type = 81;
    #[doc = "< XD"]
    pub const RTE_CPUFLAG_XD: Type = 82;
    #[doc = "< 1GB_PG"]
    pub const RTE_CPUFLAG_1GB_PG: Type = 83;
    #[doc = "< RDTSCP"]
    pub const RTE_CPUFLAG_RDTSCP: Type = 84;
    #[doc = "< EM64T"]
    pub const RTE_CPUFLAG_EM64T: Type = 85;
    #[doc = "< INVTSC"]
    pub const RTE_CPUFLAG_INVTSC: Type = 86;
    #[doc = "< AVX512 Doubleword and Quadword"]
    pub const RTE_CPUFLAG_AVX512DQ: Type = 87;
    #[doc = "< AVX512 Integer Fused Multiply-Add"]
    pub const RTE_CPUFLAG_AVX512IFMA: Type = 88;
    #[doc = "< AVX512 Conflict Detection"]
    pub const RTE_CPUFLAG_AVX512CD: Type = 89;
    #[doc = "< AVX512 Byte and Word"]
    pub const RTE_CPUFLAG_AVX512BW: Type = 90;
    #[doc = "< AVX512 Vector Length"]
    pub const RTE_CPUFLAG_AVX512VL: Type = 91;
    #[doc = "< AVX512 Vector Bit Manipulation"]
    pub const RTE_CPUFLAG_AVX512VBMI: Type = 92;
    #[doc = "< AVX512 Vector Bit Manipulation 2"]
    pub const RTE_CPUFLAG_AVX512VBMI2: Type = 93;
    #[doc = "< Galois Field New Instructions"]
    pub const RTE_CPUFLAG_GFNI: Type = 94;
    #[doc = "< Vector AES"]
    pub const RTE_CPUFLAG_VAES: Type = 95;
    #[doc = "< Vector Carry-less Multiply"]
    pub const RTE_CPUFLAG_VPCLMULQDQ: Type = 96;
    pub const RTE_CPUFLAG_AVX512VNNI: Type = 97;
    #[doc = "< AVX512 Bit Algorithms"]
    pub const RTE_CPUFLAG_AVX512BITALG: Type = 98;
    #[doc = "< AVX512 Vector Popcount"]
    pub const RTE_CPUFLAG_AVX512VPOPCNTDQ: Type = 99;
    #[doc = "< Cache Line Demote"]
    pub const RTE_CPUFLAG_CLDEMOTE: Type = 100;
    #[doc = "< Direct Store Instructions"]
    pub const RTE_CPUFLAG_MOVDIRI: Type = 101;
    #[doc = "< Direct Store Instructions 64B"]
    pub const RTE_CPUFLAG_MOVDIR64B: Type = 102;
    #[doc = "< AVX512 Two Register Intersection"]
    pub const RTE_CPUFLAG_AVX512VP2INTERSECT: Type = 103;
    #[doc = "< UMONITOR/UMWAIT/TPAUSE"]
    pub const RTE_CPUFLAG_WAITPKG: Type = 104;
    #[doc = "< MONITORX"]
    pub const RTE_CPUFLAG_MONITORX: Type = 105;
}
#[doc = "Structure used to describe platform-specific intrinsics that may or may not\nbe supported at runtime."]
#[repr(C)]
#[repr(align(4))]
#[derive(Debug, Default, Copy, Clone)]
pub struct rte_cpu_intrinsics {
    pub _bitfield_align_1: [u8; 0],
    pub _bitfield_1: __BindgenBitfieldUnit<[u8; 1usize]>,
    pub __bindgen_padding_0: [u8; 3usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of rte_cpu_intrinsics"][::core::mem::size_of::<rte_cpu_intrinsics>() - 4usize];
    ["Alignment of rte_cpu_intrinsics"][::core::mem::align_of::<rte_cpu_intrinsics>() - 4usize];
};
impl rte_cpu_intrinsics {
    #[inline]
    pub fn power_monitor(&self) -> u32 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(0usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_power_monitor(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::core::mem::transmute(val);
            self._bitfield_1.set(0usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn power_monitor_raw(this: *const Self) -> u32 {
        unsafe {
            ::core::mem::transmute(<__BindgenBitfieldUnit<[u8; 1usize]>>::raw_get(
                ::core::ptr::addr_of!((*this)._bitfield_1),
                0usize,
                1u8,
            ) as u32)
        }
    }
    #[inline]
    pub unsafe fn set_power_monitor_raw(this: *mut Self, val: u32) {
        unsafe {
            let val: u32 = ::core::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 1usize]>>::raw_set(
                ::core::ptr::addr_of_mut!((*this)._bitfield_1),
                0usize,
                1u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn power_pause(&self) -> u32 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(1usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_power_pause(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::core::mem::transmute(val);
            self._bitfield_1.set(1usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn power_pause_raw(this: *const Self) -> u32 {
        unsafe {
            ::core::mem::transmute(<__BindgenBitfieldUnit<[u8; 1usize]>>::raw_get(
                ::core::ptr::addr_of!((*this)._bitfield_1),
                1usize,
                1u8,
            ) as u32)
        }
    }
    #[inline]
    pub unsafe fn set_power_pause_raw(this: *mut Self, val: u32) {
        unsafe {
            let val: u32 = ::core::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 1usize]>>::raw_set(
                ::core::ptr::addr_of_mut!((*this)._bitfield_1),
                1usize,
                1u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn power_monitor_multi(&self) -> u32 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(2usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_power_monitor_multi(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::core::mem::transmute(val);
            self._bitfield_1.set(2usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn power_monitor_multi_raw(this: *const Self) -> u32 {
        unsafe {
            ::core::mem::transmute(<__BindgenBitfieldUnit<[u8; 1usize]>>::raw_get(
                ::core::ptr::addr_of!((*this)._bitfield_1),
                2usize,
                1u8,
            ) as u32)
        }
    }
    #[inline]
    pub unsafe fn set_power_monitor_multi_raw(this: *mut Self, val: u32) {
        unsafe {
            let val: u32 = ::core::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 1usize]>>::raw_set(
                ::core::ptr::addr_of_mut!((*this)._bitfield_1),
                2usize,
                1u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn new_bitfield_1(
        power_monitor: u32,
        power_pause: u32,
        power_monitor_multi: u32,
    ) -> __BindgenBitfieldUnit<[u8; 1usize]> {
        let mut __bindgen_bitfield_unit: __BindgenBitfieldUnit<[u8; 1usize]> = Default::default();
        __bindgen_bitfield_unit.set(0usize, 1u8, {
            let power_monitor: u32 = unsafe { ::core::mem::transmute(power_monitor) };
            power_monitor as u64
        });
        __bindgen_bitfield_unit.set(1usize, 1u8, {
            let power_pause: u32 = unsafe { ::core::mem::transmute(power_pause) };
            power_pause as u64
        });
        __bindgen_bitfield_unit.set(2usize, 1u8, {
            let power_monitor_multi: u32 = unsafe { ::core::mem::transmute(power_monitor_multi) };
            power_monitor_multi as u64
        });
        __bindgen_bitfield_unit
    }
}
unsafe extern "C" {
    #[doc = "Check CPU support for various intrinsics at runtime.\n\n# Arguments\n\n* `intrinsics` -\nPointer to a structure to be filled."]
    pub fn rte_cpu_get_intrinsics_support(intrinsics: *mut rte_cpu_intrinsics);
}
unsafe extern "C" {
    #[doc = "Get name of CPU flag\n\n# Arguments\n\n* `feature` -\nCPU flag ID\n\n# Returns\n\nflag name\nNULL if flag ID is invalid"]
    pub fn rte_cpu_get_flag_name(feature: rte_cpu_flag_t::Type) -> *const ::core::ffi::c_char;
}
unsafe extern "C" {
    #[doc = "Function for checking a CPU flag availability\n\n# Arguments\n\n* `feature` -\nCPU flag to query CPU for\n\n# Returns\n\n1 if flag is available\n0 if flag is not available\n-ENOENT if flag is invalid"]
    pub fn rte_cpu_get_flag_enabled(feature: rte_cpu_flag_t::Type) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    #[doc = "This function checks that the currently used CPU supports the CPU features\nthat were specified at compile time. It is called automatically within the\nEAL, so does not need to be used by applications.  This version returns a\nresult so that decisions may be made (for instance, graceful shutdowns)."]
    pub fn rte_cpu_is_supported() -> ::core::ffi::c_int;
}
unsafe extern "C" {
    #[doc = "This function attempts to retrieve a value from the auxiliary vector.\nIf it is unsuccessful, the result will be 0, and errno will be set.\n\n# Returns\n\nA value from the auxiliary vector.  When the value is 0, check\nerrno to determine if an error occurred."]
    pub fn rte_cpu_getauxval(type_: ::core::ffi::c_ulong) -> ::core::ffi::c_ulong;
}
unsafe extern "C" {
    #[doc = "This function retrieves a value from the auxiliary vector, and compares it\nas a string against the value retrieved.\n\n# Returns\n\nThe result of calling strcmp() against the value retrieved from\nthe auxiliary vector.  When the value is 0 (meaning a match is found),\ncheck errno to determine if an error occurred."]
    pub fn rte_cpu_strcmp_auxval(
        type_: ::core::ffi::c_ulong,
        str_: *const ::core::ffi::c_char,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    #[doc = "Change the stream that will be used by the logging system.\nThis can be done at any time. The f argument represents the stream\nto be used to send the logs. If f is NULL, the default output is\nused (stderr).\n\n# Arguments\n\n* `f` -\nPointer to the stream.\n\n# Returns\n\n- 0 on success.\n- Negative on error."]
    pub fn rte_openlog_stream(f: *mut FILE) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    #[doc = "Retrieve the stream used by the logging system (see rte_openlog_stream()\nto change it).\n\n# Returns\n\nPointer to the stream."]
    pub fn rte_log_get_stream() -> *mut FILE;
}
unsafe extern "C" {
    #[doc = "Set the global log level.\nAfter this call, logs with a level lower or equal than the level\npassed as argument will be displayed.\n\n# Arguments\n\n* `level` -\nLog level. A value between RTE_LOG_EMERG (1) and RTE_LOG_DEBUG (8)."]
    pub fn rte_log_set_global_level(level: u32);
}
unsafe extern "C" {
    #[doc = "Get the global log level.\n\n# Returns\n\nThe current global log level."]
    pub fn rte_log_get_global_level() -> u32;
}
unsafe extern "C" {
    #[doc = "Get the log level for a given type.\n\n# Arguments\n\n* `logtype` -\nThe log type identifier.\n\n# Returns\n\n0 on success, a negative value if logtype is invalid."]
    pub fn rte_log_get_level(logtype: u32) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    #[doc = "For a given `logtype`, check if a log with `loglevel` can be printed.\n\n# Arguments\n\n* `logtype` -\nThe log type identifier\n* `loglevel` -\nLog level. A value between RTE_LOG_EMERG (1) and RTE_LOG_DEBUG (8).\n\n# Returns\n\nReturns 'true' if log can be printed and 'false' if it can't."]
    pub fn rte_log_can_log(logtype: u32, loglevel: u32) -> bool;
}
unsafe extern "C" {
    #[doc = "Set the log level for a given type based on globbing pattern.\n\n# Arguments\n\n* `pattern` -\nThe globbing pattern identifying the log type.\n* `level` -\nThe level to be set.\n\n# Returns\n\n0 on success, a negative value if level is invalid."]
    pub fn rte_log_set_level_pattern(
        pattern: *const ::core::ffi::c_char,
        level: u32,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    #[doc = "Set the log level for a given type based on regular expression.\n\n# Arguments\n\n* `regex` -\nThe regular expression identifying the log type.\n* `level` -\nThe level to be set.\n\n# Returns\n\n0 on success, a negative value if level is invalid."]
    pub fn rte_log_set_level_regexp(
        regex: *const ::core::ffi::c_char,
        level: u32,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    #[doc = "Set the log level for a given type.\n\n# Arguments\n\n* `logtype` -\nThe log type identifier.\n* `level` -\nThe level to be set.\n\n# Returns\n\n0 on success, a negative value if logtype or level is invalid."]
    pub fn rte_log_set_level(logtype: u32, level: u32) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    #[doc = "Get the current loglevel for the message being processed.\nBefore calling the user-defined stream for logging, the log\nsubsystem sets a per-lcore variable containing the loglevel and the\nlogtype of the message being processed. This information can be\naccessed by the user-defined log output function through this\nfunction.\n\n# Returns\n\nThe loglevel of the message being processed."]
    pub fn rte_log_cur_msg_loglevel() -> ::core::ffi::c_int;
}
unsafe extern "C" {
    #[doc = "Get the current logtype for the message being processed.\nBefore calling the user-defined stream for logging, the log\nsubsystem sets a per-lcore variable containing the loglevel and the\nlogtype of the message being processed. This information can be\naccessed by the user-defined log output function through this\nfunction.\n\n# Returns\n\nThe logtype of the message being processed."]
    pub fn rte_log_cur_msg_logtype() -> ::core::ffi::c_int;
}
unsafe extern "C" {
    #[doc = "Register a dynamic log type\nIf a log is already registered with the same type, the returned value\nis the same than the previous one.\n\n# Arguments\n\n* `name` -\nThe string identifying the log type.\n\n# Returns\n\n- >0: success, the returned value is the log type identifier.\n- (-ENOMEM): cannot allocate memory."]
    pub fn rte_log_register(name: *const ::core::ffi::c_char) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    #[doc = "Register a dynamic log type and try to pick its level from EAL options\nrte_log_register() is called inside. If successful, the function tries\nto search for matching regexp in the list of EAL log level options and\npick the level from the last matching entry. If nothing can be applied\nfrom the list, the level will be set to the user-defined default value.\n\n# Arguments\n\n* `name` -\nName for the log type to be registered\n* `level_def` -\nFallback level to be set if the global list has no matching options\n\n# Returns\n\n- >=0: the newly registered log type\n- <0: rte_log_register() error value"]
    pub fn rte_log_register_type_and_pick_level(
        name: *const ::core::ffi::c_char,
        level_def: u32,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    #[doc = "Dump name of each logtype, one per line.\n\n# Arguments\n\n* `out` -\nStream where the list is sent.\n* `prefix` -\nString preceding each logtype in the output."]
    pub fn rte_log_list_types(out: *mut FILE, prefix: *const ::core::ffi::c_char);
}
unsafe extern "C" {
    #[doc = "Dump log information.\nDump the global level and the registered log types.\n\n# Arguments\n\n* `f` -\nThe output stream where the dump should be sent."]
    pub fn rte_log_dump(f: *mut FILE);
}
unsafe extern "C" {
    #[doc = "Generates a log message.\nThe message will be sent in the stream defined by the previous call\nto rte_openlog_stream().\nThe level argument determines if the log should be displayed or\nnot, depending on the loglevel settings.\nThe preferred alternative is the RTE_LOG() because it adds the\nlevel and type in the logged string.\n\n# Arguments\n\n* `level` -\nLog level. A value between RTE_LOG_EMERG (1) and RTE_LOG_DEBUG (8).\n* `logtype` -\nThe log type, for example, RTE_LOGTYPE_EAL.\n* `format` -\nThe format string, as in printf(3), followed by the variable arguments\nrequired by the format.\n\n# Returns\n\n- 0: Success.\n- Negative on error."]
    pub fn rte_log(
        level: u32,
        logtype: u32,
        format: *const ::core::ffi::c_char,
        ...
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    #[doc = "Generates a log message.\nThe message will be sent in the stream defined by the previous call\nto rte_openlog_stream().\nThe level argument determines if the log should be displayed or\nnot, depending on the loglevel settings. A trailing\nnewline may be added if needed.\nThe preferred alternative is the RTE_LOG() because it adds the\nlevel and type in the logged string.\n\n# Arguments\n\n* `level` -\nLog level. A value between RTE_LOG_EMERG (1) and RTE_LOG_DEBUG (8).\n* `logtype` -\nThe log type, for example, RTE_LOGTYPE_EAL.\n* `format` -\nThe format string, as in printf(3), followed by the variable arguments\nrequired by the format.\n* `ap` -\nThe va_list of the variable arguments required by the format.\n\n# Returns\n\n- 0: Success.\n- Negative on error."]
    pub fn rte_vlog(
        level: u32,
        logtype: u32,
        format: *const ::core::ffi::c_char,
        ap: *mut __va_list_tag,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    #[doc = "Dump the stack of the calling core to the standard error."]
    pub fn rte_dump_stack();
}
unsafe extern "C" {
    #[doc = "Get the measured frequency of the RDTSC counter\n\n# Returns\n\nThe TSC frequency for this lcore"]
    pub fn rte_get_tsc_hz() -> u64;
}
unsafe extern "C" {
    #[doc = "Return the number of TSC cycles since boot\n\n# Returns\n\nthe number of cycles"]
    #[link_name = "rte_get_tsc_cycles_w"]
    pub fn rte_get_tsc_cycles() -> u64;
}
unsafe extern "C" {
    #[doc = "Get the number of cycles since boot from the default timer.\n\n# Returns\n\nThe number of cycles"]
    #[link_name = "rte_get_timer_cycles_w"]
    pub fn rte_get_timer_cycles() -> u64;
}
unsafe extern "C" {
    #[doc = "Get the number of cycles in one second for the default timer.\n\n# Returns\n\nThe number of cycles in one second."]
    #[link_name = "rte_get_timer_hz_w"]
    pub fn rte_get_timer_hz() -> u64;
}
unsafe extern "C" {
    #[doc = "Wait at least us microseconds.\nThis function can be replaced with user-defined function.\n\n# See also\n\n> [`rte_delay_us_callback_register`]\n\n# Arguments\n\n* `us` -\nThe number of microseconds to wait."]
    pub static mut rte_delay_us:
        ::core::option::Option<unsafe extern "C" fn(us: ::core::ffi::c_uint)>;
}
unsafe extern "C" {
    #[doc = "Wait at least ms milliseconds.\n\n# Arguments\n\n* `ms` -\nThe number of milliseconds to wait."]
    #[link_name = "rte_delay_ms_w"]
    pub fn rte_delay_ms(ms: ::core::ffi::c_uint);
}
unsafe extern "C" {
    #[doc = "Blocking delay function.\n\n# Arguments\n\n* `us` -\nNumber of microseconds to wait."]
    pub fn rte_delay_us_block(us: ::core::ffi::c_uint);
}
unsafe extern "C" {
    #[doc = "Delay function that uses system sleep.\nDoes not block the CPU core.\n\n# Arguments\n\n* `us` -\nNumber of microseconds to wait."]
    pub fn rte_delay_us_sleep(us: ::core::ffi::c_uint);
}
unsafe extern "C" {
    #[doc = "Replace rte_delay_us with user defined function.\n\n# Arguments\n\n* `userfunc` -\nUser function which replaces rte_delay_us. rte_delay_us_block restores\nbuiltin block delay function."]
    pub fn rte_delay_us_callback_register(
        userfunc: ::core::option::Option<unsafe extern "C" fn(arg1: ::core::ffi::c_uint)>,
    );
}
unsafe extern "C" {
    #[link_name = "rte_rdtsc_w"]
    pub fn rte_rdtsc() -> u64;
}
unsafe extern "C" {
    #[link_name = "rte_rdtsc_precise_w"]
    pub fn rte_rdtsc_precise() -> u64;
}
unsafe extern "C" {
    pub static mut rte_rtm_supported: u8;
}
unsafe extern "C" {
    #[link_name = "rte_try_tm_w"]
    pub fn rte_try_tm(lock: *mut ::core::ffi::c_int) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    #[doc = "Get the target bit from a 32-bit value without memory ordering.\n\n# Arguments\n\n* `nr` -\nThe target bit to get.\n* `addr` -\nThe address holding the bit.\n\n# Returns\n\nThe target bit."]
    #[link_name = "rte_bit_relaxed_get32_w"]
    pub fn rte_bit_relaxed_get32(nr: ::core::ffi::c_uint, addr: *mut u32) -> u32;
}
unsafe extern "C" {
    #[doc = "Set the target bit in a 32-bit value to 1 without memory ordering.\n\n# Arguments\n\n* `nr` -\nThe target bit to set.\n* `addr` -\nThe address holding the bit."]
    #[link_name = "rte_bit_relaxed_set32_w"]
    pub fn rte_bit_relaxed_set32(nr: ::core::ffi::c_uint, addr: *mut u32);
}
unsafe extern "C" {
    #[doc = "Clear the target bit in a 32-bit value to 0 without memory ordering.\n\n# Arguments\n\n* `nr` -\nThe target bit to clear.\n* `addr` -\nThe address holding the bit."]
    #[link_name = "rte_bit_relaxed_clear32_w"]
    pub fn rte_bit_relaxed_clear32(nr: ::core::ffi::c_uint, addr: *mut u32);
}
unsafe extern "C" {
    #[doc = "Return the original bit from a 32-bit value, then set it to 1 without\nmemory ordering.\n\n# Arguments\n\n* `nr` -\nThe target bit to get and set.\n* `addr` -\nThe address holding the bit.\n\n# Returns\n\nThe original bit."]
    #[link_name = "rte_bit_relaxed_test_and_set32_w"]
    pub fn rte_bit_relaxed_test_and_set32(nr: ::core::ffi::c_uint, addr: *mut u32) -> u32;
}
unsafe extern "C" {
    #[doc = "Return the original bit from a 32-bit value, then clear it to 0 without\nmemory ordering.\n\n# Arguments\n\n* `nr` -\nThe target bit to get and clear.\n* `addr` -\nThe address holding the bit.\n\n# Returns\n\nThe original bit."]
    #[link_name = "rte_bit_relaxed_test_and_clear32_w"]
    pub fn rte_bit_relaxed_test_and_clear32(nr: ::core::ffi::c_uint, addr: *mut u32) -> u32;
}
unsafe extern "C" {
    #[doc = "Get the target bit from a 64-bit value without memory ordering.\n\n# Arguments\n\n* `nr` -\nThe target bit to get.\n* `addr` -\nThe address holding the bit.\n\n# Returns\n\nThe target bit."]
    #[link_name = "rte_bit_relaxed_get64_w"]
    pub fn rte_bit_relaxed_get64(nr: ::core::ffi::c_uint, addr: *mut u64) -> u64;
}
unsafe extern "C" {
    #[doc = "Set the target bit in a 64-bit value to 1 without memory ordering.\n\n# Arguments\n\n* `nr` -\nThe target bit to set.\n* `addr` -\nThe address holding the bit."]
    #[link_name = "rte_bit_relaxed_set64_w"]
    pub fn rte_bit_relaxed_set64(nr: ::core::ffi::c_uint, addr: *mut u64);
}
unsafe extern "C" {
    #[doc = "Clear the target bit in a 64-bit value to 0 without memory ordering.\n\n# Arguments\n\n* `nr` -\nThe target bit to clear.\n* `addr` -\nThe address holding the bit."]
    #[link_name = "rte_bit_relaxed_clear64_w"]
    pub fn rte_bit_relaxed_clear64(nr: ::core::ffi::c_uint, addr: *mut u64);
}
unsafe extern "C" {
    #[doc = "Return the original bit from a 64-bit value, then set it to 1 without\nmemory ordering.\n\n# Arguments\n\n* `nr` -\nThe target bit to get and set.\n* `addr` -\nThe address holding the bit.\n\n# Returns\n\nThe original bit."]
    #[link_name = "rte_bit_relaxed_test_and_set64_w"]
    pub fn rte_bit_relaxed_test_and_set64(nr: ::core::ffi::c_uint, addr: *mut u64) -> u64;
}
unsafe extern "C" {
    #[doc = "Return the original bit from a 64-bit value, then clear it to 0 without\nmemory ordering.\n\n# Arguments\n\n* `nr` -\nThe target bit to get and clear.\n* `addr` -\nThe address holding the bit.\n\n# Returns\n\nThe original bit."]
    #[link_name = "rte_bit_relaxed_test_and_clear64_w"]
    pub fn rte_bit_relaxed_test_and_clear64(nr: ::core::ffi::c_uint, addr: *mut u64) -> u64;
}
unsafe extern "C" {
    #[doc = "Get the count of leading 0-bits in v.\n\n# Arguments\n\n* `v` -\nThe value.\n\n# Returns\n\nThe count of leading zero bits."]
    #[link_name = "rte_clz32_w"]
    pub fn rte_clz32(v: u32) -> ::core::ffi::c_uint;
}
unsafe extern "C" {
    #[doc = "Get the count of leading 0-bits in v.\n\n# Arguments\n\n* `v` -\nThe value.\n\n# Returns\n\nThe count of leading zero bits."]
    #[link_name = "rte_clz64_w"]
    pub fn rte_clz64(v: u64) -> ::core::ffi::c_uint;
}
unsafe extern "C" {
    #[doc = "Get the count of trailing 0-bits in v.\n\n# Arguments\n\n* `v` -\nThe value.\n\n# Returns\n\nThe count of trailing zero bits."]
    #[link_name = "rte_ctz32_w"]
    pub fn rte_ctz32(v: u32) -> ::core::ffi::c_uint;
}
unsafe extern "C" {
    #[doc = "Get the count of trailing 0-bits in v.\n\n# Arguments\n\n* `v` -\nThe value.\n\n# Returns\n\nThe count of trailing zero bits."]
    #[link_name = "rte_ctz64_w"]
    pub fn rte_ctz64(v: u64) -> ::core::ffi::c_uint;
}
unsafe extern "C" {
    #[doc = "Get the count of 1-bits in v.\n\n# Arguments\n\n* `v` -\nThe value.\n\n# Returns\n\nThe count of 1-bits."]
    #[link_name = "rte_popcount32_w"]
    pub fn rte_popcount32(v: u32) -> ::core::ffi::c_uint;
}
unsafe extern "C" {
    #[doc = "Get the count of 1-bits in v.\n\n# Arguments\n\n* `v` -\nThe value.\n\n# Returns\n\nThe count of 1-bits."]
    #[link_name = "rte_popcount64_w"]
    pub fn rte_popcount64(v: u64) -> ::core::ffi::c_uint;
}
unsafe extern "C" {
    #[doc = "@warning **EXPERIMENTAL:** this API may change without prior notice.\nSearch v from least significant bit (LSB) to the most\nsignificant bit (MSB) for a set bit (1).\n\n# Arguments\n\n* `v` -\nThe value.\n\n# Returns\n\nBit index + 1 if a set bit is found, zero otherwise."]
    #[link_name = "rte_ffs32_w"]
    pub fn rte_ffs32(v: u32) -> ::core::ffi::c_uint;
}
unsafe extern "C" {
    #[doc = "@warning **EXPERIMENTAL:** this API may change without prior notice.\nSearch v from least significant bit (LSB) to the most\nsignificant bit (MSB) for a set bit (1).\n\n# Arguments\n\n* `v` -\nThe value.\n\n# Returns\n\nBit index + 1 if a set bit is found, zero otherwise."]
    #[link_name = "rte_ffs64_w"]
    pub fn rte_ffs64(v: u64) -> ::core::ffi::c_uint;
}
unsafe extern "C" {
    #[doc = "Combines 32b inputs most significant set bits into the least\nsignificant bits to construct a value with the same MSBs as x\nbut all 1's under it.\n\n# Arguments\n\n* `x` -\nThe integer whose MSBs need to be combined with its LSBs\n\n# Returns\n\nThe combined value."]
    #[link_name = "rte_combine32ms1b_w"]
    pub fn rte_combine32ms1b(x: u32) -> u32;
}
unsafe extern "C" {
    #[doc = "Combines 64b inputs most significant set bits into the least\nsignificant bits to construct a value with the same MSBs as x\nbut all 1's under it.\n\n# Arguments\n\n* `v` -\nThe integer whose MSBs need to be combined with its LSBs\n\n# Returns\n\nThe combined value."]
    #[link_name = "rte_combine64ms1b_w"]
    pub fn rte_combine64ms1b(v: u64) -> u64;
}
unsafe extern "C" {
    #[doc = "Searches the input parameter for the least significant set bit\n(starting from zero).\nIf a least significant 1 bit is found, its bit index is returned.\nIf the content of the input parameter is zero, then the content of the return\nvalue is undefined.\n\n# Arguments\n\n* `v` -\ninput parameter, should not be zero.\n\n# Returns\n\nleast significant set bit in the input parameter."]
    #[link_name = "rte_bsf32_w"]
    pub fn rte_bsf32(v: u32) -> u32;
}
unsafe extern "C" {
    #[doc = "Searches the input parameter for the least significant set bit\n(starting from zero). Safe version (checks for input parameter being zero).\n@warning ``pos`` must be a valid pointer. It is not checked!\n\n# Arguments\n\n* `v` -\nThe input parameter.\n* `pos` -\nIf ``v`` was not 0, this value will contain position of least significant\nbit within the input parameter.\n\n# Returns\n\nReturns 0 if ``v`` was 0, otherwise returns 1."]
    #[link_name = "rte_bsf32_safe_w"]
    pub fn rte_bsf32_safe(v: u32, pos: *mut u32) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    #[doc = "Searches the input parameter for the least significant set bit\n(starting from zero).\nIf a least significant 1 bit is found, its bit index is returned.\nIf the content of the input parameter is zero, then the content of the return\nvalue is undefined.\n\n# Arguments\n\n* `v` -\ninput parameter, should not be zero.\n\n# Returns\n\nleast significant set bit in the input parameter."]
    #[link_name = "rte_bsf64_w"]
    pub fn rte_bsf64(v: u64) -> u32;
}
unsafe extern "C" {
    #[doc = "Searches the input parameter for the least significant set bit\n(starting from zero). Safe version (checks for input parameter being zero).\n@warning ``pos`` must be a valid pointer. It is not checked!\n\n# Arguments\n\n* `v` -\nThe input parameter.\n* `pos` -\nIf ``v`` was not 0, this value will contain position of least significant\nbit within the input parameter.\n\n# Returns\n\nReturns 0 if ``v`` was 0, otherwise returns 1."]
    #[link_name = "rte_bsf64_safe_w"]
    pub fn rte_bsf64_safe(v: u64, pos: *mut u32) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    #[doc = "Return the last (most-significant) bit set.\n> **Note** The last (most significant) bit is at position 32.\n> **Note** rte_fls_u32(0) = 0, rte_fls_u32(1) = 1, rte_fls_u32(0x80000000) = 32\n\n# Arguments\n\n* `x` -\nThe input parameter.\n\n# Returns\n\nThe last (most-significant) bit set, or 0 if the input is 0."]
    #[link_name = "rte_fls_u32_w"]
    pub fn rte_fls_u32(x: u32) -> u32;
}
unsafe extern "C" {
    #[doc = "Return the last (most-significant) bit set.\n> **Note** The last (most significant) bit is at position 64.\n> **Note** rte_fls_u64(0) = 0, rte_fls_u64(1) = 1,\nrte_fls_u64(0x8000000000000000) = 64\n\n# Arguments\n\n* `x` -\nThe input parameter.\n\n# Returns\n\nThe last (most-significant) bit set, or 0 if the input is 0."]
    #[link_name = "rte_fls_u64_w"]
    pub fn rte_fls_u64(x: u64) -> u32;
}
unsafe extern "C" {
    #[doc = "Returns true if n is a power of 2\n\n# Arguments\n\n* `n` -\nNumber to check\n\n# Returns\n\n1 if true, 0 otherwise"]
    #[link_name = "rte_is_power_of_2_w"]
    pub fn rte_is_power_of_2(n: u32) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    #[doc = "Aligns input parameter to the next power of 2\n\n# Arguments\n\n* `x` -\nThe integer value to align\n\n# Returns\n\nInput parameter aligned to the next power of 2"]
    #[link_name = "rte_align32pow2_w"]
    pub fn rte_align32pow2(x: u32) -> u32;
}
unsafe extern "C" {
    #[doc = "Aligns input parameter to the previous power of 2\n\n# Arguments\n\n* `x` -\nThe integer value to align\n\n# Returns\n\nInput parameter aligned to the previous power of 2"]
    #[link_name = "rte_align32prevpow2_w"]
    pub fn rte_align32prevpow2(x: u32) -> u32;
}
unsafe extern "C" {
    #[doc = "Aligns 64b input parameter to the next power of 2\n\n# Arguments\n\n* `v` -\nThe 64b value to align\n\n# Returns\n\nInput parameter aligned to the next power of 2"]
    #[link_name = "rte_align64pow2_w"]
    pub fn rte_align64pow2(v: u64) -> u64;
}
unsafe extern "C" {
    #[doc = "Aligns 64b input parameter to the previous power of 2\n\n# Arguments\n\n* `v` -\nThe 64b value to align\n\n# Returns\n\nInput parameter aligned to the previous power of 2"]
    #[link_name = "rte_align64prevpow2_w"]
    pub fn rte_align64prevpow2(v: u64) -> u64;
}
unsafe extern "C" {
    #[doc = "Return the rounded-up log2 of a integer.\n> **Note** Contrary to the logarithm mathematical operation,\nrte_log2_u32(0) == 0 and not -inf.\n\n# Arguments\n\n* `v` -\nThe input parameter.\n\n# Returns\n\nThe rounded-up log2 of the input, or 0 if the input is 0."]
    #[link_name = "rte_log2_u32_w"]
    pub fn rte_log2_u32(v: u32) -> u32;
}
unsafe extern "C" {
    #[doc = "Return the rounded-up log2 of a 64-bit integer.\n> **Note** Contrary to the logarithm mathematical operation,\nrte_log2_u64(0) == 0 and not -inf.\n\n# Arguments\n\n* `v` -\nThe input parameter.\n\n# Returns\n\nThe rounded-up log2 of the input, or 0 if the input is 0."]
    #[link_name = "rte_log2_u64_w"]
    pub fn rte_log2_u64(v: u64) -> u32;
}
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct rte_rwlock_t {
    pub cnt: i32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of rte_rwlock_t"][::core::mem::size_of::<rte_rwlock_t>() - 4usize];
    ["Alignment of rte_rwlock_t"][::core::mem::align_of::<rte_rwlock_t>() - 4usize];
    ["Offset of field: rte_rwlock_t::cnt"][::core::mem::offset_of!(rte_rwlock_t, cnt) - 0usize];
};
unsafe extern "C" {
    #[doc = "Initialize the rwlock to an unlocked state.\n\n# Arguments\n\n* `rwl` -\nA pointer to the rwlock structure."]
    #[link_name = "rte_rwlock_init_w"]
    pub fn rte_rwlock_init(rwl: *mut rte_rwlock_t);
}
unsafe extern "C" {
    #[doc = "Take a read lock. Loop until the lock is held.\n> **Note** The RW lock isn't recursive, so calling this function on the same\nlock twice without releasing it could potentially result in a deadlock\nscenario when a write lock is involved.\n\n# Arguments\n\n* `rwl` -\nA pointer to a rwlock structure."]
    #[link_name = "rte_rwlock_read_lock_w"]
    pub fn rte_rwlock_read_lock(rwl: *mut rte_rwlock_t);
}
unsafe extern "C" {
    #[doc = "Try to take a read lock.\n\n# Arguments\n\n* `rwl` -\nA pointer to a rwlock structure.\n\n# Returns\n\n- zero if the lock is successfully taken\n- -EBUSY if lock could not be acquired for reading because a\nwriter holds the lock"]
    #[link_name = "rte_rwlock_read_trylock_w"]
    pub fn rte_rwlock_read_trylock(rwl: *mut rte_rwlock_t) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    #[doc = "Release a read lock.\n\n# Arguments\n\n* `rwl` -\nA pointer to the rwlock structure."]
    #[link_name = "rte_rwlock_read_unlock_w"]
    pub fn rte_rwlock_read_unlock(rwl: *mut rte_rwlock_t);
}
unsafe extern "C" {
    #[doc = "Try to take a write lock.\n\n# Arguments\n\n* `rwl` -\nA pointer to a rwlock structure.\n\n# Returns\n\n- zero if the lock is successfully taken\n- -EBUSY if lock could not be acquired for writing because\nit was already locked for reading or writing"]
    #[link_name = "rte_rwlock_write_trylock_w"]
    pub fn rte_rwlock_write_trylock(rwl: *mut rte_rwlock_t) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    #[doc = "Take a write lock. Loop until the lock is held.\n\n# Arguments\n\n* `rwl` -\nA pointer to a rwlock structure."]
    #[link_name = "rte_rwlock_write_lock_w"]
    pub fn rte_rwlock_write_lock(rwl: *mut rte_rwlock_t);
}
unsafe extern "C" {
    #[doc = "Release a write lock.\n\n# Arguments\n\n* `rwl` -\nA pointer to a rwlock structure."]
    #[link_name = "rte_rwlock_write_unlock_w"]
    pub fn rte_rwlock_write_unlock(rwl: *mut rte_rwlock_t);
}
unsafe extern "C" {
    #[doc = "Test if the write lock is taken.\n\n# Arguments\n\n* `rwl` -\nA pointer to a rwlock structure.\n\n# Returns\n\n1 if the write lock is currently taken; 0 otherwise."]
    #[link_name = "rte_rwlock_write_is_locked_w"]
    pub fn rte_rwlock_write_is_locked(rwl: *mut rte_rwlock_t) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    #[doc = "Try to execute critical section in a hardware memory transaction, if it\nfails or not available take a read lock\nNOTE: An attempt to perform a HW I/O operation inside a hardware memory\ntransaction always aborts the transaction since the CPU is not able to\nroll-back should the transaction fail. Therefore, hardware transactional\nlocks are not advised to be used around rte_eth_rx_burst() and\nrte_eth_tx_burst() calls.\n\n# Arguments\n\n* `rwl` -\nA pointer to a rwlock structure."]
    #[link_name = "rte_rwlock_read_lock_tm_w"]
    pub fn rte_rwlock_read_lock_tm(rwl: *mut rte_rwlock_t);
}
unsafe extern "C" {
    #[doc = "Commit hardware memory transaction or release the read lock if the lock is used as a fall-back\n\n# Arguments\n\n* `rwl` -\nA pointer to the rwlock structure."]
    #[link_name = "rte_rwlock_read_unlock_tm_w"]
    pub fn rte_rwlock_read_unlock_tm(rwl: *mut rte_rwlock_t);
}
unsafe extern "C" {
    #[doc = "Try to execute critical section in a hardware memory transaction, if it\nfails or not available take a write lock\nNOTE: An attempt to perform a HW I/O operation inside a hardware memory\ntransaction always aborts the transaction since the CPU is not able to\nroll-back should the transaction fail. Therefore, hardware transactional\nlocks are not advised to be used around rte_eth_rx_burst() and\nrte_eth_tx_burst() calls.\n\n# Arguments\n\n* `rwl` -\nA pointer to a rwlock structure."]
    #[link_name = "rte_rwlock_write_lock_tm_w"]
    pub fn rte_rwlock_write_lock_tm(rwl: *mut rte_rwlock_t);
}
unsafe extern "C" {
    #[doc = "Commit hardware memory transaction or release the write lock if the lock is used as a fall-back\n\n# Arguments\n\n* `rwl` -\nA pointer to a rwlock structure."]
    #[link_name = "rte_rwlock_write_unlock_tm_w"]
    pub fn rte_rwlock_write_unlock_tm(rwl: *mut rte_rwlock_t);
}
unsafe extern "C" {
    #[doc = "Internal helpers used for lock annotations."]
    pub fn rte_mcfg_mem_get_lock() -> *mut rte_rwlock_t;
}
unsafe extern "C" {
    pub fn rte_mcfg_tailq_get_lock() -> *mut rte_rwlock_t;
}
unsafe extern "C" {
    pub fn rte_mcfg_mempool_get_lock() -> *mut rte_rwlock_t;
}
unsafe extern "C" {
    pub fn rte_mcfg_timer_get_lock() -> *mut rte_spinlock_t;
}
unsafe extern "C" {
    pub fn rte_mcfg_ethdev_get_lock() -> *mut rte_spinlock_t;
}
unsafe extern "C" {
    #[doc = "Lock the internal EAL shared memory configuration for shared access."]
    pub fn rte_mcfg_mem_read_lock();
}
unsafe extern "C" {
    #[doc = "Unlock the internal EAL shared memory configuration for shared access."]
    pub fn rte_mcfg_mem_read_unlock();
}
unsafe extern "C" {
    #[doc = "Lock the internal EAL shared memory configuration for exclusive access."]
    pub fn rte_mcfg_mem_write_lock();
}
unsafe extern "C" {
    #[doc = "Unlock the internal EAL shared memory configuration for exclusive access."]
    pub fn rte_mcfg_mem_write_unlock();
}
unsafe extern "C" {
    #[doc = "Lock the internal EAL TAILQ list for shared access."]
    pub fn rte_mcfg_tailq_read_lock();
}
unsafe extern "C" {
    #[doc = "Unlock the internal EAL TAILQ list for shared access."]
    pub fn rte_mcfg_tailq_read_unlock();
}
unsafe extern "C" {
    #[doc = "Lock the internal EAL TAILQ list for exclusive access."]
    pub fn rte_mcfg_tailq_write_lock();
}
unsafe extern "C" {
    #[doc = "Unlock the internal EAL TAILQ list for exclusive access."]
    pub fn rte_mcfg_tailq_write_unlock();
}
unsafe extern "C" {
    #[doc = "Lock the internal EAL Mempool list for shared access."]
    pub fn rte_mcfg_mempool_read_lock();
}
unsafe extern "C" {
    #[doc = "Unlock the internal EAL Mempool list for shared access."]
    pub fn rte_mcfg_mempool_read_unlock();
}
unsafe extern "C" {
    #[doc = "Lock the internal EAL Mempool list for exclusive access."]
    pub fn rte_mcfg_mempool_write_lock();
}
unsafe extern "C" {
    #[doc = "Unlock the internal EAL Mempool list for exclusive access."]
    pub fn rte_mcfg_mempool_write_unlock();
}
unsafe extern "C" {
    #[doc = "Lock the internal EAL Timer Library lock for exclusive access."]
    pub fn rte_mcfg_timer_lock();
}
unsafe extern "C" {
    #[doc = "Unlock the internal EAL Timer Library lock for exclusive access."]
    pub fn rte_mcfg_timer_unlock();
}
unsafe extern "C" {
    #[doc = "If true, pages are put in single files (per memseg list),\nas opposed to creating a file per page."]
    pub fn rte_mcfg_get_single_file_segments() -> bool;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct rte_fbarray {
    #[doc = "< name associated with an array"]
    pub name: [::core::ffi::c_char; 64usize],
    #[doc = "< number of entries stored"]
    pub count: ::core::ffi::c_uint,
    #[doc = "< current length of the array"]
    pub len: ::core::ffi::c_uint,
    #[doc = "< size of each element"]
    pub elt_sz: ::core::ffi::c_uint,
    #[doc = "< data pointer"]
    pub data: *mut ::core::ffi::c_void,
    #[doc = "< multiprocess lock"]
    pub rwlock: rte_rwlock_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of rte_fbarray"][::core::mem::size_of::<rte_fbarray>() - 96usize];
    ["Alignment of rte_fbarray"][::core::mem::align_of::<rte_fbarray>() - 8usize];
    ["Offset of field: rte_fbarray::name"][::core::mem::offset_of!(rte_fbarray, name) - 0usize];
    ["Offset of field: rte_fbarray::count"][::core::mem::offset_of!(rte_fbarray, count) - 64usize];
    ["Offset of field: rte_fbarray::len"][::core::mem::offset_of!(rte_fbarray, len) - 68usize];
    ["Offset of field: rte_fbarray::elt_sz"]
        [::core::mem::offset_of!(rte_fbarray, elt_sz) - 72usize];
    ["Offset of field: rte_fbarray::data"][::core::mem::offset_of!(rte_fbarray, data) - 80usize];
    ["Offset of field: rte_fbarray::rwlock"]
        [::core::mem::offset_of!(rte_fbarray, rwlock) - 88usize];
};
impl Default for rte_fbarray {
    fn default() -> Self {
        let mut s = ::core::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::core::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
unsafe extern "C" {
    #[doc = "Set up ``rte_fbarray`` structure and allocate underlying resources.\nCall this function to correctly set up ``rte_fbarray`` and allocate\nunderlying files that will be backing the data in the current process. Note\nthat in order to use and share ``rte_fbarray`` between multiple processes,\ndata pointed to by ``arr`` pointer must itself be allocated in shared memory.\n\n# Arguments\n\n* `arr` -\nValid pointer to allocated ``rte_fbarray`` structure.\n* `name` -\nUnique name to be assigned to this array.\n* `len` -\nNumber of elements initially available in the array.\n* `elt_sz` -\nSize of each element.\n\n# Returns\n\n- 0 on success.\n- -1 on failure, with ``rte_errno`` indicating reason for failure."]
    pub fn rte_fbarray_init(
        arr: *mut rte_fbarray,
        name: *const ::core::ffi::c_char,
        len: ::core::ffi::c_uint,
        elt_sz: ::core::ffi::c_uint,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    #[doc = "Attach to a file backing an already allocated and correctly set up\n``rte_fbarray`` structure.\nCall this function to attach to file that will be backing the data in the\ncurrent process. The structure must have been previously correctly set up\nwith a call to ``rte_fbarray_init()``. Calls to ``rte_fbarray_attach()`` are\nusually meant to be performed in a multiprocessing scenario, with data\npointed to by ``arr`` pointer allocated in shared memory.\n\n# Arguments\n\n* `arr` -\nValid pointer to allocated and correctly set up rte_fbarray structure.\n\n# Returns\n\n- 0 on success.\n- -1 on failure, with ``rte_errno`` indicating reason for failure."]
    pub fn rte_fbarray_attach(arr: *mut rte_fbarray) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    #[doc = "Deallocate resources for an already allocated and correctly set up\n``rte_fbarray`` structure, and remove the underlying file.\nCall this function to deallocate all resources associated with an\n``rte_fbarray`` structure within the current process. This will also\nzero-fill data pointed to by ``arr`` pointer and remove the underlying file\nbacking the data, so it is expected that by the time this function is called,\nall other processes have detached from this ``rte_fbarray``.\n\n# Arguments\n\n* `arr` -\nValid pointer to allocated and correctly set up ``rte_fbarray`` structure.\n\n# Returns\n\n- 0 on success.\n- -1 on failure, with ``rte_errno`` indicating reason for failure."]
    pub fn rte_fbarray_destroy(arr: *mut rte_fbarray) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    #[doc = "Deallocate resources for an already allocated and correctly set up\n``rte_fbarray`` structure.\nCall this function to deallocate all resources associated with an\n``rte_fbarray`` structure within current process.\n\n# Arguments\n\n* `arr` -\nValid pointer to allocated and correctly set up ``rte_fbarray`` structure.\n\n# Returns\n\n- 0 on success.\n- -1 on failure, with ``rte_errno`` indicating reason for failure."]
    pub fn rte_fbarray_detach(arr: *mut rte_fbarray) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    #[doc = "Get pointer to element residing at specified index.\n\n# Arguments\n\n* `arr` -\nValid pointer to allocated and correctly set up ``rte_fbarray`` structure.\n* `idx` -\nIndex of an element to get a pointer to.\n\n# Returns\n\n- non-NULL pointer on success.\n- NULL on failure, with ``rte_errno`` indicating reason for failure."]
    pub fn rte_fbarray_get(
        arr: *const rte_fbarray,
        idx: ::core::ffi::c_uint,
    ) -> *mut ::core::ffi::c_void;
}
unsafe extern "C" {
    #[doc = "Find index of a specified element within the array.\n\n# Arguments\n\n* `arr` -\nValid pointer to allocated and correctly set up ``rte_fbarray`` structure.\n* `elt` -\nPointer to element to find index to.\n\n# Returns\n\n- non-negative integer on success.\n- -1 on failure, with ``rte_errno`` indicating reason for failure."]
    pub fn rte_fbarray_find_idx(
        arr: *const rte_fbarray,
        elt: *const ::core::ffi::c_void,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    #[doc = "Mark specified element as used.\n\n# Arguments\n\n* `arr` -\nValid pointer to allocated and correctly set up ``rte_fbarray`` structure.\n* `idx` -\nElement index to mark as used.\n\n# Returns\n\n- 0 on success.\n- -1 on failure, with ``rte_errno`` indicating reason for failure."]
    pub fn rte_fbarray_set_used(
        arr: *mut rte_fbarray,
        idx: ::core::ffi::c_uint,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    #[doc = "Mark specified element as free.\n\n# Arguments\n\n* `arr` -\nValid pointer to allocated and correctly set up ``rte_fbarray`` structure.\n* `idx` -\nElement index to mark as free.\n\n# Returns\n\n- 0 on success.\n- -1 on failure, with ``rte_errno`` indicating reason for failure."]
    pub fn rte_fbarray_set_free(
        arr: *mut rte_fbarray,
        idx: ::core::ffi::c_uint,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    #[doc = "Check whether element at specified index is marked as used.\n\n# Arguments\n\n* `arr` -\nValid pointer to allocated and correctly set up ``rte_fbarray`` structure.\n* `idx` -\nElement index to check as used.\n\n# Returns\n\n- 1 if element is used.\n- 0 if element is unused.\n- -1 on failure, with ``rte_errno`` indicating reason for failure."]
    pub fn rte_fbarray_is_used(
        arr: *mut rte_fbarray,
        idx: ::core::ffi::c_uint,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    #[doc = "Find index of next free element, starting at specified index.\n\n# Arguments\n\n* `arr` -\nValid pointer to allocated and correctly set up ``rte_fbarray`` structure.\n* `start` -\nElement index to start search from.\n\n# Returns\n\n- non-negative integer on success.\n- -1 on failure, with ``rte_errno`` indicating reason for failure."]
    pub fn rte_fbarray_find_next_free(
        arr: *mut rte_fbarray,
        start: ::core::ffi::c_uint,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    #[doc = "Find index of next used element, starting at specified index.\n\n# Arguments\n\n* `arr` -\nValid pointer to allocated and correctly set up ``rte_fbarray`` structure.\n* `start` -\nElement index to start search from.\n\n# Returns\n\n- non-negative integer on success.\n- -1 on failure, with ``rte_errno`` indicating reason for failure."]
    pub fn rte_fbarray_find_next_used(
        arr: *mut rte_fbarray,
        start: ::core::ffi::c_uint,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    #[doc = "Find index of next chunk of ``n`` free elements, starting at specified index.\n\n# Arguments\n\n* `arr` -\nValid pointer to allocated and correctly set up ``rte_fbarray`` structure.\n* `start` -\nElement index to start search from.\n* `n` -\nNumber of free elements to look for.\n\n# Returns\n\n- non-negative integer on success.\n- -1 on failure, with ``rte_errno`` indicating reason for failure."]
    pub fn rte_fbarray_find_next_n_free(
        arr: *mut rte_fbarray,
        start: ::core::ffi::c_uint,
        n: ::core::ffi::c_uint,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    #[doc = "Find index of next chunk of ``n`` used elements, starting at specified index.\n\n# Arguments\n\n* `arr` -\nValid pointer to allocated and correctly set up ``rte_fbarray`` structure.\n* `start` -\nElement index to start search from.\n* `n` -\nNumber of used elements to look for.\n\n# Returns\n\n- non-negative integer on success.\n- -1 on failure, with ``rte_errno`` indicating reason for failure."]
    pub fn rte_fbarray_find_next_n_used(
        arr: *mut rte_fbarray,
        start: ::core::ffi::c_uint,
        n: ::core::ffi::c_uint,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    #[doc = "Find how many more free entries there are, starting at specified index.\n\n# Arguments\n\n* `arr` -\nValid pointer to allocated and correctly set up ``rte_fbarray`` structure.\n* `start` -\nElement index to start search from.\n\n# Returns\n\n- non-negative integer on success.\n- -1 on failure, with ``rte_errno`` indicating reason for failure."]
    pub fn rte_fbarray_find_contig_free(
        arr: *mut rte_fbarray,
        start: ::core::ffi::c_uint,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    #[doc = "Find how many more used entries there are, starting at specified index.\n\n# Arguments\n\n* `arr` -\nValid pointer to allocated and correctly set up ``rte_fbarray`` structure.\n* `start` -\nElement index to start search from.\n\n# Returns\n\n- non-negative integer on success.\n- -1 on failure, with ``rte_errno`` indicating reason for failure."]
    pub fn rte_fbarray_find_contig_used(
        arr: *mut rte_fbarray,
        start: ::core::ffi::c_uint,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    #[doc = "Find index of previous free element, starting at specified index.\n\n# Arguments\n\n* `arr` -\nValid pointer to allocated and correctly set up ``rte_fbarray`` structure.\n* `start` -\nElement index to start search from.\n\n# Returns\n\n- non-negative integer on success.\n- -1 on failure, with ``rte_errno`` indicating reason for failure."]
    pub fn rte_fbarray_find_prev_free(
        arr: *mut rte_fbarray,
        start: ::core::ffi::c_uint,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    #[doc = "Find index of previous used element, starting at specified index.\n\n# Arguments\n\n* `arr` -\nValid pointer to allocated and correctly set up ``rte_fbarray`` structure.\n* `start` -\nElement index to start search from.\n\n# Returns\n\n- non-negative integer on success.\n- -1 on failure, with ``rte_errno`` indicating reason for failure."]
    pub fn rte_fbarray_find_prev_used(
        arr: *mut rte_fbarray,
        start: ::core::ffi::c_uint,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    #[doc = "Find lowest start index of chunk of ``n`` free elements, down from specified\nindex.\n\n# Arguments\n\n* `arr` -\nValid pointer to allocated and correctly set up ``rte_fbarray`` structure.\n* `start` -\nElement index to start search from.\n* `n` -\nNumber of free elements to look for.\n\n# Returns\n\n- non-negative integer on success.\n- -1 on failure, with ``rte_errno`` indicating reason for failure."]
    pub fn rte_fbarray_find_prev_n_free(
        arr: *mut rte_fbarray,
        start: ::core::ffi::c_uint,
        n: ::core::ffi::c_uint,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    #[doc = "Find lowest start index of chunk of ``n`` used elements, down from specified\nindex.\n\n# Arguments\n\n* `arr` -\nValid pointer to allocated and correctly set up ``rte_fbarray`` structure.\n* `start` -\nElement index to start search from.\n* `n` -\nNumber of used elements to look for.\n\n# Returns\n\n- non-negative integer on success.\n- -1 on failure, with ``rte_errno`` indicating reason for failure."]
    pub fn rte_fbarray_find_prev_n_used(
        arr: *mut rte_fbarray,
        start: ::core::ffi::c_uint,
        n: ::core::ffi::c_uint,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    #[doc = "Find how many more free entries there are before specified index (like\n``rte_fbarray_find_contig_free`` but going in reverse).\n\n# Arguments\n\n* `arr` -\nValid pointer to allocated and correctly set up ``rte_fbarray`` structure.\n* `start` -\nElement index to start search from.\n\n# Returns\n\n- non-negative integer on success.\n- -1 on failure, with ``rte_errno`` indicating reason for failure."]
    pub fn rte_fbarray_find_rev_contig_free(
        arr: *mut rte_fbarray,
        start: ::core::ffi::c_uint,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    #[doc = "Find how many more used entries there are before specified index (like\n``rte_fbarray_find_contig_used`` but going in reverse).\n\n# Arguments\n\n* `arr` -\nValid pointer to allocated and correctly set up ``rte_fbarray`` structure.\n* `start` -\nElement index to start search from.\n\n# Returns\n\n- non-negative integer on success.\n- -1 on failure, with ``rte_errno`` indicating reason for failure."]
    pub fn rte_fbarray_find_rev_contig_used(
        arr: *mut rte_fbarray,
        start: ::core::ffi::c_uint,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    #[doc = "Find index of biggest chunk of free elements, starting at specified index.\n\n# Arguments\n\n* `arr` -\nValid pointer to allocated and correctly set up ``rte_fbarray`` structure.\n* `start` -\nElement index to start search from.\n\n# Returns\n\n- non-negative integer on success.\n- -1 on failure, with ``rte_errno`` indicating reason for failure."]
    pub fn rte_fbarray_find_biggest_free(
        arr: *mut rte_fbarray,
        start: ::core::ffi::c_uint,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    #[doc = "Find index of biggest chunk of used elements, starting at specified index.\n\n# Arguments\n\n* `arr` -\nValid pointer to allocated and correctly set up ``rte_fbarray`` structure.\n* `start` -\nElement index to start search from.\n\n# Returns\n\n- non-negative integer on success.\n- -1 on failure, with ``rte_errno`` indicating reason for failure."]
    pub fn rte_fbarray_find_biggest_used(
        arr: *mut rte_fbarray,
        start: ::core::ffi::c_uint,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    #[doc = "Find index of biggest chunk of free elements before a specified index (like\n``rte_fbarray_find_biggest_free``, but going in reverse).\n\n# Arguments\n\n* `arr` -\nValid pointer to allocated and correctly set up ``rte_fbarray`` structure.\n* `start` -\nElement index to start search from.\n\n# Returns\n\n- non-negative integer on success.\n- -1 on failure, with ``rte_errno`` indicating reason for failure."]
    pub fn rte_fbarray_find_rev_biggest_free(
        arr: *mut rte_fbarray,
        start: ::core::ffi::c_uint,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    #[doc = "Find index of biggest chunk of used elements before a specified index (like\n``rte_fbarray_find_biggest_used``, but going in reverse).\n\n# Arguments\n\n* `arr` -\nValid pointer to allocated and correctly set up ``rte_fbarray`` structure.\n* `start` -\nElement index to start search from.\n\n# Returns\n\n- non-negative integer on success.\n- -1 on failure, with ``rte_errno`` indicating reason for failure."]
    pub fn rte_fbarray_find_rev_biggest_used(
        arr: *mut rte_fbarray,
        start: ::core::ffi::c_uint,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    #[doc = "Dump ``rte_fbarray`` metadata.\n\n# Arguments\n\n* `arr` -\nValid pointer to allocated and correctly set up ``rte_fbarray`` structure.\n* `f` -\nFile object to dump information into."]
    pub fn rte_fbarray_dump_metadata(arr: *mut rte_fbarray, f: *mut FILE);
}
#[doc = "Physical memory segment descriptor."]
#[repr(C, packed)]
#[derive(Copy, Clone)]
pub struct rte_memseg {
    #[doc = "< Start IO address."]
    pub iova: rte_iova_t,
    pub anon1: rte_memseg__bindgen_ty_1,
    #[doc = "< Length of the segment."]
    pub len: usize,
    #[doc = "< The pagesize of underlying memory"]
    pub hugepage_sz: u64,
    #[doc = "< NUMA socket ID."]
    pub socket_id: i32,
    #[doc = "< Number of channels."]
    pub nchannel: u32,
    #[doc = "< Number of ranks."]
    pub nrank: u32,
    #[doc = "< Memseg-specific flags"]
    pub flags: u32,
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union rte_memseg__bindgen_ty_1 {
    #[doc = "< Start virtual address."]
    pub addr: *mut ::core::ffi::c_void,
    #[doc = "< Makes sure addr is always 64 bits"]
    pub addr_64: u64,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of rte_memseg__bindgen_ty_1"]
        [::core::mem::size_of::<rte_memseg__bindgen_ty_1>() - 8usize];
    ["Alignment of rte_memseg__bindgen_ty_1"]
        [::core::mem::align_of::<rte_memseg__bindgen_ty_1>() - 8usize];
    ["Offset of field: rte_memseg__bindgen_ty_1::addr"]
        [::core::mem::offset_of!(rte_memseg__bindgen_ty_1, addr) - 0usize];
    ["Offset of field: rte_memseg__bindgen_ty_1::addr_64"]
        [::core::mem::offset_of!(rte_memseg__bindgen_ty_1, addr_64) - 0usize];
};
impl Default for rte_memseg__bindgen_ty_1 {
    fn default() -> Self {
        let mut s = ::core::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::core::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of rte_memseg"][::core::mem::size_of::<rte_memseg>() - 48usize];
    ["Alignment of rte_memseg"][::core::mem::align_of::<rte_memseg>() - 1usize];
    ["Offset of field: rte_memseg::iova"][::core::mem::offset_of!(rte_memseg, iova) - 0usize];
    ["Offset of field: rte_memseg::len"][::core::mem::offset_of!(rte_memseg, len) - 16usize];
    ["Offset of field: rte_memseg::hugepage_sz"]
        [::core::mem::offset_of!(rte_memseg, hugepage_sz) - 24usize];
    ["Offset of field: rte_memseg::socket_id"]
        [::core::mem::offset_of!(rte_memseg, socket_id) - 32usize];
    ["Offset of field: rte_memseg::nchannel"]
        [::core::mem::offset_of!(rte_memseg, nchannel) - 36usize];
    ["Offset of field: rte_memseg::nrank"][::core::mem::offset_of!(rte_memseg, nrank) - 40usize];
    ["Offset of field: rte_memseg::flags"][::core::mem::offset_of!(rte_memseg, flags) - 44usize];
};
impl Default for rte_memseg {
    fn default() -> Self {
        let mut s = ::core::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::core::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[doc = "memseg list is a special case as we need to store a bunch of other data\ntogether with the array itself."]
#[repr(C)]
#[derive(Copy, Clone)]
pub struct rte_memseg_list {
    pub anon1: rte_memseg_list__bindgen_ty_1,
    #[doc = "< Page size for all memsegs in this list."]
    pub page_sz: u64,
    #[doc = "< Socket ID for all memsegs in this list."]
    pub socket_id: ::core::ffi::c_int,
    #[doc = "< version number for multiprocess sync."]
    pub version: u32,
    #[doc = "< Length of memory area covered by this memseg list."]
    pub len: usize,
    #[doc = "< 1 if this list points to external memory"]
    pub external: ::core::ffi::c_uint,
    #[doc = "< 1 if this list points to a heap"]
    pub heap: ::core::ffi::c_uint,
    pub memseg_arr: rte_fbarray,
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union rte_memseg_list__bindgen_ty_1 {
    pub base_va: *mut ::core::ffi::c_void,
    pub addr_64: u64,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of rte_memseg_list__bindgen_ty_1"]
        [::core::mem::size_of::<rte_memseg_list__bindgen_ty_1>() - 8usize];
    ["Alignment of rte_memseg_list__bindgen_ty_1"]
        [::core::mem::align_of::<rte_memseg_list__bindgen_ty_1>() - 8usize];
    ["Offset of field: rte_memseg_list__bindgen_ty_1::base_va"]
        [::core::mem::offset_of!(rte_memseg_list__bindgen_ty_1, base_va) - 0usize];
    ["Offset of field: rte_memseg_list__bindgen_ty_1::addr_64"]
        [::core::mem::offset_of!(rte_memseg_list__bindgen_ty_1, addr_64) - 0usize];
};
impl Default for rte_memseg_list__bindgen_ty_1 {
    fn default() -> Self {
        let mut s = ::core::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::core::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of rte_memseg_list"][::core::mem::size_of::<rte_memseg_list>() - 136usize];
    ["Alignment of rte_memseg_list"][::core::mem::align_of::<rte_memseg_list>() - 8usize];
    ["Offset of field: rte_memseg_list::page_sz"]
        [::core::mem::offset_of!(rte_memseg_list, page_sz) - 8usize];
    ["Offset of field: rte_memseg_list::socket_id"]
        [::core::mem::offset_of!(rte_memseg_list, socket_id) - 16usize];
    ["Offset of field: rte_memseg_list::version"]
        [::core::mem::offset_of!(rte_memseg_list, version) - 20usize];
    ["Offset of field: rte_memseg_list::len"]
        [::core::mem::offset_of!(rte_memseg_list, len) - 24usize];
    ["Offset of field: rte_memseg_list::external"]
        [::core::mem::offset_of!(rte_memseg_list, external) - 32usize];
    ["Offset of field: rte_memseg_list::heap"]
        [::core::mem::offset_of!(rte_memseg_list, heap) - 36usize];
    ["Offset of field: rte_memseg_list::memseg_arr"]
        [::core::mem::offset_of!(rte_memseg_list, memseg_arr) - 40usize];
};
impl Default for rte_memseg_list {
    fn default() -> Self {
        let mut s = ::core::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::core::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
unsafe extern "C" {
    #[doc = "Lock page in physical memory and prevent from swapping.\n\n# Arguments\n\n* `virt` -\nThe virtual address.\n\n# Returns\n\n0 on success, negative on error."]
    pub fn rte_mem_lock_page(virt: *const ::core::ffi::c_void) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    #[doc = "Get physical address of any mapped virtual address in the current process.\nIt is found by browsing the /proc/self/pagemap special file.\nThe page must be locked.\n\n# Arguments\n\n* `virt` -\nThe virtual address.\n\n# Returns\n\nThe physical address or RTE_BAD_IOVA on error."]
    pub fn rte_mem_virt2phy(virt: *const ::core::ffi::c_void) -> phys_addr_t;
}
unsafe extern "C" {
    #[doc = "Get IO virtual address of any mapped virtual address in the current process.\n> **Note** This function will not check internal page table. Instead, in IOVA as\nPA mode, it will fall back to getting real physical address (which may\nnot match the expected IOVA, such as what was specified for external\nmemory).\n\n# Arguments\n\n* `virt` -\nThe virtual address.\n\n# Returns\n\nThe IO address or RTE_BAD_IOVA on error."]
    pub fn rte_mem_virt2iova(virt: *const ::core::ffi::c_void) -> rte_iova_t;
}
unsafe extern "C" {
    #[doc = "Get virtual memory address corresponding to iova address.\n> **Note** This function read-locks the memory hotplug subsystem, and thus cannot\nbe used within memory-related callback functions.\n\n# Arguments\n\n* `iova` -\nThe iova address.\n\n# Returns\n\nVirtual address corresponding to iova address (or NULL if address does not\nexist within DPDK memory map)."]
    pub fn rte_mem_iova2virt(iova: rte_iova_t) -> *mut ::core::ffi::c_void;
}
unsafe extern "C" {
    #[doc = "Get memseg to which a particular virtual address belongs.\n\n# Arguments\n\n* `virt` -\nThe virtual address.\n* `msl` -\nThe memseg list in which to look up based on ``virt`` address\n(can be NULL).\n\n# Returns\n\nMemseg pointer on success, or NULL on error."]
    pub fn rte_mem_virt2memseg(
        virt: *const ::core::ffi::c_void,
        msl: *const rte_memseg_list,
    ) -> *mut rte_memseg;
}
unsafe extern "C" {
    #[doc = "Get memseg list corresponding to virtual memory address.\n\n# Arguments\n\n* `virt` -\nThe virtual address.\n\n# Returns\n\nMemseg list to which this virtual address belongs to."]
    pub fn rte_mem_virt2memseg_list(virt: *const ::core::ffi::c_void) -> *mut rte_memseg_list;
}
#[doc = "Memseg walk function prototype.\nReturning 0 will continue walk\nReturning 1 will stop the walk\nReturning -1 will stop the walk and report error"]
pub type rte_memseg_walk_t = ::core::option::Option<
    unsafe extern "C" fn(
        msl: *const rte_memseg_list,
        ms: *const rte_memseg,
        arg: *mut ::core::ffi::c_void,
    ) -> ::core::ffi::c_int,
>;
#[doc = "Memseg contig walk function prototype. This will trigger a callback on every\nVA-contiguous area starting at memseg ``ms``, so total valid VA space at each\ncallback call will be [``ms->addr``, ``ms->addr + len``).\nReturning 0 will continue walk\nReturning 1 will stop the walk\nReturning -1 will stop the walk and report error"]
pub type rte_memseg_contig_walk_t = ::core::option::Option<
    unsafe extern "C" fn(
        msl: *const rte_memseg_list,
        ms: *const rte_memseg,
        len: usize,
        arg: *mut ::core::ffi::c_void,
    ) -> ::core::ffi::c_int,
>;
#[doc = "Memseg list walk function prototype. This will trigger a callback on every\nallocated memseg list.\nReturning 0 will continue walk\nReturning 1 will stop the walk\nReturning -1 will stop the walk and report error"]
pub type rte_memseg_list_walk_t = ::core::option::Option<
    unsafe extern "C" fn(
        msl: *const rte_memseg_list,
        arg: *mut ::core::ffi::c_void,
    ) -> ::core::ffi::c_int,
>;
unsafe extern "C" {
    #[doc = "Walk list of all memsegs.\n> **Note** This function read-locks the memory hotplug subsystem, and thus cannot\nbe used within memory-related callback functions.\n> **Note** This function will also walk through externally allocated segments. It\nis up to the user to decide whether to skip through these segments.\n\n# Arguments\n\n* `func` -\nIterator function\n* `arg` -\nArgument passed to iterator\n\n# Returns\n\n0 if walked over the entire list\n1 if stopped by the user\n-1 if user function reported error"]
    pub fn rte_memseg_walk(
        func: rte_memseg_walk_t,
        arg: *mut ::core::ffi::c_void,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    #[doc = "Walk each VA-contiguous area.\n> **Note** This function read-locks the memory hotplug subsystem, and thus cannot\nbe used within memory-related callback functions.\n> **Note** This function will also walk through externally allocated segments. It\nis up to the user to decide whether to skip through these segments.\n\n# Arguments\n\n* `func` -\nIterator function\n* `arg` -\nArgument passed to iterator\n\n# Returns\n\n0 if walked over the entire list\n1 if stopped by the user\n-1 if user function reported error"]
    pub fn rte_memseg_contig_walk(
        func: rte_memseg_contig_walk_t,
        arg: *mut ::core::ffi::c_void,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    #[doc = "Walk each allocated memseg list.\n> **Note** This function read-locks the memory hotplug subsystem, and thus cannot\nbe used within memory-related callback functions.\n> **Note** This function will also walk through externally allocated segments. It\nis up to the user to decide whether to skip through these segments.\n\n# Arguments\n\n* `func` -\nIterator function\n* `arg` -\nArgument passed to iterator\n\n# Returns\n\n0 if walked over the entire list\n1 if stopped by the user\n-1 if user function reported error"]
    pub fn rte_memseg_list_walk(
        func: rte_memseg_list_walk_t,
        arg: *mut ::core::ffi::c_void,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    #[doc = "Walk list of all memsegs without performing any locking.\n> **Note** This function does not perform any locking, and is only safe to call\nfrom within memory-related callback functions.\n\n# Arguments\n\n* `func` -\nIterator function\n* `arg` -\nArgument passed to iterator\n\n# Returns\n\n0 if walked over the entire list\n1 if stopped by the user\n-1 if user function reported error"]
    pub fn rte_memseg_walk_thread_unsafe(
        func: rte_memseg_walk_t,
        arg: *mut ::core::ffi::c_void,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    #[doc = "Walk each VA-contiguous area without performing any locking.\n> **Note** This function does not perform any locking, and is only safe to call\nfrom within memory-related callback functions.\n\n# Arguments\n\n* `func` -\nIterator function\n* `arg` -\nArgument passed to iterator\n\n# Returns\n\n0 if walked over the entire list\n1 if stopped by the user\n-1 if user function reported error"]
    pub fn rte_memseg_contig_walk_thread_unsafe(
        func: rte_memseg_contig_walk_t,
        arg: *mut ::core::ffi::c_void,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    #[doc = "Walk each allocated memseg list without performing any locking.\n> **Note** This function does not perform any locking, and is only safe to call\nfrom within memory-related callback functions.\n\n# Arguments\n\n* `func` -\nIterator function\n* `arg` -\nArgument passed to iterator\n\n# Returns\n\n0 if walked over the entire list\n1 if stopped by the user\n-1 if user function reported error"]
    pub fn rte_memseg_list_walk_thread_unsafe(
        func: rte_memseg_list_walk_t,
        arg: *mut ::core::ffi::c_void,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    #[doc = "Return file descriptor associated with a particular memseg (if available).\n> **Note** This function read-locks the memory hotplug subsystem, and thus cannot\nbe used within memory-related callback functions.\n> **Note** This returns an internal file descriptor. Performing any operations on\nthis file descriptor is inherently dangerous, so it should be treated\nas read-only for all intents and purposes.\n\n# Arguments\n\n* `ms` -\nA pointer to memseg for which to get file descriptor.\n\n# Returns\n\nValid file descriptor in case of success.\n-1 in case of error, with ``rte_errno`` set to the following values:\n- EINVAL  - ``ms`` pointer was NULL or did not point to a valid memseg\n- ENODEV  - ``ms`` fd is not available\n- ENOENT  - ``ms`` is an unused segment\n- ENOTSUP - segment fd's are not supported"]
    pub fn rte_memseg_get_fd(ms: *const rte_memseg) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    #[doc = "Return file descriptor associated with a particular memseg (if available).\n> **Note** This function does not perform any locking, and is only safe to call\nfrom within memory-related callback functions.\n> **Note** This returns an internal file descriptor. Performing any operations on\nthis file descriptor is inherently dangerous, so it should be treated\nas read-only for all intents and purposes.\n\n# Arguments\n\n* `ms` -\nA pointer to memseg for which to get file descriptor.\n\n# Returns\n\nValid file descriptor in case of success.\n-1 in case of error, with ``rte_errno`` set to the following values:\n- EINVAL  - ``ms`` pointer was NULL or did not point to a valid memseg\n- ENODEV  - ``ms`` fd is not available\n- ENOENT  - ``ms`` is an unused segment\n- ENOTSUP - segment fd's are not supported"]
    pub fn rte_memseg_get_fd_thread_unsafe(ms: *const rte_memseg) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    #[doc = "Get offset into segment file descriptor associated with a particular memseg\n(if available).\n> **Note** This function read-locks the memory hotplug subsystem, and thus cannot\nbe used within memory-related callback functions.\n\n# Arguments\n\n* `ms` -\nA pointer to memseg for which to get file descriptor.\n* `offset` -\nA pointer to offset value where the result will be stored.\n\n# Returns\n\nValid file descriptor in case of success.\n-1 in case of error, with ``rte_errno`` set to the following values:\n- EINVAL  - ``ms`` pointer was NULL or did not point to a valid memseg\n- EINVAL  - ``offset`` pointer was NULL\n- ENODEV  - ``ms`` fd is not available\n- ENOENT  - ``ms`` is an unused segment\n- ENOTSUP - segment fd's are not supported"]
    pub fn rte_memseg_get_fd_offset(
        ms: *const rte_memseg,
        offset: *mut usize,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    #[doc = "Get offset into segment file descriptor associated with a particular memseg\n(if available).\n> **Note** This function does not perform any locking, and is only safe to call\nfrom within memory-related callback functions.\n\n# Arguments\n\n* `ms` -\nA pointer to memseg for which to get file descriptor.\n* `offset` -\nA pointer to offset value where the result will be stored.\n\n# Returns\n\nValid file descriptor in case of success.\n-1 in case of error, with ``rte_errno`` set to the following values:\n- EINVAL  - ``ms`` pointer was NULL or did not point to a valid memseg\n- EINVAL  - ``offset`` pointer was NULL\n- ENODEV  - ``ms`` fd is not available\n- ENOENT  - ``ms`` is an unused segment\n- ENOTSUP - segment fd's are not supported"]
    pub fn rte_memseg_get_fd_offset_thread_unsafe(
        ms: *const rte_memseg,
        offset: *mut usize,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    #[doc = "Register external memory chunk with DPDK.\n> **Note** Using this API is mutually exclusive with ``rte_malloc`` family of\nAPI's.\n> **Note** This API will not perform any DMA mapping. It is expected that user\nwill do that themselves.\n> **Note** Before accessing this memory in other processes, it needs to be\nattached in each of those processes by calling ``rte_extmem_attach`` in\neach other process.\n\n# Arguments\n\n* `va_addr` -\nStart of virtual area to register. Must be aligned by ``page_sz``.\n* `len` -\nLength of virtual area to register. Must be aligned by ``page_sz``.\n* `iova_addrs` -\nArray of page IOVA addresses corresponding to each page in this memory\narea. Can be NULL, in which case page IOVA addresses will be set to\nRTE_BAD_IOVA.\n* `n_pages` -\nNumber of elements in the iova_addrs array. Ignored if  ``iova_addrs``\nis NULL.\n* `page_sz` -\nPage size of the underlying memory\n\n# Returns\n\n- 0 on success\n- -1 in case of error, with rte_errno set to one of the following:\nEINVAL - one of the parameters was invalid\nEEXIST - memory chunk is already registered\nENOSPC - no more space in internal config to store a new memory chunk"]
    pub fn rte_extmem_register(
        va_addr: *mut ::core::ffi::c_void,
        len: usize,
        iova_addrs: *mut rte_iova_t,
        n_pages: ::core::ffi::c_uint,
        page_sz: usize,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    #[doc = "Unregister external memory chunk with DPDK.\n> **Note** Using this API is mutually exclusive with ``rte_malloc`` family of\nAPI's.\n> **Note** This API will not perform any DMA unmapping. It is expected that user\nwill do that themselves.\n> **Note** Before calling this function, all other processes must call\n``rte_extmem_detach`` to detach from the memory area.\n\n# Arguments\n\n* `va_addr` -\nStart of virtual area to unregister\n* `len` -\nLength of virtual area to unregister\n\n# Returns\n\n- 0 on success\n- -1 in case of error, with rte_errno set to one of the following:\nEINVAL - one of the parameters was invalid\nENOENT - memory chunk was not found"]
    pub fn rte_extmem_unregister(
        va_addr: *mut ::core::ffi::c_void,
        len: usize,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    #[doc = "Attach to external memory chunk registered in another process.\n> **Note** Using this API is mutually exclusive with ``rte_malloc`` family of\nAPI's.\n> **Note** This API will not perform any DMA mapping. It is expected that user\nwill do that themselves.\n\n# Arguments\n\n* `va_addr` -\nStart of virtual area to register\n* `len` -\nLength of virtual area to register\n\n# Returns\n\n- 0 on success\n- -1 in case of error, with rte_errno set to one of the following:\nEINVAL - one of the parameters was invalid\nENOENT - memory chunk was not found"]
    pub fn rte_extmem_attach(va_addr: *mut ::core::ffi::c_void, len: usize) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    #[doc = "Detach from external memory chunk registered in another process.\n> **Note** Using this API is mutually exclusive with ``rte_malloc`` family of\nAPI's.\n> **Note** This API will not perform any DMA unmapping. It is expected that user\nwill do that themselves.\n\n# Arguments\n\n* `va_addr` -\nStart of virtual area to unregister\n* `len` -\nLength of virtual area to unregister\n\n# Returns\n\n- 0 on success\n- -1 in case of error, with rte_errno set to one of the following:\nEINVAL - one of the parameters was invalid\nENOENT - memory chunk was not found"]
    pub fn rte_extmem_detach(va_addr: *mut ::core::ffi::c_void, len: usize) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    #[doc = "Dump the physical memory layout to a file.\n> **Note** This function read-locks the memory hotplug subsystem, and thus cannot\nbe used within memory-related callback functions.\n\n# Arguments\n\n* `f` -\nA pointer to a file for output"]
    pub fn rte_dump_physmem_layout(f: *mut FILE);
}
unsafe extern "C" {
    #[doc = "Get the total amount of available physical memory.\n> **Note** This function read-locks the memory hotplug subsystem, and thus cannot\nbe used within memory-related callback functions.\n\n# Returns\n\nThe total amount of available physical memory in bytes."]
    pub fn rte_eal_get_physmem_size() -> u64;
}
unsafe extern "C" {
    #[doc = "Get the number of memory channels.\n\n# Returns\n\nThe number of memory channels on the system. The value is 0 if unknown\nor not the same on all devices."]
    pub fn rte_memory_get_nchannel() -> ::core::ffi::c_uint;
}
unsafe extern "C" {
    #[doc = "Get the number of memory ranks.\n\n# Returns\n\nThe number of memory ranks on the system. The value is 0 if unknown or\nnot the same on all devices."]
    pub fn rte_memory_get_nrank() -> ::core::ffi::c_uint;
}
unsafe extern "C" {
    #[doc = "Check if all currently allocated memory segments are compliant with\nsupplied DMA address width.\n\n# Arguments\n\n* `maskbits` -\nAddress width to check against."]
    pub fn rte_mem_check_dma_mask(maskbits: u8) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    #[doc = "Check if all currently allocated memory segments are compliant with\nsupplied DMA address width. This function will use\nrte_memseg_walk_thread_unsafe instead of rte_memseg_walk implying\nmemory_hotplug_lock will not be acquired avoiding deadlock during\nmemory initialization.\nThis function is just for EAL core memory internal use. Drivers should\nuse the previous rte_mem_check_dma_mask.\n\n# Arguments\n\n* `maskbits` -\nAddress width to check against."]
    pub fn rte_mem_check_dma_mask_thread_unsafe(maskbits: u8) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    #[doc = "Set dma mask to use once memory initialization is done. Previous functions\nrte_mem_check_dma_mask and rte_mem_check_dma_mask_thread_unsafe can not be\nused safely until memory has been initialized."]
    pub fn rte_mem_set_dma_mask(maskbits: u8);
}
unsafe extern "C" {
    #[doc = "Drivers based on uio will not load unless physical\naddresses are obtainable. It is only possible to get\nphysical addresses when running as a privileged user.\n\n# Returns\n\n1 if the system is able to obtain physical addresses.\n0 if using DMA addresses through an IOMMU."]
    pub fn rte_eal_using_phys_addrs() -> ::core::ffi::c_int;
}
pub mod rte_mem_event {
    #[doc = "Enum indicating which kind of memory event has happened. Used by callbacks to\ndistinguish between memory allocations and deallocations."]
    pub type Type = ::core::ffi::c_uint;
    #[doc = "< Allocation event."]
    pub const RTE_MEM_EVENT_ALLOC: Type = 0;
    #[doc = "< Deallocation event."]
    pub const RTE_MEM_EVENT_FREE: Type = 1;
}
#[doc = "Function typedef used to register callbacks for memory events."]
pub type rte_mem_event_callback_t = ::core::option::Option<
    unsafe extern "C" fn(
        event_type: rte_mem_event::Type,
        addr: *const ::core::ffi::c_void,
        len: usize,
        arg: *mut ::core::ffi::c_void,
    ),
>;
unsafe extern "C" {
    #[doc = "Function used to register callbacks for memory events.\n> **Note** callbacks will happen while memory hotplug subsystem is write-locked,\ntherefore some functions (e.g. `rte_memseg_walk()`) will cause a\ndeadlock when called from within such callbacks.\n> **Note** mem event callbacks not being supported is an expected error condition,\nso user code needs to handle this situation. In these cases, return\nvalue will be -1, and rte_errno will be set to ENOTSUP.\n\n# Arguments\n\n* `name` -\nName associated with specified callback to be added to the list.\n* `clb` -\nCallback function pointer.\n* `arg` -\nArgument to pass to the callback.\n\n# Returns\n\n0 on successful callback register\n-1 on unsuccessful callback register, with rte_errno value indicating\nreason for failure."]
    pub fn rte_mem_event_callback_register(
        name: *const ::core::ffi::c_char,
        clb: rte_mem_event_callback_t,
        arg: *mut ::core::ffi::c_void,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    #[doc = "Function used to unregister callbacks for memory events.\n\n# Arguments\n\n* `name` -\nName associated with specified callback to be removed from the list.\n* `arg` -\nArgument to look for among callbacks with specified callback name.\n\n# Returns\n\n0 on successful callback unregister\n-1 on unsuccessful callback unregister, with rte_errno value indicating\nreason for failure."]
    pub fn rte_mem_event_callback_unregister(
        name: *const ::core::ffi::c_char,
        arg: *mut ::core::ffi::c_void,
    ) -> ::core::ffi::c_int;
}
#[doc = "Function typedef used to register memory allocation validation callbacks.\nReturning 0 will allow allocation attempt to continue. Returning -1 will\nprevent allocation from succeeding."]
pub type rte_mem_alloc_validator_t = ::core::option::Option<
    unsafe extern "C" fn(
        socket_id: ::core::ffi::c_int,
        cur_limit: usize,
        new_len: usize,
    ) -> ::core::ffi::c_int,
>;
unsafe extern "C" {
    #[doc = "Register validator callback for memory allocations.\nCallbacks registered by this function will be called right before memory\nallocator is about to trigger allocation of more pages from the system if\nsaid allocation will bring total memory usage above specified limit on\nspecified socket. User will be able to cancel pending allocation if callback\nreturns -1.\n> **Note** callbacks will happen while memory hotplug subsystem is write-locked,\ntherefore some functions (e.g. `rte_memseg_walk()`) will cause a\ndeadlock when called from within such callbacks.\n> **Note** validator callbacks not being supported is an expected error condition,\nso user code needs to handle this situation. In these cases, return\nvalue will be -1, and rte_errno will be set to ENOTSUP.\n\n# Arguments\n\n* `name` -\nName associated with specified callback to be added to the list.\n* `clb` -\nCallback function pointer.\n* `socket_id` -\nSocket ID on which to watch for allocations.\n* `limit` -\nLimit above which to trigger callbacks.\n\n# Returns\n\n0 on successful callback register\n-1 on unsuccessful callback register, with rte_errno value indicating\nreason for failure."]
    pub fn rte_mem_alloc_validator_register(
        name: *const ::core::ffi::c_char,
        clb: rte_mem_alloc_validator_t,
        socket_id: ::core::ffi::c_int,
        limit: usize,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    #[doc = "Unregister validator callback for memory allocations.\n\n# Arguments\n\n* `name` -\nName associated with specified callback to be removed from the list.\n* `socket_id` -\nSocket ID on which to watch for allocations.\n\n# Returns\n\n0 on successful callback unregister\n-1 on unsuccessful callback unregister, with rte_errno value indicating\nreason for failure."]
    pub fn rte_mem_alloc_validator_unregister(
        name: *const ::core::ffi::c_char,
        socket_id: ::core::ffi::c_int,
    ) -> ::core::ffi::c_int;
}
#[doc = "A structure describing a memzone, which is a contiguous portion of\nphysical memory identified by a name."]
#[repr(C, packed)]
#[derive(Copy, Clone)]
pub struct rte_memzone {
    #[doc = "< Name of the memory zone."]
    pub name: [::core::ffi::c_char; 32usize],
    #[doc = "< Start IO address."]
    pub iova: rte_iova_t,
    pub anon1: rte_memzone__bindgen_ty_1,
    #[doc = "< Length of the memzone."]
    pub len: usize,
    #[doc = "< The page size of underlying memory"]
    pub hugepage_sz: u64,
    #[doc = "< NUMA socket ID."]
    pub socket_id: i32,
    #[doc = "< Characteristics of this memzone."]
    pub flags: u32,
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union rte_memzone__bindgen_ty_1 {
    #[doc = "< Start virtual address."]
    pub addr: *mut ::core::ffi::c_void,
    #[doc = "< Makes sure addr is always 64-bits"]
    pub addr_64: u64,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of rte_memzone__bindgen_ty_1"]
        [::core::mem::size_of::<rte_memzone__bindgen_ty_1>() - 8usize];
    ["Alignment of rte_memzone__bindgen_ty_1"]
        [::core::mem::align_of::<rte_memzone__bindgen_ty_1>() - 8usize];
    ["Offset of field: rte_memzone__bindgen_ty_1::addr"]
        [::core::mem::offset_of!(rte_memzone__bindgen_ty_1, addr) - 0usize];
    ["Offset of field: rte_memzone__bindgen_ty_1::addr_64"]
        [::core::mem::offset_of!(rte_memzone__bindgen_ty_1, addr_64) - 0usize];
};
impl Default for rte_memzone__bindgen_ty_1 {
    fn default() -> Self {
        let mut s = ::core::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::core::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of rte_memzone"][::core::mem::size_of::<rte_memzone>() - 72usize];
    ["Alignment of rte_memzone"][::core::mem::align_of::<rte_memzone>() - 1usize];
    ["Offset of field: rte_memzone::name"][::core::mem::offset_of!(rte_memzone, name) - 0usize];
    ["Offset of field: rte_memzone::iova"][::core::mem::offset_of!(rte_memzone, iova) - 32usize];
    ["Offset of field: rte_memzone::len"][::core::mem::offset_of!(rte_memzone, len) - 48usize];
    ["Offset of field: rte_memzone::hugepage_sz"]
        [::core::mem::offset_of!(rte_memzone, hugepage_sz) - 56usize];
    ["Offset of field: rte_memzone::socket_id"]
        [::core::mem::offset_of!(rte_memzone, socket_id) - 64usize];
    ["Offset of field: rte_memzone::flags"][::core::mem::offset_of!(rte_memzone, flags) - 68usize];
};
impl Default for rte_memzone {
    fn default() -> Self {
        let mut s = ::core::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::core::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
unsafe extern "C" {
    #[doc = "Set the maximum number of memzones.\nThis function can only be called prior to rte_eal_init().\n\n# Arguments\n\n* `max` -\nMaximum number of memzones.\n\n# Returns\n\n0 on success, -1 otherwise."]
    pub fn rte_memzone_max_set(max: usize) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    #[doc = "Get the maximum number of memzones.\n@note: The maximum value will not change after calling rte_eal_init().\n\n# Returns\n\nMaximum number of memzones."]
    pub fn rte_memzone_max_get() -> usize;
}
unsafe extern "C" {
    #[doc = "Reserve a portion of physical memory.\nThis function reserves some memory and returns a pointer to a\ncorrectly filled memzone descriptor. If the allocation cannot be\ndone, return NULL.\n> **Note** Reserving memzones with len set to 0 will only attempt to allocate\nmemzones from memory that is already available. It will not trigger any\nnew allocations.\n@note: When reserving memzones with len set to 0, it is preferable to also\nset a valid socket_id. Setting socket_id to SOCKET_ID_ANY is supported, but\nwill likely not yield expected results. Specifically, the resulting memzone\nmay not necessarily be the biggest memzone available, but rather biggest\nmemzone available on socket id corresponding to an lcore from which\nreservation was called.\n\n# Arguments\n\n* `name` -\nThe name of the memzone. If it already exists, the function will\nfail and return NULL.\n* `len` -\nThe size of the memory to be reserved. If it\nis 0, the biggest contiguous zone will be reserved.\n* `socket_id` -\nThe socket identifier in the case of\nNUMA. The value can be SOCKET_ID_ANY if there is no NUMA\nconstraint for the reserved zone.\n* `flags` -\nThe flags parameter is used to request memzones to be\ntaken from specifically sized hugepages.\n- RTE_MEMZONE_2MB - Reserved from 2MB pages\n- RTE_MEMZONE_1GB - Reserved from 1GB pages\n- RTE_MEMZONE_16MB - Reserved from 16MB pages\n- RTE_MEMZONE_16GB - Reserved from 16GB pages\n- RTE_MEMZONE_256KB - Reserved from 256KB pages\n- RTE_MEMZONE_256MB - Reserved from 256MB pages\n- RTE_MEMZONE_512MB - Reserved from 512MB pages\n- RTE_MEMZONE_4GB - Reserved from 4GB pages\n- RTE_MEMZONE_SIZE_HINT_ONLY - Allow alternative page size to be used if\nthe requested page size is unavailable.\nIf this flag is not set, the function\nwill return error on an unavailable size\nrequest.\n- RTE_MEMZONE_IOVA_CONTIG - Ensure reserved memzone is IOVA-contiguous.\nThis option should be used when allocating\nmemory intended for hardware rings etc.\n\n# Returns\n\nA pointer to a correctly-filled read-only memzone descriptor, or NULL\non error.\nOn error case, rte_errno will be set appropriately:\n- E_RTE_NO_CONFIG - function could not get pointer to rte_config structure\n- ENOSPC - the maximum number of memzones has already been allocated\n- EEXIST - a memzone with the same name already exists\n- ENOMEM - no appropriate memory area found in which to create memzone\n- EINVAL - invalid parameters"]
    pub fn rte_memzone_reserve(
        name: *const ::core::ffi::c_char,
        len: usize,
        socket_id: ::core::ffi::c_int,
        flags: ::core::ffi::c_uint,
    ) -> *const rte_memzone;
}
unsafe extern "C" {
    #[doc = "Reserve a portion of physical memory with alignment on a specified\nboundary.\nThis function reserves some memory with alignment on a specified\nboundary, and returns a pointer to a correctly filled memzone\ndescriptor. If the allocation cannot be done or if the alignment\nis not a power of 2, returns NULL.\n> **Note** Reserving memzones with len set to 0 will only attempt to allocate\nmemzones from memory that is already available. It will not trigger any\nnew allocations.\n@note: When reserving memzones with len set to 0, it is preferable to also\nset a valid socket_id. Setting socket_id to SOCKET_ID_ANY is supported, but\nwill likely not yield expected results. Specifically, the resulting memzone\nmay not necessarily be the biggest memzone available, but rather biggest\nmemzone available on socket id corresponding to an lcore from which\nreservation was called.\n\n# Arguments\n\n* `name` -\nThe name of the memzone. If it already exists, the function will\nfail and return NULL.\n* `len` -\nThe size of the memory to be reserved. If it\nis 0, the biggest contiguous zone will be reserved.\n* `socket_id` -\nThe socket identifier in the case of\nNUMA. The value can be SOCKET_ID_ANY if there is no NUMA\nconstraint for the reserved zone.\n* `flags` -\nThe flags parameter is used to request memzones to be\ntaken from specifically sized hugepages.\n- RTE_MEMZONE_2MB - Reserved from 2MB pages\n- RTE_MEMZONE_1GB - Reserved from 1GB pages\n- RTE_MEMZONE_16MB - Reserved from 16MB pages\n- RTE_MEMZONE_16GB - Reserved from 16GB pages\n- RTE_MEMZONE_256KB - Reserved from 256KB pages\n- RTE_MEMZONE_256MB - Reserved from 256MB pages\n- RTE_MEMZONE_512MB - Reserved from 512MB pages\n- RTE_MEMZONE_4GB - Reserved from 4GB pages\n- RTE_MEMZONE_SIZE_HINT_ONLY - Allow alternative page size to be used if\nthe requested page size is unavailable.\nIf this flag is not set, the function\nwill return error on an unavailable size\nrequest.\n- RTE_MEMZONE_IOVA_CONTIG - Ensure reserved memzone is IOVA-contiguous.\nThis option should be used when allocating\nmemory intended for hardware rings etc.\n* `align` -\nAlignment for resulting memzone. Must be a power of 2.\n\n# Returns\n\nA pointer to a correctly-filled read-only memzone descriptor, or NULL\non error.\nOn error case, rte_errno will be set appropriately:\n- E_RTE_NO_CONFIG - function could not get pointer to rte_config structure\n- ENOSPC - the maximum number of memzones has already been allocated\n- EEXIST - a memzone with the same name already exists\n- ENOMEM - no appropriate memory area found in which to create memzone\n- EINVAL - invalid parameters"]
    pub fn rte_memzone_reserve_aligned(
        name: *const ::core::ffi::c_char,
        len: usize,
        socket_id: ::core::ffi::c_int,
        flags: ::core::ffi::c_uint,
        align: ::core::ffi::c_uint,
    ) -> *const rte_memzone;
}
unsafe extern "C" {
    #[doc = "Reserve a portion of physical memory with specified alignment and\nboundary.\nThis function reserves some memory with specified alignment and\nboundary, and returns a pointer to a correctly filled memzone\ndescriptor. If the allocation cannot be done or if the alignment\nor boundary are not a power of 2, returns NULL.\nMemory buffer is reserved in a way, that it wouldn't cross specified\nboundary. That implies that requested length should be less or equal\nthen boundary.\n> **Note** Reserving memzones with len set to 0 will only attempt to allocate\nmemzones from memory that is already available. It will not trigger any\nnew allocations.\n@note: When reserving memzones with len set to 0, it is preferable to also\nset a valid socket_id. Setting socket_id to SOCKET_ID_ANY is supported, but\nwill likely not yield expected results. Specifically, the resulting memzone\nmay not necessarily be the biggest memzone available, but rather biggest\nmemzone available on socket id corresponding to an lcore from which\nreservation was called.\n\n# Arguments\n\n* `name` -\nThe name of the memzone. If it already exists, the function will\nfail and return NULL.\n* `len` -\nThe size of the memory to be reserved. If it\nis 0, the biggest contiguous zone will be reserved.\n* `socket_id` -\nThe socket identifier in the case of\nNUMA. The value can be SOCKET_ID_ANY if there is no NUMA\nconstraint for the reserved zone.\n* `flags` -\nThe flags parameter is used to request memzones to be\ntaken from specifically sized hugepages.\n- RTE_MEMZONE_2MB - Reserved from 2MB pages\n- RTE_MEMZONE_1GB - Reserved from 1GB pages\n- RTE_MEMZONE_16MB - Reserved from 16MB pages\n- RTE_MEMZONE_16GB - Reserved from 16GB pages\n- RTE_MEMZONE_256KB - Reserved from 256KB pages\n- RTE_MEMZONE_256MB - Reserved from 256MB pages\n- RTE_MEMZONE_512MB - Reserved from 512MB pages\n- RTE_MEMZONE_4GB - Reserved from 4GB pages\n- RTE_MEMZONE_SIZE_HINT_ONLY - Allow alternative page size to be used if\nthe requested page size is unavailable.\nIf this flag is not set, the function\nwill return error on an unavailable size\nrequest.\n- RTE_MEMZONE_IOVA_CONTIG - Ensure reserved memzone is IOVA-contiguous.\nThis option should be used when allocating\nmemory intended for hardware rings etc.\n* `align` -\nAlignment for resulting memzone. Must be a power of 2.\n* `bound` -\nBoundary for resulting memzone. Must be a power of 2 or zero.\nZero value implies no boundary condition.\n\n# Returns\n\nA pointer to a correctly-filled read-only memzone descriptor, or NULL\non error.\nOn error case, rte_errno will be set appropriately:\n- E_RTE_NO_CONFIG - function could not get pointer to rte_config structure\n- ENOSPC - the maximum number of memzones has already been allocated\n- EEXIST - a memzone with the same name already exists\n- ENOMEM - no appropriate memory area found in which to create memzone\n- EINVAL - invalid parameters"]
    pub fn rte_memzone_reserve_bounded(
        name: *const ::core::ffi::c_char,
        len: usize,
        socket_id: ::core::ffi::c_int,
        flags: ::core::ffi::c_uint,
        align: ::core::ffi::c_uint,
        bound: ::core::ffi::c_uint,
    ) -> *const rte_memzone;
}
unsafe extern "C" {
    #[doc = "Free a memzone.\n\n# Arguments\n\n* `mz` -\nA pointer to the memzone\n\n# Returns\n\n-EINVAL - invalid parameter.\n0 - success"]
    pub fn rte_memzone_free(mz: *const rte_memzone) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    #[doc = "Lookup for a memzone.\nGet a pointer to a descriptor of an already reserved memory\nzone identified by the name given as an argument.\n\n# Arguments\n\n* `name` -\nThe name of the memzone.\n\n# Returns\n\nA pointer to a read-only memzone descriptor."]
    pub fn rte_memzone_lookup(name: *const ::core::ffi::c_char) -> *const rte_memzone;
}
unsafe extern "C" {
    #[doc = "Dump all reserved memzones to a file.\n\n# Arguments\n\n* `f` -\nA pointer to a file for output"]
    pub fn rte_memzone_dump(f: *mut FILE);
}
unsafe extern "C" {
    #[doc = "Walk list of all memzones\n\n# Arguments\n\n* `func` -\nIterator function\n* `arg` -\nArgument passed to iterator"]
    pub fn rte_memzone_walk(
        func: ::core::option::Option<
            unsafe extern "C" fn(arg1: *const rte_memzone, arg: *mut ::core::ffi::c_void),
        >,
        arg: *mut ::core::ffi::c_void,
    );
}
pub mod rte_ring_queue_behavior {
    #[doc = "enqueue/dequeue behavior types"]
    pub type Type = ::core::ffi::c_uint;
    #[doc = "Enq/Deq a fixed number of items from a ring"]
    pub const RTE_RING_QUEUE_FIXED: Type = 0;
    #[doc = "Enq/Deq as many items as possible from ring"]
    pub const RTE_RING_QUEUE_VARIABLE: Type = 1;
}
pub mod rte_ring_sync_type {
    #[doc = "prod/cons sync types"]
    pub type Type = ::core::ffi::c_uint;
    #[doc = "< multi-thread safe (default mode)"]
    pub const RTE_RING_SYNC_MT: Type = 0;
    #[doc = "< single thread only"]
    pub const RTE_RING_SYNC_ST: Type = 1;
    #[doc = "< multi-thread relaxed tail sync"]
    pub const RTE_RING_SYNC_MT_RTS: Type = 2;
    #[doc = "< multi-thread head/tail sync"]
    pub const RTE_RING_SYNC_MT_HTS: Type = 3;
}
#[doc = "structures to hold a pair of head/tail values and other metadata.\nDepending on sync_type format of that structure might be different,\nbut offset for *sync_type* and *tail* values should remain the same."]
#[repr(C)]
#[derive(Copy, Clone)]
pub struct rte_ring_headtail {
    #[doc = "< prod/consumer head."]
    pub head: u32,
    #[doc = "< prod/consumer tail."]
    pub tail: u32,
    pub anon1: rte_ring_headtail__bindgen_ty_1,
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union rte_ring_headtail__bindgen_ty_1 {
    #[doc = "sync type of prod/cons"]
    pub sync_type: rte_ring_sync_type::Type,
    #[doc = "deprecated -  True if single prod/cons"]
    pub single: u32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of rte_ring_headtail__bindgen_ty_1"]
        [::core::mem::size_of::<rte_ring_headtail__bindgen_ty_1>() - 4usize];
    ["Alignment of rte_ring_headtail__bindgen_ty_1"]
        [::core::mem::align_of::<rte_ring_headtail__bindgen_ty_1>() - 4usize];
    ["Offset of field: rte_ring_headtail__bindgen_ty_1::sync_type"]
        [::core::mem::offset_of!(rte_ring_headtail__bindgen_ty_1, sync_type) - 0usize];
    ["Offset of field: rte_ring_headtail__bindgen_ty_1::single"]
        [::core::mem::offset_of!(rte_ring_headtail__bindgen_ty_1, single) - 0usize];
};
impl Default for rte_ring_headtail__bindgen_ty_1 {
    fn default() -> Self {
        let mut s = ::core::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::core::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of rte_ring_headtail"][::core::mem::size_of::<rte_ring_headtail>() - 12usize];
    ["Alignment of rte_ring_headtail"][::core::mem::align_of::<rte_ring_headtail>() - 4usize];
    ["Offset of field: rte_ring_headtail::head"]
        [::core::mem::offset_of!(rte_ring_headtail, head) - 0usize];
    ["Offset of field: rte_ring_headtail::tail"]
        [::core::mem::offset_of!(rte_ring_headtail, tail) - 4usize];
};
impl Default for rte_ring_headtail {
    fn default() -> Self {
        let mut s = ::core::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::core::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union __rte_ring_rts_poscnt {
    #[doc = "raw 8B value to read/write *cnt* and *pos* as one atomic op"]
    pub raw: u64,
    pub val: __rte_ring_rts_poscnt__bindgen_ty_1,
}
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct __rte_ring_rts_poscnt__bindgen_ty_1 {
    #[doc = "< head/tail reference counter"]
    pub cnt: u32,
    #[doc = "< head/tail position"]
    pub pos: u32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of __rte_ring_rts_poscnt__bindgen_ty_1"]
        [::core::mem::size_of::<__rte_ring_rts_poscnt__bindgen_ty_1>() - 8usize];
    ["Alignment of __rte_ring_rts_poscnt__bindgen_ty_1"]
        [::core::mem::align_of::<__rte_ring_rts_poscnt__bindgen_ty_1>() - 4usize];
    ["Offset of field: __rte_ring_rts_poscnt__bindgen_ty_1::cnt"]
        [::core::mem::offset_of!(__rte_ring_rts_poscnt__bindgen_ty_1, cnt) - 0usize];
    ["Offset of field: __rte_ring_rts_poscnt__bindgen_ty_1::pos"]
        [::core::mem::offset_of!(__rte_ring_rts_poscnt__bindgen_ty_1, pos) - 4usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of __rte_ring_rts_poscnt"][::core::mem::size_of::<__rte_ring_rts_poscnt>() - 8usize];
    ["Alignment of __rte_ring_rts_poscnt"]
        [::core::mem::align_of::<__rte_ring_rts_poscnt>() - 8usize];
    ["Offset of field: __rte_ring_rts_poscnt::raw"]
        [::core::mem::offset_of!(__rte_ring_rts_poscnt, raw) - 0usize];
    ["Offset of field: __rte_ring_rts_poscnt::val"]
        [::core::mem::offset_of!(__rte_ring_rts_poscnt, val) - 0usize];
};
impl Default for __rte_ring_rts_poscnt {
    fn default() -> Self {
        let mut s = ::core::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::core::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct rte_ring_rts_headtail {
    pub tail: __rte_ring_rts_poscnt,
    #[doc = "< sync type of prod/cons"]
    pub sync_type: rte_ring_sync_type::Type,
    #[doc = "< max allowed distance between head/tail"]
    pub htd_max: u32,
    pub head: __rte_ring_rts_poscnt,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of rte_ring_rts_headtail"][::core::mem::size_of::<rte_ring_rts_headtail>() - 24usize];
    ["Alignment of rte_ring_rts_headtail"]
        [::core::mem::align_of::<rte_ring_rts_headtail>() - 8usize];
    ["Offset of field: rte_ring_rts_headtail::tail"]
        [::core::mem::offset_of!(rte_ring_rts_headtail, tail) - 0usize];
    ["Offset of field: rte_ring_rts_headtail::sync_type"]
        [::core::mem::offset_of!(rte_ring_rts_headtail, sync_type) - 8usize];
    ["Offset of field: rte_ring_rts_headtail::htd_max"]
        [::core::mem::offset_of!(rte_ring_rts_headtail, htd_max) - 12usize];
    ["Offset of field: rte_ring_rts_headtail::head"]
        [::core::mem::offset_of!(rte_ring_rts_headtail, head) - 16usize];
};
impl Default for rte_ring_rts_headtail {
    fn default() -> Self {
        let mut s = ::core::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::core::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union __rte_ring_hts_pos {
    #[doc = "raw 8B value to read/write *head* and *tail* as one atomic op"]
    pub raw: u64,
    pub pos: __rte_ring_hts_pos__bindgen_ty_1,
}
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct __rte_ring_hts_pos__bindgen_ty_1 {
    #[doc = "< head position"]
    pub head: u32,
    #[doc = "< tail position"]
    pub tail: u32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of __rte_ring_hts_pos__bindgen_ty_1"]
        [::core::mem::size_of::<__rte_ring_hts_pos__bindgen_ty_1>() - 8usize];
    ["Alignment of __rte_ring_hts_pos__bindgen_ty_1"]
        [::core::mem::align_of::<__rte_ring_hts_pos__bindgen_ty_1>() - 4usize];
    ["Offset of field: __rte_ring_hts_pos__bindgen_ty_1::head"]
        [::core::mem::offset_of!(__rte_ring_hts_pos__bindgen_ty_1, head) - 0usize];
    ["Offset of field: __rte_ring_hts_pos__bindgen_ty_1::tail"]
        [::core::mem::offset_of!(__rte_ring_hts_pos__bindgen_ty_1, tail) - 4usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of __rte_ring_hts_pos"][::core::mem::size_of::<__rte_ring_hts_pos>() - 8usize];
    ["Alignment of __rte_ring_hts_pos"][::core::mem::align_of::<__rte_ring_hts_pos>() - 8usize];
    ["Offset of field: __rte_ring_hts_pos::raw"]
        [::core::mem::offset_of!(__rte_ring_hts_pos, raw) - 0usize];
    ["Offset of field: __rte_ring_hts_pos::pos"]
        [::core::mem::offset_of!(__rte_ring_hts_pos, pos) - 0usize];
};
impl Default for __rte_ring_hts_pos {
    fn default() -> Self {
        let mut s = ::core::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::core::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct rte_ring_hts_headtail {
    pub ht: __rte_ring_hts_pos,
    #[doc = "< sync type of prod/cons"]
    pub sync_type: rte_ring_sync_type::Type,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of rte_ring_hts_headtail"][::core::mem::size_of::<rte_ring_hts_headtail>() - 16usize];
    ["Alignment of rte_ring_hts_headtail"]
        [::core::mem::align_of::<rte_ring_hts_headtail>() - 8usize];
    ["Offset of field: rte_ring_hts_headtail::ht"]
        [::core::mem::offset_of!(rte_ring_hts_headtail, ht) - 0usize];
    ["Offset of field: rte_ring_hts_headtail::sync_type"]
        [::core::mem::offset_of!(rte_ring_hts_headtail, sync_type) - 8usize];
};
impl Default for rte_ring_hts_headtail {
    fn default() -> Self {
        let mut s = ::core::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::core::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[doc = "An RTE ring structure.\nThe producer and the consumer have a head and a tail index. The particularity\nof these index is that they are not between 0 and size(ring)-1. These indexes\nare between 0 and 2^32 -1, and we mask their value when we access the ring[]\nfield. Thanks to this assumption, we can do subtractions between 2 index\nvalues in a modulo-32bit base: that's why the overflow of the indexes is not\na problem."]
#[repr(C)]
#[repr(align(64))]
#[derive(Copy, Clone)]
pub struct rte_ring {
    pub name: [::core::ffi::c_char; 29usize],
    #[doc = "< Flags supplied at creation."]
    pub flags: ::core::ffi::c_int,
    pub memzone: *const rte_memzone,
    #[doc = "< Size of ring."]
    pub size: u32,
    #[doc = "< Mask (size-1) of ring."]
    pub mask: u32,
    #[doc = "< Usable size of ring"]
    pub capacity: u32,
    pub __bindgen_padding_0: [u8; 4usize],
    pub cache_guard_0: [::core::ffi::c_char; 64usize],
    pub anon1: rte_ring__bindgen_ty_1,
    pub cache_guard_1: [::core::ffi::c_char; 64usize],
    pub anon2: rte_ring__bindgen_ty_2,
    pub cache_guard_2: [::core::ffi::c_char; 64usize],
}
#[doc = "Ring producer status."]
#[repr(C)]
#[repr(align(64))]
#[derive(Copy, Clone)]
pub union rte_ring__bindgen_ty_1 {
    pub prod: rte_ring_headtail,
    pub hts_prod: rte_ring_hts_headtail,
    pub rts_prod: rte_ring_rts_headtail,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of rte_ring__bindgen_ty_1"][::core::mem::size_of::<rte_ring__bindgen_ty_1>() - 64usize];
    ["Alignment of rte_ring__bindgen_ty_1"]
        [::core::mem::align_of::<rte_ring__bindgen_ty_1>() - 64usize];
    ["Offset of field: rte_ring__bindgen_ty_1::prod"]
        [::core::mem::offset_of!(rte_ring__bindgen_ty_1, prod) - 0usize];
    ["Offset of field: rte_ring__bindgen_ty_1::hts_prod"]
        [::core::mem::offset_of!(rte_ring__bindgen_ty_1, hts_prod) - 0usize];
    ["Offset of field: rte_ring__bindgen_ty_1::rts_prod"]
        [::core::mem::offset_of!(rte_ring__bindgen_ty_1, rts_prod) - 0usize];
};
impl Default for rte_ring__bindgen_ty_1 {
    fn default() -> Self {
        let mut s = ::core::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::core::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[doc = "Ring consumer status."]
#[repr(C)]
#[repr(align(64))]
#[derive(Copy, Clone)]
pub union rte_ring__bindgen_ty_2 {
    pub cons: rte_ring_headtail,
    pub hts_cons: rte_ring_hts_headtail,
    pub rts_cons: rte_ring_rts_headtail,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of rte_ring__bindgen_ty_2"][::core::mem::size_of::<rte_ring__bindgen_ty_2>() - 64usize];
    ["Alignment of rte_ring__bindgen_ty_2"]
        [::core::mem::align_of::<rte_ring__bindgen_ty_2>() - 64usize];
    ["Offset of field: rte_ring__bindgen_ty_2::cons"]
        [::core::mem::offset_of!(rte_ring__bindgen_ty_2, cons) - 0usize];
    ["Offset of field: rte_ring__bindgen_ty_2::hts_cons"]
        [::core::mem::offset_of!(rte_ring__bindgen_ty_2, hts_cons) - 0usize];
    ["Offset of field: rte_ring__bindgen_ty_2::rts_cons"]
        [::core::mem::offset_of!(rte_ring__bindgen_ty_2, rts_cons) - 0usize];
};
impl Default for rte_ring__bindgen_ty_2 {
    fn default() -> Self {
        let mut s = ::core::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::core::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of rte_ring"][::core::mem::size_of::<rte_ring>() - 384usize];
    ["Alignment of rte_ring"][::core::mem::align_of::<rte_ring>() - 64usize];
    ["Offset of field: rte_ring::name"][::core::mem::offset_of!(rte_ring, name) - 0usize];
    ["Offset of field: rte_ring::flags"][::core::mem::offset_of!(rte_ring, flags) - 32usize];
    ["Offset of field: rte_ring::memzone"][::core::mem::offset_of!(rte_ring, memzone) - 40usize];
    ["Offset of field: rte_ring::size"][::core::mem::offset_of!(rte_ring, size) - 48usize];
    ["Offset of field: rte_ring::mask"][::core::mem::offset_of!(rte_ring, mask) - 52usize];
    ["Offset of field: rte_ring::capacity"][::core::mem::offset_of!(rte_ring, capacity) - 56usize];
    ["Offset of field: rte_ring::cache_guard_0"]
        [::core::mem::offset_of!(rte_ring, cache_guard_0) - 64usize];
    ["Offset of field: rte_ring::cache_guard_1"]
        [::core::mem::offset_of!(rte_ring, cache_guard_1) - 192usize];
    ["Offset of field: rte_ring::cache_guard_2"]
        [::core::mem::offset_of!(rte_ring, cache_guard_2) - 320usize];
};
impl Default for rte_ring {
    fn default() -> Self {
        let mut s = ::core::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::core::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
unsafe extern "C" {
    #[doc = "Calculate the memory size needed for a ring with given element size\nThis function returns the number of bytes needed for a ring, given\nthe number of elements in it and the size of the element. This value\nis the sum of the size of the structure rte_ring and the size of the\nmemory needed for storing the elements. The value is aligned to a cache\nline size.\n\n# Arguments\n\n* `esize` -\nThe size of ring element, in bytes. It must be a multiple of 4.\n* `count` -\nThe number of elements in the ring (must be a power of 2).\n\n# Returns\n\n- The memory size needed for the ring on success.\n- -EINVAL - esize is not a multiple of 4 or count provided is not a\npower of 2."]
    pub fn rte_ring_get_memsize_elem(
        esize: ::core::ffi::c_uint,
        count: ::core::ffi::c_uint,
    ) -> isize;
}
unsafe extern "C" {
    #[doc = "Create a new ring named *name* that stores elements with given size.\nThis function uses ``memzone_reserve()`` to allocate memory. Then it\ncalls rte_ring_init() to initialize an empty ring.\nThe new ring size is set to *count*, which must be a power of\ntwo. Water marking is disabled by default. The real usable ring size\nis *count-1* instead of *count* to differentiate a full ring from an\nempty ring.\nThe ring is added in RTE_TAILQ_RING list.\n\n# Arguments\n\n* `name` -\nThe name of the ring.\n* `esize` -\nThe size of ring element, in bytes. It must be a multiple of 4.\n* `count` -\nThe number of elements in the ring (must be a power of 2).\n* `socket_id` -\nThe *socket_id* argument is the socket identifier in case of\nNUMA. The value can be *SOCKET_ID_ANY* if there is no NUMA\nconstraint for the reserved zone.\n* `flags` -\nAn OR of the following:\n- One of mutually exclusive flags that define producer behavior:\n- RING_F_SP_ENQ: If this flag is set, the default behavior when\nusing ``rte_ring_enqueue()`` or ``rte_ring_enqueue_bulk()``\nis \"single-producer\".\n- RING_F_MP_RTS_ENQ: If this flag is set, the default behavior when\nusing ``rte_ring_enqueue()`` or ``rte_ring_enqueue_bulk()``\nis \"multi-producer RTS mode\".\n- RING_F_MP_HTS_ENQ: If this flag is set, the default behavior when\nusing ``rte_ring_enqueue()`` or ``rte_ring_enqueue_bulk()``\nis \"multi-producer HTS mode\".\nIf none of these flags is set, then default \"multi-producer\"\nbehavior is selected.\n- One of mutually exclusive flags that define consumer behavior:\n- RING_F_SC_DEQ: If this flag is set, the default behavior when\nusing ``rte_ring_dequeue()`` or ``rte_ring_dequeue_bulk()``\nis \"single-consumer\". Otherwise, it is \"multi-consumers\".\n- RING_F_MC_RTS_DEQ: If this flag is set, the default behavior when\nusing ``rte_ring_dequeue()`` or ``rte_ring_dequeue_bulk()``\nis \"multi-consumer RTS mode\".\n- RING_F_MC_HTS_DEQ: If this flag is set, the default behavior when\nusing ``rte_ring_dequeue()`` or ``rte_ring_dequeue_bulk()``\nis \"multi-consumer HTS mode\".\nIf none of these flags is set, then default \"multi-consumer\"\nbehavior is selected.\n\n# Returns\n\nOn success, the pointer to the new allocated ring. NULL on error with\nrte_errno set appropriately. Possible errno values include:\n- E_RTE_NO_CONFIG - function could not get pointer to rte_config structure\n- EINVAL - esize is not a multiple of 4 or count provided is not a\npower of 2.\n- ENOSPC - the maximum number of memzones has already been allocated\n- EEXIST - a memzone with the same name already exists\n- ENOMEM - no appropriate memory area found in which to create memzone"]
    pub fn rte_ring_create_elem(
        name: *const ::core::ffi::c_char,
        esize: ::core::ffi::c_uint,
        count: ::core::ffi::c_uint,
        socket_id: ::core::ffi::c_int,
        flags: ::core::ffi::c_uint,
    ) -> *mut rte_ring;
}
unsafe extern "C" {
    #[doc = "Enqueue several objects on the ring (multi-producers safe).\nThis function uses a \"compare and set\" instruction to move the\nproducer index atomically.\n\n# Arguments\n\n* `r` -\nA pointer to the ring structure.\n* `obj_table` -\nA pointer to a table of objects.\n* `esize` -\nThe size of ring element, in bytes. It must be a multiple of 4.\nThis must be the same value used while creating the ring. Otherwise\nthe results are undefined.\n* `n` -\nThe number of objects to add in the ring from the obj_table.\n* `free_space` -\nif non-NULL, returns the amount of space in the ring after the\nenqueue operation has finished.\n\n# Returns\n\nThe number of objects enqueued, either 0 or n"]
    #[link_name = "rte_ring_mp_enqueue_bulk_elem_w"]
    pub fn rte_ring_mp_enqueue_bulk_elem(
        r: *mut rte_ring,
        obj_table: *const ::core::ffi::c_void,
        esize: ::core::ffi::c_uint,
        n: ::core::ffi::c_uint,
        free_space: *mut ::core::ffi::c_uint,
    ) -> ::core::ffi::c_uint;
}
unsafe extern "C" {
    #[doc = "Enqueue several objects on a ring\n@warning This API is NOT multi-producers safe\n\n# Arguments\n\n* `r` -\nA pointer to the ring structure.\n* `obj_table` -\nA pointer to a table of objects.\n* `esize` -\nThe size of ring element, in bytes. It must be a multiple of 4.\nThis must be the same value used while creating the ring. Otherwise\nthe results are undefined.\n* `n` -\nThe number of objects to add in the ring from the obj_table.\n* `free_space` -\nif non-NULL, returns the amount of space in the ring after the\nenqueue operation has finished.\n\n# Returns\n\nThe number of objects enqueued, either 0 or n"]
    #[link_name = "rte_ring_sp_enqueue_bulk_elem_w"]
    pub fn rte_ring_sp_enqueue_bulk_elem(
        r: *mut rte_ring,
        obj_table: *const ::core::ffi::c_void,
        esize: ::core::ffi::c_uint,
        n: ::core::ffi::c_uint,
        free_space: *mut ::core::ffi::c_uint,
    ) -> ::core::ffi::c_uint;
}
unsafe extern "C" {
    #[doc = "Enqueue several objects on the HTS ring (multi-producers safe).\n\n# Arguments\n\n* `r` -\nA pointer to the ring structure.\n* `obj_table` -\nA pointer to a table of objects.\n* `esize` -\nThe size of ring element, in bytes. It must be a multiple of 4.\nThis must be the same value used while creating the ring. Otherwise\nthe results are undefined.\n* `n` -\nThe number of objects to add in the ring from the obj_table.\n* `free_space` -\nif non-NULL, returns the amount of space in the ring after the\nenqueue operation has finished.\n\n# Returns\n\nThe number of objects enqueued, either 0 or n"]
    #[link_name = "rte_ring_mp_hts_enqueue_bulk_elem_w"]
    pub fn rte_ring_mp_hts_enqueue_bulk_elem(
        r: *mut rte_ring,
        obj_table: *const ::core::ffi::c_void,
        esize: ::core::ffi::c_uint,
        n: ::core::ffi::c_uint,
        free_space: *mut ::core::ffi::c_uint,
    ) -> ::core::ffi::c_uint;
}
unsafe extern "C" {
    #[doc = "Dequeue several objects from an HTS ring (multi-consumers safe).\n\n# Arguments\n\n* `r` -\nA pointer to the ring structure.\n* `obj_table` -\nA pointer to a table of objects that will be filled.\n* `esize` -\nThe size of ring element, in bytes. It must be a multiple of 4.\nThis must be the same value used while creating the ring. Otherwise\nthe results are undefined.\n* `n` -\nThe number of objects to dequeue from the ring to the obj_table.\n* `available` -\nIf non-NULL, returns the number of remaining ring entries after the\ndequeue has finished.\n\n# Returns\n\nThe number of objects dequeued, either 0 or n"]
    #[link_name = "rte_ring_mc_hts_dequeue_bulk_elem_w"]
    pub fn rte_ring_mc_hts_dequeue_bulk_elem(
        r: *mut rte_ring,
        obj_table: *mut ::core::ffi::c_void,
        esize: ::core::ffi::c_uint,
        n: ::core::ffi::c_uint,
        available: *mut ::core::ffi::c_uint,
    ) -> ::core::ffi::c_uint;
}
unsafe extern "C" {
    #[doc = "Enqueue several objects on the HTS ring (multi-producers safe).\n\n# Arguments\n\n* `r` -\nA pointer to the ring structure.\n* `obj_table` -\nA pointer to a table of objects.\n* `esize` -\nThe size of ring element, in bytes. It must be a multiple of 4.\nThis must be the same value used while creating the ring. Otherwise\nthe results are undefined.\n* `n` -\nThe number of objects to add in the ring from the obj_table.\n* `free_space` -\nif non-NULL, returns the amount of space in the ring after the\nenqueue operation has finished.\n\n# Returns\n\n- n: Actual number of objects enqueued."]
    #[link_name = "rte_ring_mp_hts_enqueue_burst_elem_w"]
    pub fn rte_ring_mp_hts_enqueue_burst_elem(
        r: *mut rte_ring,
        obj_table: *const ::core::ffi::c_void,
        esize: ::core::ffi::c_uint,
        n: ::core::ffi::c_uint,
        free_space: *mut ::core::ffi::c_uint,
    ) -> ::core::ffi::c_uint;
}
unsafe extern "C" {
    #[doc = "Dequeue several objects from an HTS  ring (multi-consumers safe).\nWhen the requested objects are more than the available objects,\nonly dequeue the actual number of objects.\n\n# Arguments\n\n* `r` -\nA pointer to the ring structure.\n* `obj_table` -\nA pointer to a table of objects that will be filled.\n* `esize` -\nThe size of ring element, in bytes. It must be a multiple of 4.\nThis must be the same value used while creating the ring. Otherwise\nthe results are undefined.\n* `n` -\nThe number of objects to dequeue from the ring to the obj_table.\n* `available` -\nIf non-NULL, returns the number of remaining ring entries after the\ndequeue has finished.\n\n# Returns\n\n- n: Actual number of objects dequeued, 0 if ring is empty"]
    #[link_name = "rte_ring_mc_hts_dequeue_burst_elem_w"]
    pub fn rte_ring_mc_hts_dequeue_burst_elem(
        r: *mut rte_ring,
        obj_table: *mut ::core::ffi::c_void,
        esize: ::core::ffi::c_uint,
        n: ::core::ffi::c_uint,
        available: *mut ::core::ffi::c_uint,
    ) -> ::core::ffi::c_uint;
}
unsafe extern "C" {
    #[doc = "Enqueue several objects on the HTS ring (multi-producers safe).\n\n# Arguments\n\n* `r` -\nA pointer to the ring structure.\n* `obj_table` -\nA pointer to a table of void * pointers (objects).\n* `n` -\nThe number of objects to add in the ring from the obj_table.\n* `free_space` -\nif non-NULL, returns the amount of space in the ring after the\nenqueue operation has finished.\n\n# Returns\n\nThe number of objects enqueued, either 0 or n"]
    #[link_name = "rte_ring_mp_hts_enqueue_bulk_w"]
    pub fn rte_ring_mp_hts_enqueue_bulk(
        r: *mut rte_ring,
        obj_table: *const *mut ::core::ffi::c_void,
        n: ::core::ffi::c_uint,
        free_space: *mut ::core::ffi::c_uint,
    ) -> ::core::ffi::c_uint;
}
unsafe extern "C" {
    #[doc = "Dequeue several objects from an HTS ring (multi-consumers safe).\n\n# Arguments\n\n* `r` -\nA pointer to the ring structure.\n* `obj_table` -\nA pointer to a table of void * pointers (objects) that will be filled.\n* `n` -\nThe number of objects to dequeue from the ring to the obj_table.\n* `available` -\nIf non-NULL, returns the number of remaining ring entries after the\ndequeue has finished.\n\n# Returns\n\nThe number of objects dequeued, either 0 or n"]
    #[link_name = "rte_ring_mc_hts_dequeue_bulk_w"]
    pub fn rte_ring_mc_hts_dequeue_bulk(
        r: *mut rte_ring,
        obj_table: *mut *mut ::core::ffi::c_void,
        n: ::core::ffi::c_uint,
        available: *mut ::core::ffi::c_uint,
    ) -> ::core::ffi::c_uint;
}
unsafe extern "C" {
    #[doc = "Enqueue several objects on the HTS ring (multi-producers safe).\n\n# Arguments\n\n* `r` -\nA pointer to the ring structure.\n* `obj_table` -\nA pointer to a table of void * pointers (objects).\n* `n` -\nThe number of objects to add in the ring from the obj_table.\n* `free_space` -\nif non-NULL, returns the amount of space in the ring after the\nenqueue operation has finished.\n\n# Returns\n\n- n: Actual number of objects enqueued."]
    #[link_name = "rte_ring_mp_hts_enqueue_burst_w"]
    pub fn rte_ring_mp_hts_enqueue_burst(
        r: *mut rte_ring,
        obj_table: *const *mut ::core::ffi::c_void,
        n: ::core::ffi::c_uint,
        free_space: *mut ::core::ffi::c_uint,
    ) -> ::core::ffi::c_uint;
}
unsafe extern "C" {
    #[doc = "Dequeue several objects from an HTS  ring (multi-consumers safe).\nWhen the requested objects are more than the available objects,\nonly dequeue the actual number of objects.\n\n# Arguments\n\n* `r` -\nA pointer to the ring structure.\n* `obj_table` -\nA pointer to a table of void * pointers (objects) that will be filled.\n* `n` -\nThe number of objects to dequeue from the ring to the obj_table.\n* `available` -\nIf non-NULL, returns the number of remaining ring entries after the\ndequeue has finished.\n\n# Returns\n\n- n: Actual number of objects dequeued, 0 if ring is empty"]
    #[link_name = "rte_ring_mc_hts_dequeue_burst_w"]
    pub fn rte_ring_mc_hts_dequeue_burst(
        r: *mut rte_ring,
        obj_table: *mut *mut ::core::ffi::c_void,
        n: ::core::ffi::c_uint,
        available: *mut ::core::ffi::c_uint,
    ) -> ::core::ffi::c_uint;
}
unsafe extern "C" {
    #[doc = "Enqueue several objects on the RTS ring (multi-producers safe).\n\n# Arguments\n\n* `r` -\nA pointer to the ring structure.\n* `obj_table` -\nA pointer to a table of objects.\n* `esize` -\nThe size of ring element, in bytes. It must be a multiple of 4.\nThis must be the same value used while creating the ring. Otherwise\nthe results are undefined.\n* `n` -\nThe number of objects to add in the ring from the obj_table.\n* `free_space` -\nif non-NULL, returns the amount of space in the ring after the\nenqueue operation has finished.\n\n# Returns\n\nThe number of objects enqueued, either 0 or n"]
    #[link_name = "rte_ring_mp_rts_enqueue_bulk_elem_w"]
    pub fn rte_ring_mp_rts_enqueue_bulk_elem(
        r: *mut rte_ring,
        obj_table: *const ::core::ffi::c_void,
        esize: ::core::ffi::c_uint,
        n: ::core::ffi::c_uint,
        free_space: *mut ::core::ffi::c_uint,
    ) -> ::core::ffi::c_uint;
}
unsafe extern "C" {
    #[doc = "Dequeue several objects from an RTS ring (multi-consumers safe).\n\n# Arguments\n\n* `r` -\nA pointer to the ring structure.\n* `obj_table` -\nA pointer to a table of objects that will be filled.\n* `esize` -\nThe size of ring element, in bytes. It must be a multiple of 4.\nThis must be the same value used while creating the ring. Otherwise\nthe results are undefined.\n* `n` -\nThe number of objects to dequeue from the ring to the obj_table.\n* `available` -\nIf non-NULL, returns the number of remaining ring entries after the\ndequeue has finished.\n\n# Returns\n\nThe number of objects dequeued, either 0 or n"]
    #[link_name = "rte_ring_mc_rts_dequeue_bulk_elem_w"]
    pub fn rte_ring_mc_rts_dequeue_bulk_elem(
        r: *mut rte_ring,
        obj_table: *mut ::core::ffi::c_void,
        esize: ::core::ffi::c_uint,
        n: ::core::ffi::c_uint,
        available: *mut ::core::ffi::c_uint,
    ) -> ::core::ffi::c_uint;
}
unsafe extern "C" {
    #[doc = "Enqueue several objects on the RTS ring (multi-producers safe).\n\n# Arguments\n\n* `r` -\nA pointer to the ring structure.\n* `obj_table` -\nA pointer to a table of objects.\n* `esize` -\nThe size of ring element, in bytes. It must be a multiple of 4.\nThis must be the same value used while creating the ring. Otherwise\nthe results are undefined.\n* `n` -\nThe number of objects to add in the ring from the obj_table.\n* `free_space` -\nif non-NULL, returns the amount of space in the ring after the\nenqueue operation has finished.\n\n# Returns\n\n- n: Actual number of objects enqueued."]
    #[link_name = "rte_ring_mp_rts_enqueue_burst_elem_w"]
    pub fn rte_ring_mp_rts_enqueue_burst_elem(
        r: *mut rte_ring,
        obj_table: *const ::core::ffi::c_void,
        esize: ::core::ffi::c_uint,
        n: ::core::ffi::c_uint,
        free_space: *mut ::core::ffi::c_uint,
    ) -> ::core::ffi::c_uint;
}
unsafe extern "C" {
    #[doc = "Dequeue several objects from an RTS  ring (multi-consumers safe).\nWhen the requested objects are more than the available objects,\nonly dequeue the actual number of objects.\n\n# Arguments\n\n* `r` -\nA pointer to the ring structure.\n* `obj_table` -\nA pointer to a table of objects that will be filled.\n* `esize` -\nThe size of ring element, in bytes. It must be a multiple of 4.\nThis must be the same value used while creating the ring. Otherwise\nthe results are undefined.\n* `n` -\nThe number of objects to dequeue from the ring to the obj_table.\n* `available` -\nIf non-NULL, returns the number of remaining ring entries after the\ndequeue has finished.\n\n# Returns\n\n- n: Actual number of objects dequeued, 0 if ring is empty"]
    #[link_name = "rte_ring_mc_rts_dequeue_burst_elem_w"]
    pub fn rte_ring_mc_rts_dequeue_burst_elem(
        r: *mut rte_ring,
        obj_table: *mut ::core::ffi::c_void,
        esize: ::core::ffi::c_uint,
        n: ::core::ffi::c_uint,
        available: *mut ::core::ffi::c_uint,
    ) -> ::core::ffi::c_uint;
}
unsafe extern "C" {
    #[doc = "Enqueue several objects on the RTS ring (multi-producers safe).\n\n# Arguments\n\n* `r` -\nA pointer to the ring structure.\n* `obj_table` -\nA pointer to a table of void * pointers (objects).\n* `n` -\nThe number of objects to add in the ring from the obj_table.\n* `free_space` -\nif non-NULL, returns the amount of space in the ring after the\nenqueue operation has finished.\n\n# Returns\n\nThe number of objects enqueued, either 0 or n"]
    #[link_name = "rte_ring_mp_rts_enqueue_bulk_w"]
    pub fn rte_ring_mp_rts_enqueue_bulk(
        r: *mut rte_ring,
        obj_table: *const *mut ::core::ffi::c_void,
        n: ::core::ffi::c_uint,
        free_space: *mut ::core::ffi::c_uint,
    ) -> ::core::ffi::c_uint;
}
unsafe extern "C" {
    #[doc = "Dequeue several objects from an RTS ring (multi-consumers safe).\n\n# Arguments\n\n* `r` -\nA pointer to the ring structure.\n* `obj_table` -\nA pointer to a table of void * pointers (objects) that will be filled.\n* `n` -\nThe number of objects to dequeue from the ring to the obj_table.\n* `available` -\nIf non-NULL, returns the number of remaining ring entries after the\ndequeue has finished.\n\n# Returns\n\nThe number of objects dequeued, either 0 or n"]
    #[link_name = "rte_ring_mc_rts_dequeue_bulk_w"]
    pub fn rte_ring_mc_rts_dequeue_bulk(
        r: *mut rte_ring,
        obj_table: *mut *mut ::core::ffi::c_void,
        n: ::core::ffi::c_uint,
        available: *mut ::core::ffi::c_uint,
    ) -> ::core::ffi::c_uint;
}
unsafe extern "C" {
    #[doc = "Enqueue several objects on the RTS ring (multi-producers safe).\n\n# Arguments\n\n* `r` -\nA pointer to the ring structure.\n* `obj_table` -\nA pointer to a table of void * pointers (objects).\n* `n` -\nThe number of objects to add in the ring from the obj_table.\n* `free_space` -\nif non-NULL, returns the amount of space in the ring after the\nenqueue operation has finished.\n\n# Returns\n\n- n: Actual number of objects enqueued."]
    #[link_name = "rte_ring_mp_rts_enqueue_burst_w"]
    pub fn rte_ring_mp_rts_enqueue_burst(
        r: *mut rte_ring,
        obj_table: *const *mut ::core::ffi::c_void,
        n: ::core::ffi::c_uint,
        free_space: *mut ::core::ffi::c_uint,
    ) -> ::core::ffi::c_uint;
}
unsafe extern "C" {
    #[doc = "Dequeue several objects from an RTS  ring (multi-consumers safe).\nWhen the requested objects are more than the available objects,\nonly dequeue the actual number of objects.\n\n# Arguments\n\n* `r` -\nA pointer to the ring structure.\n* `obj_table` -\nA pointer to a table of void * pointers (objects) that will be filled.\n* `n` -\nThe number of objects to dequeue from the ring to the obj_table.\n* `available` -\nIf non-NULL, returns the number of remaining ring entries after the\ndequeue has finished.\n\n# Returns\n\n- n: Actual number of objects dequeued, 0 if ring is empty"]
    #[link_name = "rte_ring_mc_rts_dequeue_burst_w"]
    pub fn rte_ring_mc_rts_dequeue_burst(
        r: *mut rte_ring,
        obj_table: *mut *mut ::core::ffi::c_void,
        n: ::core::ffi::c_uint,
        available: *mut ::core::ffi::c_uint,
    ) -> ::core::ffi::c_uint;
}
unsafe extern "C" {
    #[doc = "Return producer max Head-Tail-Distance (HTD).\n\n# Arguments\n\n* `r` -\nA pointer to the ring structure.\n\n# Returns\n\nProducer HTD value, if producer is set in appropriate sync mode,\nor UINT32_MAX otherwise."]
    #[link_name = "rte_ring_get_prod_htd_max_w"]
    pub fn rte_ring_get_prod_htd_max(r: *const rte_ring) -> u32;
}
unsafe extern "C" {
    #[doc = "Set producer max Head-Tail-Distance (HTD).\nNote that producer has to use appropriate sync mode (RTS).\n\n# Arguments\n\n* `r` -\nA pointer to the ring structure.\n* `v` -\nnew HTD value to setup.\n\n# Returns\n\nZero on success, or negative error code otherwise."]
    #[link_name = "rte_ring_set_prod_htd_max_w"]
    pub fn rte_ring_set_prod_htd_max(r: *mut rte_ring, v: u32) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    #[doc = "Return consumer max Head-Tail-Distance (HTD).\n\n# Arguments\n\n* `r` -\nA pointer to the ring structure.\n\n# Returns\n\nConsumer HTD value, if consumer is set in appropriate sync mode,\nor UINT32_MAX otherwise."]
    #[link_name = "rte_ring_get_cons_htd_max_w"]
    pub fn rte_ring_get_cons_htd_max(r: *const rte_ring) -> u32;
}
unsafe extern "C" {
    #[doc = "Set consumer max Head-Tail-Distance (HTD).\nNote that consumer has to use appropriate sync mode (RTS).\n\n# Arguments\n\n* `r` -\nA pointer to the ring structure.\n* `v` -\nnew HTD value to setup.\n\n# Returns\n\nZero on success, or negative error code otherwise."]
    #[link_name = "rte_ring_set_cons_htd_max_w"]
    pub fn rte_ring_set_cons_htd_max(r: *mut rte_ring, v: u32) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    #[doc = "Enqueue several objects on a ring.\nThis function calls the multi-producer or the single-producer\nversion depending on the default behavior that was specified at\nring creation time (see flags).\n\n# Arguments\n\n* `r` -\nA pointer to the ring structure.\n* `obj_table` -\nA pointer to a table of objects.\n* `esize` -\nThe size of ring element, in bytes. It must be a multiple of 4.\nThis must be the same value used while creating the ring. Otherwise\nthe results are undefined.\n* `n` -\nThe number of objects to add in the ring from the obj_table.\n* `free_space` -\nif non-NULL, returns the amount of space in the ring after the\nenqueue operation has finished.\n\n# Returns\n\nThe number of objects enqueued, either 0 or n"]
    #[link_name = "rte_ring_enqueue_bulk_elem_w"]
    pub fn rte_ring_enqueue_bulk_elem(
        r: *mut rte_ring,
        obj_table: *const ::core::ffi::c_void,
        esize: ::core::ffi::c_uint,
        n: ::core::ffi::c_uint,
        free_space: *mut ::core::ffi::c_uint,
    ) -> ::core::ffi::c_uint;
}
unsafe extern "C" {
    #[doc = "Enqueue one object on a ring (multi-producers safe).\nThis function uses a \"compare and set\" instruction to move the\nproducer index atomically.\n\n# Arguments\n\n* `r` -\nA pointer to the ring structure.\n* `obj` -\nA pointer to the object to be added.\n* `esize` -\nThe size of ring element, in bytes. It must be a multiple of 4.\nThis must be the same value used while creating the ring. Otherwise\nthe results are undefined.\n\n# Returns\n\n- 0: Success; objects enqueued.\n- -ENOBUFS: Not enough room in the ring to enqueue; no object is enqueued."]
    #[link_name = "rte_ring_mp_enqueue_elem_w"]
    pub fn rte_ring_mp_enqueue_elem(
        r: *mut rte_ring,
        obj: *mut ::core::ffi::c_void,
        esize: ::core::ffi::c_uint,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    #[doc = "Enqueue one object on a ring\n@warning This API is NOT multi-producers safe\n\n# Arguments\n\n* `r` -\nA pointer to the ring structure.\n* `obj` -\nA pointer to the object to be added.\n* `esize` -\nThe size of ring element, in bytes. It must be a multiple of 4.\nThis must be the same value used while creating the ring. Otherwise\nthe results are undefined.\n\n# Returns\n\n- 0: Success; objects enqueued.\n- -ENOBUFS: Not enough room in the ring to enqueue; no object is enqueued."]
    #[link_name = "rte_ring_sp_enqueue_elem_w"]
    pub fn rte_ring_sp_enqueue_elem(
        r: *mut rte_ring,
        obj: *mut ::core::ffi::c_void,
        esize: ::core::ffi::c_uint,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    #[doc = "Enqueue one object on a ring.\nThis function calls the multi-producer or the single-producer\nversion, depending on the default behaviour that was specified at\nring creation time (see flags).\n\n# Arguments\n\n* `r` -\nA pointer to the ring structure.\n* `obj` -\nA pointer to the object to be added.\n* `esize` -\nThe size of ring element, in bytes. It must be a multiple of 4.\nThis must be the same value used while creating the ring. Otherwise\nthe results are undefined.\n\n# Returns\n\n- 0: Success; objects enqueued.\n- -ENOBUFS: Not enough room in the ring to enqueue; no object is enqueued."]
    #[link_name = "rte_ring_enqueue_elem_w"]
    pub fn rte_ring_enqueue_elem(
        r: *mut rte_ring,
        obj: *mut ::core::ffi::c_void,
        esize: ::core::ffi::c_uint,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    #[doc = "Dequeue several objects from a ring (multi-consumers safe).\nThis function uses a \"compare and set\" instruction to move the\nconsumer index atomically.\n\n# Arguments\n\n* `r` -\nA pointer to the ring structure.\n* `obj_table` -\nA pointer to a table of objects that will be filled.\n* `esize` -\nThe size of ring element, in bytes. It must be a multiple of 4.\nThis must be the same value used while creating the ring. Otherwise\nthe results are undefined.\n* `n` -\nThe number of objects to dequeue from the ring to the obj_table.\n* `available` -\nIf non-NULL, returns the number of remaining ring entries after the\ndequeue has finished.\n\n# Returns\n\nThe number of objects dequeued, either 0 or n"]
    #[link_name = "rte_ring_mc_dequeue_bulk_elem_w"]
    pub fn rte_ring_mc_dequeue_bulk_elem(
        r: *mut rte_ring,
        obj_table: *mut ::core::ffi::c_void,
        esize: ::core::ffi::c_uint,
        n: ::core::ffi::c_uint,
        available: *mut ::core::ffi::c_uint,
    ) -> ::core::ffi::c_uint;
}
unsafe extern "C" {
    #[doc = "Dequeue several objects from a ring (NOT multi-consumers safe).\n\n# Arguments\n\n* `r` -\nA pointer to the ring structure.\n* `obj_table` -\nA pointer to a table of objects that will be filled.\n* `esize` -\nThe size of ring element, in bytes. It must be a multiple of 4.\nThis must be the same value used while creating the ring. Otherwise\nthe results are undefined.\n* `n` -\nThe number of objects to dequeue from the ring to the obj_table,\nmust be strictly positive.\n* `available` -\nIf non-NULL, returns the number of remaining ring entries after the\ndequeue has finished.\n\n# Returns\n\nThe number of objects dequeued, either 0 or n"]
    #[link_name = "rte_ring_sc_dequeue_bulk_elem_w"]
    pub fn rte_ring_sc_dequeue_bulk_elem(
        r: *mut rte_ring,
        obj_table: *mut ::core::ffi::c_void,
        esize: ::core::ffi::c_uint,
        n: ::core::ffi::c_uint,
        available: *mut ::core::ffi::c_uint,
    ) -> ::core::ffi::c_uint;
}
unsafe extern "C" {
    #[doc = "Dequeue several objects from a ring.\nThis function calls the multi-consumers or the single-consumer\nversion, depending on the default behaviour that was specified at\nring creation time (see flags).\n\n# Arguments\n\n* `r` -\nA pointer to the ring structure.\n* `obj_table` -\nA pointer to a table of objects that will be filled.\n* `esize` -\nThe size of ring element, in bytes. It must be a multiple of 4.\nThis must be the same value used while creating the ring. Otherwise\nthe results are undefined.\n* `n` -\nThe number of objects to dequeue from the ring to the obj_table.\n* `available` -\nIf non-NULL, returns the number of remaining ring entries after the\ndequeue has finished.\n\n# Returns\n\nThe number of objects dequeued, either 0 or n"]
    #[link_name = "rte_ring_dequeue_bulk_elem_w"]
    pub fn rte_ring_dequeue_bulk_elem(
        r: *mut rte_ring,
        obj_table: *mut ::core::ffi::c_void,
        esize: ::core::ffi::c_uint,
        n: ::core::ffi::c_uint,
        available: *mut ::core::ffi::c_uint,
    ) -> ::core::ffi::c_uint;
}
unsafe extern "C" {
    #[doc = "Dequeue one object from a ring (multi-consumers safe).\nThis function uses a \"compare and set\" instruction to move the\nconsumer index atomically.\n\n# Arguments\n\n* `r` -\nA pointer to the ring structure.\n* `obj_p` -\nA pointer to the object that will be filled.\n* `esize` -\nThe size of ring element, in bytes. It must be a multiple of 4.\nThis must be the same value used while creating the ring. Otherwise\nthe results are undefined.\n\n# Returns\n\n- 0: Success; objects dequeued.\n- -ENOENT: Not enough entries in the ring to dequeue; no object is\ndequeued."]
    #[link_name = "rte_ring_mc_dequeue_elem_w"]
    pub fn rte_ring_mc_dequeue_elem(
        r: *mut rte_ring,
        obj_p: *mut ::core::ffi::c_void,
        esize: ::core::ffi::c_uint,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    #[doc = "Dequeue one object from a ring (NOT multi-consumers safe).\n\n# Arguments\n\n* `r` -\nA pointer to the ring structure.\n* `obj_p` -\nA pointer to the object that will be filled.\n* `esize` -\nThe size of ring element, in bytes. It must be a multiple of 4.\nThis must be the same value used while creating the ring. Otherwise\nthe results are undefined.\n\n# Returns\n\n- 0: Success; objects dequeued.\n- -ENOENT: Not enough entries in the ring to dequeue, no object is\ndequeued."]
    #[link_name = "rte_ring_sc_dequeue_elem_w"]
    pub fn rte_ring_sc_dequeue_elem(
        r: *mut rte_ring,
        obj_p: *mut ::core::ffi::c_void,
        esize: ::core::ffi::c_uint,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    #[doc = "Dequeue one object from a ring.\nThis function calls the multi-consumers or the single-consumer\nversion depending on the default behaviour that was specified at\nring creation time (see flags).\n\n# Arguments\n\n* `r` -\nA pointer to the ring structure.\n* `obj_p` -\nA pointer to the object that will be filled.\n* `esize` -\nThe size of ring element, in bytes. It must be a multiple of 4.\nThis must be the same value used while creating the ring. Otherwise\nthe results are undefined.\n\n# Returns\n\n- 0: Success, objects dequeued.\n- -ENOENT: Not enough entries in the ring to dequeue, no object is\ndequeued."]
    #[link_name = "rte_ring_dequeue_elem_w"]
    pub fn rte_ring_dequeue_elem(
        r: *mut rte_ring,
        obj_p: *mut ::core::ffi::c_void,
        esize: ::core::ffi::c_uint,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    #[doc = "Enqueue several objects on the ring (multi-producers safe).\nThis function uses a \"compare and set\" instruction to move the\nproducer index atomically.\n\n# Arguments\n\n* `r` -\nA pointer to the ring structure.\n* `obj_table` -\nA pointer to a table of objects.\n* `esize` -\nThe size of ring element, in bytes. It must be a multiple of 4.\nThis must be the same value used while creating the ring. Otherwise\nthe results are undefined.\n* `n` -\nThe number of objects to add in the ring from the obj_table.\n* `free_space` -\nif non-NULL, returns the amount of space in the ring after the\nenqueue operation has finished.\n\n# Returns\n\n- n: Actual number of objects enqueued."]
    #[link_name = "rte_ring_mp_enqueue_burst_elem_w"]
    pub fn rte_ring_mp_enqueue_burst_elem(
        r: *mut rte_ring,
        obj_table: *const ::core::ffi::c_void,
        esize: ::core::ffi::c_uint,
        n: ::core::ffi::c_uint,
        free_space: *mut ::core::ffi::c_uint,
    ) -> ::core::ffi::c_uint;
}
unsafe extern "C" {
    #[doc = "Enqueue several objects on a ring\n@warning This API is NOT multi-producers safe\n\n# Arguments\n\n* `r` -\nA pointer to the ring structure.\n* `obj_table` -\nA pointer to a table of objects.\n* `esize` -\nThe size of ring element, in bytes. It must be a multiple of 4.\nThis must be the same value used while creating the ring. Otherwise\nthe results are undefined.\n* `n` -\nThe number of objects to add in the ring from the obj_table.\n* `free_space` -\nif non-NULL, returns the amount of space in the ring after the\nenqueue operation has finished.\n\n# Returns\n\n- n: Actual number of objects enqueued."]
    #[link_name = "rte_ring_sp_enqueue_burst_elem_w"]
    pub fn rte_ring_sp_enqueue_burst_elem(
        r: *mut rte_ring,
        obj_table: *const ::core::ffi::c_void,
        esize: ::core::ffi::c_uint,
        n: ::core::ffi::c_uint,
        free_space: *mut ::core::ffi::c_uint,
    ) -> ::core::ffi::c_uint;
}
unsafe extern "C" {
    #[doc = "Enqueue several objects on a ring.\nThis function calls the multi-producer or the single-producer\nversion depending on the default behavior that was specified at\nring creation time (see flags).\n\n# Arguments\n\n* `r` -\nA pointer to the ring structure.\n* `obj_table` -\nA pointer to a table of objects.\n* `esize` -\nThe size of ring element, in bytes. It must be a multiple of 4.\nThis must be the same value used while creating the ring. Otherwise\nthe results are undefined.\n* `n` -\nThe number of objects to add in the ring from the obj_table.\n* `free_space` -\nif non-NULL, returns the amount of space in the ring after the\nenqueue operation has finished.\n\n# Returns\n\n- n: Actual number of objects enqueued."]
    #[link_name = "rte_ring_enqueue_burst_elem_w"]
    pub fn rte_ring_enqueue_burst_elem(
        r: *mut rte_ring,
        obj_table: *const ::core::ffi::c_void,
        esize: ::core::ffi::c_uint,
        n: ::core::ffi::c_uint,
        free_space: *mut ::core::ffi::c_uint,
    ) -> ::core::ffi::c_uint;
}
unsafe extern "C" {
    #[doc = "Dequeue several objects from a ring (multi-consumers safe). When the request\nobjects are more than the available objects, only dequeue the actual number\nof objects\nThis function uses a \"compare and set\" instruction to move the\nconsumer index atomically.\n\n# Arguments\n\n* `r` -\nA pointer to the ring structure.\n* `obj_table` -\nA pointer to a table of objects that will be filled.\n* `esize` -\nThe size of ring element, in bytes. It must be a multiple of 4.\nThis must be the same value used while creating the ring. Otherwise\nthe results are undefined.\n* `n` -\nThe number of objects to dequeue from the ring to the obj_table.\n* `available` -\nIf non-NULL, returns the number of remaining ring entries after the\ndequeue has finished.\n\n# Returns\n\n- n: Actual number of objects dequeued, 0 if ring is empty"]
    #[link_name = "rte_ring_mc_dequeue_burst_elem_w"]
    pub fn rte_ring_mc_dequeue_burst_elem(
        r: *mut rte_ring,
        obj_table: *mut ::core::ffi::c_void,
        esize: ::core::ffi::c_uint,
        n: ::core::ffi::c_uint,
        available: *mut ::core::ffi::c_uint,
    ) -> ::core::ffi::c_uint;
}
unsafe extern "C" {
    #[doc = "Dequeue several objects from a ring (NOT multi-consumers safe).When the\nrequest objects are more than the available objects, only dequeue the\nactual number of objects\n\n# Arguments\n\n* `r` -\nA pointer to the ring structure.\n* `obj_table` -\nA pointer to a table of objects that will be filled.\n* `esize` -\nThe size of ring element, in bytes. It must be a multiple of 4.\nThis must be the same value used while creating the ring. Otherwise\nthe results are undefined.\n* `n` -\nThe number of objects to dequeue from the ring to the obj_table.\n* `available` -\nIf non-NULL, returns the number of remaining ring entries after the\ndequeue has finished.\n\n# Returns\n\n- n: Actual number of objects dequeued, 0 if ring is empty"]
    #[link_name = "rte_ring_sc_dequeue_burst_elem_w"]
    pub fn rte_ring_sc_dequeue_burst_elem(
        r: *mut rte_ring,
        obj_table: *mut ::core::ffi::c_void,
        esize: ::core::ffi::c_uint,
        n: ::core::ffi::c_uint,
        available: *mut ::core::ffi::c_uint,
    ) -> ::core::ffi::c_uint;
}
unsafe extern "C" {
    #[doc = "Dequeue multiple objects from a ring up to a maximum number.\nThis function calls the multi-consumers or the single-consumer\nversion, depending on the default behaviour that was specified at\nring creation time (see flags).\n\n# Arguments\n\n* `r` -\nA pointer to the ring structure.\n* `obj_table` -\nA pointer to a table of objects that will be filled.\n* `esize` -\nThe size of ring element, in bytes. It must be a multiple of 4.\nThis must be the same value used while creating the ring. Otherwise\nthe results are undefined.\n* `n` -\nThe number of objects to dequeue from the ring to the obj_table.\n* `available` -\nIf non-NULL, returns the number of remaining ring entries after the\ndequeue has finished.\n\n# Returns\n\n- Number of objects dequeued"]
    #[link_name = "rte_ring_dequeue_burst_elem_w"]
    pub fn rte_ring_dequeue_burst_elem(
        r: *mut rte_ring,
        obj_table: *mut ::core::ffi::c_void,
        esize: ::core::ffi::c_uint,
        n: ::core::ffi::c_uint,
        available: *mut ::core::ffi::c_uint,
    ) -> ::core::ffi::c_uint;
}
unsafe extern "C" {
    #[doc = "Start to enqueue several objects on the ring.\nNote that no actual objects are put in the queue by this function,\nit just reserves for user such ability.\nUser has to call appropriate enqueue_elem_finish() to copy objects into the\nqueue and complete given enqueue operation.\n\n# Arguments\n\n* `r` -\nA pointer to the ring structure.\n* `n` -\nThe number of objects to add in the ring from the obj_table.\n* `free_space` -\nif non-NULL, returns the amount of space in the ring after the\nenqueue operation has finished.\n\n# Returns\n\nThe number of objects that can be enqueued, either 0 or n"]
    #[link_name = "rte_ring_enqueue_bulk_elem_start_w"]
    pub fn rte_ring_enqueue_bulk_elem_start(
        r: *mut rte_ring,
        n: ::core::ffi::c_uint,
        free_space: *mut ::core::ffi::c_uint,
    ) -> ::core::ffi::c_uint;
}
unsafe extern "C" {
    #[doc = "Start to enqueue several objects on the ring.\nNote that no actual objects are put in the queue by this function,\nit just reserves for user such ability.\nUser has to call appropriate enqueue_finish() to copy objects into the\nqueue and complete given enqueue operation.\n\n# Arguments\n\n* `r` -\nA pointer to the ring structure.\n* `n` -\nThe number of objects to add in the ring from the obj_table.\n* `free_space` -\nif non-NULL, returns the amount of space in the ring after the\nenqueue operation has finished.\n\n# Returns\n\nThe number of objects that can be enqueued, either 0 or n"]
    #[link_name = "rte_ring_enqueue_bulk_start_w"]
    pub fn rte_ring_enqueue_bulk_start(
        r: *mut rte_ring,
        n: ::core::ffi::c_uint,
        free_space: *mut ::core::ffi::c_uint,
    ) -> ::core::ffi::c_uint;
}
unsafe extern "C" {
    #[doc = "Start to enqueue several objects on the ring.\nNote that no actual objects are put in the queue by this function,\nit just reserves for user such ability.\nUser has to call appropriate enqueue_elem_finish() to copy objects into the\nqueue and complete given enqueue operation.\n\n# Arguments\n\n* `r` -\nA pointer to the ring structure.\n* `n` -\nThe number of objects to add in the ring from the obj_table.\n* `free_space` -\nif non-NULL, returns the amount of space in the ring after the\nenqueue operation has finished.\n\n# Returns\n\nActual number of objects that can be enqueued."]
    #[link_name = "rte_ring_enqueue_burst_elem_start_w"]
    pub fn rte_ring_enqueue_burst_elem_start(
        r: *mut rte_ring,
        n: ::core::ffi::c_uint,
        free_space: *mut ::core::ffi::c_uint,
    ) -> ::core::ffi::c_uint;
}
unsafe extern "C" {
    #[doc = "Start to enqueue several objects on the ring.\nNote that no actual objects are put in the queue by this function,\nit just reserves for user such ability.\nUser has to call appropriate enqueue_finish() to copy objects into the\nqueue and complete given enqueue operation.\n\n# Arguments\n\n* `r` -\nA pointer to the ring structure.\n* `n` -\nThe number of objects to add in the ring from the obj_table.\n* `free_space` -\nif non-NULL, returns the amount of space in the ring after the\nenqueue operation has finished.\n\n# Returns\n\nActual number of objects that can be enqueued."]
    #[link_name = "rte_ring_enqueue_burst_start_w"]
    pub fn rte_ring_enqueue_burst_start(
        r: *mut rte_ring,
        n: ::core::ffi::c_uint,
        free_space: *mut ::core::ffi::c_uint,
    ) -> ::core::ffi::c_uint;
}
unsafe extern "C" {
    #[doc = "Complete to enqueue several objects on the ring.\nNote that number of objects to enqueue should not exceed previous\nenqueue_start return value.\n\n# Arguments\n\n* `r` -\nA pointer to the ring structure.\n* `obj_table` -\nA pointer to a table of objects.\n* `esize` -\nThe size of ring element, in bytes. It must be a multiple of 4.\nThis must be the same value used while creating the ring. Otherwise\nthe results are undefined.\n* `n` -\nThe number of objects to add to the ring from the obj_table."]
    #[link_name = "rte_ring_enqueue_elem_finish_w"]
    pub fn rte_ring_enqueue_elem_finish(
        r: *mut rte_ring,
        obj_table: *const ::core::ffi::c_void,
        esize: ::core::ffi::c_uint,
        n: ::core::ffi::c_uint,
    );
}
unsafe extern "C" {
    #[doc = "Complete to enqueue several objects on the ring.\nNote that number of objects to enqueue should not exceed previous\nenqueue_start return value.\n\n# Arguments\n\n* `r` -\nA pointer to the ring structure.\n* `obj_table` -\nA pointer to a table of objects.\n* `n` -\nThe number of objects to add to the ring from the obj_table."]
    #[link_name = "rte_ring_enqueue_finish_w"]
    pub fn rte_ring_enqueue_finish(
        r: *mut rte_ring,
        obj_table: *const *mut ::core::ffi::c_void,
        n: ::core::ffi::c_uint,
    );
}
unsafe extern "C" {
    #[doc = "Start to dequeue several objects from the ring.\nNote that user has to call appropriate dequeue_finish()\nto complete given dequeue operation and actually remove objects the ring.\n\n# Arguments\n\n* `r` -\nA pointer to the ring structure.\n* `obj_table` -\nA pointer to a table of objects that will be filled.\n* `esize` -\nThe size of ring element, in bytes. It must be a multiple of 4.\nThis must be the same value used while creating the ring. Otherwise\nthe results are undefined.\n* `n` -\nThe number of objects to dequeue from the ring to the obj_table.\n* `available` -\nIf non-NULL, returns the number of remaining ring entries after the\ndequeue has finished.\n\n# Returns\n\nThe number of objects dequeued, either 0 or n."]
    #[link_name = "rte_ring_dequeue_bulk_elem_start_w"]
    pub fn rte_ring_dequeue_bulk_elem_start(
        r: *mut rte_ring,
        obj_table: *mut ::core::ffi::c_void,
        esize: ::core::ffi::c_uint,
        n: ::core::ffi::c_uint,
        available: *mut ::core::ffi::c_uint,
    ) -> ::core::ffi::c_uint;
}
unsafe extern "C" {
    #[doc = "Start to dequeue several objects from the ring.\nNote that user has to call appropriate dequeue_finish()\nto complete given dequeue operation and actually remove objects the ring.\n\n# Arguments\n\n* `r` -\nA pointer to the ring structure.\n* `obj_table` -\nA pointer to a table of void * pointers (objects) that will be filled.\n* `n` -\nThe number of objects to dequeue from the ring to the obj_table.\n* `available` -\nIf non-NULL, returns the number of remaining ring entries after the\ndequeue has finished.\n\n# Returns\n\nActual number of objects dequeued."]
    #[link_name = "rte_ring_dequeue_bulk_start_w"]
    pub fn rte_ring_dequeue_bulk_start(
        r: *mut rte_ring,
        obj_table: *mut *mut ::core::ffi::c_void,
        n: ::core::ffi::c_uint,
        available: *mut ::core::ffi::c_uint,
    ) -> ::core::ffi::c_uint;
}
unsafe extern "C" {
    #[doc = "Start to dequeue several objects from the ring.\nNote that user has to call appropriate dequeue_finish()\nto complete given dequeue operation and actually remove objects the ring.\n\n# Arguments\n\n* `r` -\nA pointer to the ring structure.\n* `obj_table` -\nA pointer to a table of objects that will be filled.\n* `esize` -\nThe size of ring element, in bytes. It must be a multiple of 4.\nThis must be the same value used while creating the ring. Otherwise\nthe results are undefined.\n* `n` -\nThe number of objects to dequeue from the ring to the obj_table.\n* `available` -\nIf non-NULL, returns the number of remaining ring entries after the\ndequeue has finished.\n\n# Returns\n\nThe actual number of objects dequeued."]
    #[link_name = "rte_ring_dequeue_burst_elem_start_w"]
    pub fn rte_ring_dequeue_burst_elem_start(
        r: *mut rte_ring,
        obj_table: *mut ::core::ffi::c_void,
        esize: ::core::ffi::c_uint,
        n: ::core::ffi::c_uint,
        available: *mut ::core::ffi::c_uint,
    ) -> ::core::ffi::c_uint;
}
unsafe extern "C" {
    #[doc = "Start to dequeue several objects from the ring.\nNote that user has to call appropriate dequeue_finish()\nto complete given dequeue operation and actually remove objects the ring.\n\n# Arguments\n\n* `r` -\nA pointer to the ring structure.\n* `obj_table` -\nA pointer to a table of void * pointers (objects) that will be filled.\n* `n` -\nThe number of objects to dequeue from the ring to the obj_table.\n* `available` -\nIf non-NULL, returns the number of remaining ring entries after the\ndequeue has finished.\n\n# Returns\n\nThe actual number of objects dequeued."]
    #[link_name = "rte_ring_dequeue_burst_start_w"]
    pub fn rte_ring_dequeue_burst_start(
        r: *mut rte_ring,
        obj_table: *mut *mut ::core::ffi::c_void,
        n: ::core::ffi::c_uint,
        available: *mut ::core::ffi::c_uint,
    ) -> ::core::ffi::c_uint;
}
unsafe extern "C" {
    #[doc = "Complete to dequeue several objects from the ring.\nNote that number of objects to dequeue should not exceed previous\ndequeue_start return value.\n\n# Arguments\n\n* `r` -\nA pointer to the ring structure.\n* `n` -\nThe number of objects to remove from the ring."]
    #[link_name = "rte_ring_dequeue_elem_finish_w"]
    pub fn rte_ring_dequeue_elem_finish(r: *mut rte_ring, n: ::core::ffi::c_uint);
}
unsafe extern "C" {
    #[doc = "Complete to dequeue several objects from the ring.\nNote that number of objects to dequeue should not exceed previous\ndequeue_start return value.\n\n# Arguments\n\n* `r` -\nA pointer to the ring structure.\n* `n` -\nThe number of objects to remove from the ring."]
    #[link_name = "rte_ring_dequeue_finish_w"]
    pub fn rte_ring_dequeue_finish(r: *mut rte_ring, n: ::core::ffi::c_uint);
}
#[doc = "Ring zero-copy information structure.\nThis structure contains the pointers and length of the space\nreserved on the ring storage."]
#[repr(C)]
#[repr(align(64))]
#[derive(Debug, Copy, Clone)]
pub struct rte_ring_zc_data {
    #[doc = "Pointer to the first space in the ring"]
    pub ptr1: *mut ::core::ffi::c_void,
    #[doc = "Pointer to the second space in the ring if there is wrap-around.\nIt contains valid value only if wrap-around happens."]
    pub ptr2: *mut ::core::ffi::c_void,
    #[doc = "Number of elements in the first pointer. If this is equal to\nthe number of elements requested, then ptr2 is NULL.\nOtherwise, subtracting n1 from number of elements requested\nwill give the number of elements available at ptr2."]
    pub n1: ::core::ffi::c_uint,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of rte_ring_zc_data"][::core::mem::size_of::<rte_ring_zc_data>() - 64usize];
    ["Alignment of rte_ring_zc_data"][::core::mem::align_of::<rte_ring_zc_data>() - 64usize];
    ["Offset of field: rte_ring_zc_data::ptr1"]
        [::core::mem::offset_of!(rte_ring_zc_data, ptr1) - 0usize];
    ["Offset of field: rte_ring_zc_data::ptr2"]
        [::core::mem::offset_of!(rte_ring_zc_data, ptr2) - 8usize];
    ["Offset of field: rte_ring_zc_data::n1"]
        [::core::mem::offset_of!(rte_ring_zc_data, n1) - 16usize];
};
impl Default for rte_ring_zc_data {
    fn default() -> Self {
        let mut s = ::core::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::core::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
unsafe extern "C" {
    #[doc = "Start to enqueue several objects on the ring.\nNote that no actual objects are put in the queue by this function,\nit just reserves space for the user on the ring.\nUser has to copy objects into the queue using the returned pointers.\nUser should call rte_ring_enqueue_zc_elem_finish to complete the\nenqueue operation.\n\n# Arguments\n\n* `r` -\nA pointer to the ring structure.\n* `esize` -\nThe size of ring element, in bytes. It must be a multiple of 4.\n* `n` -\nThe number of objects to add in the ring.\n* `zcd` -\nStructure containing the pointers and length of the space\nreserved on the ring storage.\n* `free_space` -\nIf non-NULL, returns the amount of space in the ring after the\nreservation operation has finished.\n\n# Returns\n\nThe number of objects that can be enqueued, either 0 or n"]
    #[link_name = "rte_ring_enqueue_zc_bulk_elem_start_w"]
    pub fn rte_ring_enqueue_zc_bulk_elem_start(
        r: *mut rte_ring,
        esize: ::core::ffi::c_uint,
        n: ::core::ffi::c_uint,
        zcd: *mut rte_ring_zc_data,
        free_space: *mut ::core::ffi::c_uint,
    ) -> ::core::ffi::c_uint;
}
unsafe extern "C" {
    #[doc = "Start to enqueue several pointers to objects on the ring.\nNote that no actual pointers are put in the queue by this function,\nit just reserves space for the user on the ring.\nUser has to copy pointers to objects into the queue using the\nreturned pointers.\nUser should call rte_ring_enqueue_zc_finish to complete the\nenqueue operation.\n\n# Arguments\n\n* `r` -\nA pointer to the ring structure.\n* `n` -\nThe number of objects to add in the ring.\n* `zcd` -\nStructure containing the pointers and length of the space\nreserved on the ring storage.\n* `free_space` -\nIf non-NULL, returns the amount of space in the ring after the\nreservation operation has finished.\n\n# Returns\n\nThe number of objects that can be enqueued, either 0 or n"]
    #[link_name = "rte_ring_enqueue_zc_bulk_start_w"]
    pub fn rte_ring_enqueue_zc_bulk_start(
        r: *mut rte_ring,
        n: ::core::ffi::c_uint,
        zcd: *mut rte_ring_zc_data,
        free_space: *mut ::core::ffi::c_uint,
    ) -> ::core::ffi::c_uint;
}
unsafe extern "C" {
    #[doc = "Start to enqueue several objects on the ring.\nNote that no actual objects are put in the queue by this function,\nit just reserves space for the user on the ring.\nUser has to copy objects into the queue using the returned pointers.\nUser should call rte_ring_enqueue_zc_elem_finish to complete the\nenqueue operation.\n\n# Arguments\n\n* `r` -\nA pointer to the ring structure.\n* `esize` -\nThe size of ring element, in bytes. It must be a multiple of 4.\n* `n` -\nThe number of objects to add in the ring.\n* `zcd` -\nStructure containing the pointers and length of the space\nreserved on the ring storage.\n* `free_space` -\nIf non-NULL, returns the amount of space in the ring after the\nreservation operation has finished.\n\n# Returns\n\nThe number of objects that can be enqueued, either 0 or n"]
    #[link_name = "rte_ring_enqueue_zc_burst_elem_start_w"]
    pub fn rte_ring_enqueue_zc_burst_elem_start(
        r: *mut rte_ring,
        esize: ::core::ffi::c_uint,
        n: ::core::ffi::c_uint,
        zcd: *mut rte_ring_zc_data,
        free_space: *mut ::core::ffi::c_uint,
    ) -> ::core::ffi::c_uint;
}
unsafe extern "C" {
    #[doc = "Start to enqueue several pointers to objects on the ring.\nNote that no actual pointers are put in the queue by this function,\nit just reserves space for the user on the ring.\nUser has to copy pointers to objects into the queue using the\nreturned pointers.\nUser should call rte_ring_enqueue_zc_finish to complete the\nenqueue operation.\n\n# Arguments\n\n* `r` -\nA pointer to the ring structure.\n* `n` -\nThe number of objects to add in the ring.\n* `zcd` -\nStructure containing the pointers and length of the space\nreserved on the ring storage.\n* `free_space` -\nIf non-NULL, returns the amount of space in the ring after the\nreservation operation has finished.\n\n# Returns\n\nThe number of objects that can be enqueued, either 0 or n."]
    #[link_name = "rte_ring_enqueue_zc_burst_start_w"]
    pub fn rte_ring_enqueue_zc_burst_start(
        r: *mut rte_ring,
        n: ::core::ffi::c_uint,
        zcd: *mut rte_ring_zc_data,
        free_space: *mut ::core::ffi::c_uint,
    ) -> ::core::ffi::c_uint;
}
unsafe extern "C" {
    #[doc = "Complete enqueuing several objects on the ring.\nNote that number of objects to enqueue should not exceed previous\nenqueue_start return value.\n\n# Arguments\n\n* `r` -\nA pointer to the ring structure.\n* `n` -\nThe number of objects to add to the ring."]
    #[link_name = "rte_ring_enqueue_zc_elem_finish_w"]
    pub fn rte_ring_enqueue_zc_elem_finish(r: *mut rte_ring, n: ::core::ffi::c_uint);
}
unsafe extern "C" {
    #[doc = "Complete enqueuing several pointers to objects on the ring.\nNote that number of objects to enqueue should not exceed previous\nenqueue_start return value.\n\n# Arguments\n\n* `r` -\nA pointer to the ring structure.\n* `n` -\nThe number of pointers to objects to add to the ring."]
    #[link_name = "rte_ring_enqueue_zc_finish_w"]
    pub fn rte_ring_enqueue_zc_finish(r: *mut rte_ring, n: ::core::ffi::c_uint);
}
unsafe extern "C" {
    #[doc = "Start to dequeue several objects from the ring.\nNote that no actual objects are copied from the queue by this function.\nUser has to copy objects from the queue using the returned pointers.\nUser should call rte_ring_dequeue_zc_elem_finish to complete the\ndequeue operation.\n\n# Arguments\n\n* `r` -\nA pointer to the ring structure.\n* `esize` -\nThe size of ring element, in bytes. It must be a multiple of 4.\n* `n` -\nThe number of objects to remove from the ring.\n* `zcd` -\nStructure containing the pointers and length of the space\nreserved on the ring storage.\n* `available` -\nIf non-NULL, returns the number of remaining ring entries after the\ndequeue has finished.\n\n# Returns\n\nThe number of objects that can be dequeued, either 0 or n."]
    #[link_name = "rte_ring_dequeue_zc_bulk_elem_start_w"]
    pub fn rte_ring_dequeue_zc_bulk_elem_start(
        r: *mut rte_ring,
        esize: ::core::ffi::c_uint,
        n: ::core::ffi::c_uint,
        zcd: *mut rte_ring_zc_data,
        available: *mut ::core::ffi::c_uint,
    ) -> ::core::ffi::c_uint;
}
unsafe extern "C" {
    #[doc = "Start to dequeue several pointers to objects from the ring.\nNote that no actual pointers are removed from the queue by this function.\nUser has to copy pointers to objects from the queue using the\nreturned pointers.\nUser should call rte_ring_dequeue_zc_finish to complete the\ndequeue operation.\n\n# Arguments\n\n* `r` -\nA pointer to the ring structure.\n* `n` -\nThe number of objects to remove from the ring.\n* `zcd` -\nStructure containing the pointers and length of the space\nreserved on the ring storage.\n* `available` -\nIf non-NULL, returns the number of remaining ring entries after the\ndequeue has finished.\n\n# Returns\n\nThe number of objects that can be dequeued, either 0 or n."]
    #[link_name = "rte_ring_dequeue_zc_bulk_start_w"]
    pub fn rte_ring_dequeue_zc_bulk_start(
        r: *mut rte_ring,
        n: ::core::ffi::c_uint,
        zcd: *mut rte_ring_zc_data,
        available: *mut ::core::ffi::c_uint,
    ) -> ::core::ffi::c_uint;
}
unsafe extern "C" {
    #[doc = "Start to dequeue several objects from the ring.\nNote that no actual objects are copied from the queue by this function.\nUser has to copy objects from the queue using the returned pointers.\nUser should call rte_ring_dequeue_zc_elem_finish to complete the\ndequeue operation.\n\n# Arguments\n\n* `r` -\nA pointer to the ring structure.\n* `esize` -\nThe size of ring element, in bytes. It must be a multiple of 4.\nThis must be the same value used while creating the ring. Otherwise\nthe results are undefined.\n* `n` -\nThe number of objects to dequeue from the ring.\n* `zcd` -\nStructure containing the pointers and length of the space\nreserved on the ring storage.\n* `available` -\nIf non-NULL, returns the number of remaining ring entries after the\ndequeue has finished.\n\n# Returns\n\nThe number of objects that can be dequeued, either 0 or n."]
    #[link_name = "rte_ring_dequeue_zc_burst_elem_start_w"]
    pub fn rte_ring_dequeue_zc_burst_elem_start(
        r: *mut rte_ring,
        esize: ::core::ffi::c_uint,
        n: ::core::ffi::c_uint,
        zcd: *mut rte_ring_zc_data,
        available: *mut ::core::ffi::c_uint,
    ) -> ::core::ffi::c_uint;
}
unsafe extern "C" {
    #[doc = "Start to dequeue several pointers to objects from the ring.\nNote that no actual pointers are removed from the queue by this function.\nUser has to copy pointers to objects from the queue using the\nreturned pointers.\nUser should call rte_ring_dequeue_zc_finish to complete the\ndequeue operation.\n\n# Arguments\n\n* `r` -\nA pointer to the ring structure.\n* `n` -\nThe number of objects to remove from the ring.\n* `zcd` -\nStructure containing the pointers and length of the space\nreserved on the ring storage.\n* `available` -\nIf non-NULL, returns the number of remaining ring entries after the\ndequeue has finished.\n\n# Returns\n\nThe number of objects that can be dequeued, either 0 or n."]
    #[link_name = "rte_ring_dequeue_zc_burst_start_w"]
    pub fn rte_ring_dequeue_zc_burst_start(
        r: *mut rte_ring,
        n: ::core::ffi::c_uint,
        zcd: *mut rte_ring_zc_data,
        available: *mut ::core::ffi::c_uint,
    ) -> ::core::ffi::c_uint;
}
unsafe extern "C" {
    #[doc = "Complete dequeuing several objects from the ring.\nNote that number of objects to dequeued should not exceed previous\ndequeue_start return value.\n\n# Arguments\n\n* `r` -\nA pointer to the ring structure.\n* `n` -\nThe number of objects to remove from the ring."]
    #[link_name = "rte_ring_dequeue_zc_elem_finish_w"]
    pub fn rte_ring_dequeue_zc_elem_finish(r: *mut rte_ring, n: ::core::ffi::c_uint);
}
unsafe extern "C" {
    #[doc = "Complete dequeuing several objects from the ring.\nNote that number of objects to dequeued should not exceed previous\ndequeue_start return value.\n\n# Arguments\n\n* `r` -\nA pointer to the ring structure.\n* `n` -\nThe number of objects to remove from the ring."]
    #[link_name = "rte_ring_dequeue_zc_finish_w"]
    pub fn rte_ring_dequeue_zc_finish(r: *mut rte_ring, n: ::core::ffi::c_uint);
}
unsafe extern "C" {
    #[doc = "Calculate the memory size needed for a ring\nThis function returns the number of bytes needed for a ring, given\nthe number of elements in it. This value is the sum of the size of\nthe structure rte_ring and the size of the memory needed by the\nobjects pointers. The value is aligned to a cache line size.\n\n# Arguments\n\n* `count` -\nThe number of elements in the ring (must be a power of 2).\n\n# Returns\n\n- The memory size needed for the ring on success.\n- -EINVAL if count is not a power of 2."]
    pub fn rte_ring_get_memsize(count: ::core::ffi::c_uint) -> isize;
}
unsafe extern "C" {
    #[doc = "Initialize a ring structure.\nInitialize a ring structure in memory pointed by \"r\". The size of the\nmemory area must be large enough to store the ring structure and the\nobject table. It is advised to use rte_ring_get_memsize() to get the\nappropriate size.\nThe ring size is set to *count*, which must be a power of two.\nThe real usable ring size is *count-1* instead of *count* to\ndifferentiate a full ring from an empty ring.\nThe ring is not added in RTE_TAILQ_RING global list. Indeed, the\nmemory given by the caller may not be shareable among dpdk\nprocesses.\n\n# Arguments\n\n* `r` -\nThe pointer to the ring structure followed by the objects table.\n* `name` -\nThe name of the ring.\n* `count` -\nThe number of elements in the ring (must be a power of 2,\nunless RING_F_EXACT_SZ is set in flags).\n* `flags` -\nAn OR of the following:\n- One of mutually exclusive flags that define producer behavior:\n- RING_F_SP_ENQ: If this flag is set, the default behavior when\nusing ``rte_ring_enqueue()`` or ``rte_ring_enqueue_bulk()``\nis \"single-producer\".\n- RING_F_MP_RTS_ENQ: If this flag is set, the default behavior when\nusing ``rte_ring_enqueue()`` or ``rte_ring_enqueue_bulk()``\nis \"multi-producer RTS mode\".\n- RING_F_MP_HTS_ENQ: If this flag is set, the default behavior when\nusing ``rte_ring_enqueue()`` or ``rte_ring_enqueue_bulk()``\nis \"multi-producer HTS mode\".\nIf none of these flags is set, then default \"multi-producer\"\nbehavior is selected.\n- One of mutually exclusive flags that define consumer behavior:\n- RING_F_SC_DEQ: If this flag is set, the default behavior when\nusing ``rte_ring_dequeue()`` or ``rte_ring_dequeue_bulk()``\nis \"single-consumer\". Otherwise, it is \"multi-consumers\".\n- RING_F_MC_RTS_DEQ: If this flag is set, the default behavior when\nusing ``rte_ring_dequeue()`` or ``rte_ring_dequeue_bulk()``\nis \"multi-consumer RTS mode\".\n- RING_F_MC_HTS_DEQ: If this flag is set, the default behavior when\nusing ``rte_ring_dequeue()`` or ``rte_ring_dequeue_bulk()``\nis \"multi-consumer HTS mode\".\nIf none of these flags is set, then default \"multi-consumer\"\nbehavior is selected.\n- RING_F_EXACT_SZ: If this flag is set, the ring will hold exactly the\nrequested number of entries, and the requested size will be rounded up\nto the next power of two, but the usable space will be exactly that\nrequested. Worst case, if a power-of-2 size is requested, half the\nring space will be wasted.\nWithout this flag set, the ring size requested must be a power of 2,\nand the usable space will be that size - 1.\n\n# Returns\n\n0 on success, or a negative value on error."]
    pub fn rte_ring_init(
        r: *mut rte_ring,
        name: *const ::core::ffi::c_char,
        count: ::core::ffi::c_uint,
        flags: ::core::ffi::c_uint,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    #[doc = "De-allocate all memory used by the ring.\n\n# Arguments\n\n* `r` -\nRing to free.\nIf NULL then, the function does nothing."]
    pub fn rte_ring_free(r: *mut rte_ring);
}
unsafe extern "C" {
    #[doc = "Create a new ring named *name* in memory.\nThis function uses ``memzone_reserve()`` to allocate memory. Then it\ncalls rte_ring_init() to initialize an empty ring.\nThe new ring size is set to *count*, which must be a power of two.\nThe real usable ring size is *count-1* instead of *count* to\ndifferentiate a full ring from an empty ring.\nThe ring is added in RTE_TAILQ_RING list.\n\n# Arguments\n\n* `name` -\nThe name of the ring.\n* `count` -\nThe size of the ring (must be a power of 2,\nunless RING_F_EXACT_SZ is set in flags).\n* `socket_id` -\nThe *socket_id* argument is the socket identifier in case of\nNUMA. The value can be *SOCKET_ID_ANY* if there is no NUMA\nconstraint for the reserved zone.\n* `flags` -\nAn OR of the following:\n- One of mutually exclusive flags that define producer behavior:\n- RING_F_SP_ENQ: If this flag is set, the default behavior when\nusing ``rte_ring_enqueue()`` or ``rte_ring_enqueue_bulk()``\nis \"single-producer\".\n- RING_F_MP_RTS_ENQ: If this flag is set, the default behavior when\nusing ``rte_ring_enqueue()`` or ``rte_ring_enqueue_bulk()``\nis \"multi-producer RTS mode\".\n- RING_F_MP_HTS_ENQ: If this flag is set, the default behavior when\nusing ``rte_ring_enqueue()`` or ``rte_ring_enqueue_bulk()``\nis \"multi-producer HTS mode\".\nIf none of these flags is set, then default \"multi-producer\"\nbehavior is selected.\n- One of mutually exclusive flags that define consumer behavior:\n- RING_F_SC_DEQ: If this flag is set, the default behavior when\nusing ``rte_ring_dequeue()`` or ``rte_ring_dequeue_bulk()``\nis \"single-consumer\". Otherwise, it is \"multi-consumers\".\n- RING_F_MC_RTS_DEQ: If this flag is set, the default behavior when\nusing ``rte_ring_dequeue()`` or ``rte_ring_dequeue_bulk()``\nis \"multi-consumer RTS mode\".\n- RING_F_MC_HTS_DEQ: If this flag is set, the default behavior when\nusing ``rte_ring_dequeue()`` or ``rte_ring_dequeue_bulk()``\nis \"multi-consumer HTS mode\".\nIf none of these flags is set, then default \"multi-consumer\"\nbehavior is selected.\n- RING_F_EXACT_SZ: If this flag is set, the ring will hold exactly the\nrequested number of entries, and the requested size will be rounded up\nto the next power of two, but the usable space will be exactly that\nrequested. Worst case, if a power-of-2 size is requested, half the\nring space will be wasted.\nWithout this flag set, the ring size requested must be a power of 2,\nand the usable space will be that size - 1.\n\n# Returns\n\nOn success, the pointer to the new allocated ring. NULL on error with\nrte_errno set appropriately. Possible errno values include:\n- E_RTE_NO_CONFIG - function could not get pointer to rte_config structure\n- EINVAL - count provided is not a power of 2\n- ENOSPC - the maximum number of memzones has already been allocated\n- EEXIST - a memzone with the same name already exists\n- ENOMEM - no appropriate memory area found in which to create memzone"]
    pub fn rte_ring_create(
        name: *const ::core::ffi::c_char,
        count: ::core::ffi::c_uint,
        socket_id: ::core::ffi::c_int,
        flags: ::core::ffi::c_uint,
    ) -> *mut rte_ring;
}
unsafe extern "C" {
    #[doc = "Dump the status of the ring to a file.\n\n# Arguments\n\n* `f` -\nA pointer to a file for output\n* `r` -\nA pointer to the ring structure."]
    pub fn rte_ring_dump(f: *mut FILE, r: *const rte_ring);
}
unsafe extern "C" {
    #[doc = "@warning **EXPERIMENTAL:** this API may change without prior notice.\nDump the status of a headtail to a file.\n\n# Arguments\n\n* `f` -\nA pointer to a file for output\n* `prefix` -\nA string to prefix each output line with\n* `r` -\nA pointer to a ring headtail structure."]
    pub fn rte_ring_headtail_dump(
        f: *mut FILE,
        prefix: *const ::core::ffi::c_char,
        r: *const rte_ring_headtail,
    );
}
unsafe extern "C" {
    #[doc = "Enqueue several objects on the ring (multi-producers safe).\nThis function uses a \"compare and set\" instruction to move the\nproducer index atomically.\n\n# Arguments\n\n* `r` -\nA pointer to the ring structure.\n* `obj_table` -\nA pointer to a table of void * pointers (objects).\n* `n` -\nThe number of objects to add in the ring from the obj_table.\n* `free_space` -\nif non-NULL, returns the amount of space in the ring after the\nenqueue operation has finished.\n\n# Returns\n\nThe number of objects enqueued, either 0 or n"]
    #[link_name = "rte_ring_mp_enqueue_bulk_w"]
    pub fn rte_ring_mp_enqueue_bulk(
        r: *mut rte_ring,
        obj_table: *const *mut ::core::ffi::c_void,
        n: ::core::ffi::c_uint,
        free_space: *mut ::core::ffi::c_uint,
    ) -> ::core::ffi::c_uint;
}
unsafe extern "C" {
    #[doc = "Enqueue several objects on a ring (NOT multi-producers safe).\n\n# Arguments\n\n* `r` -\nA pointer to the ring structure.\n* `obj_table` -\nA pointer to a table of void * pointers (objects).\n* `n` -\nThe number of objects to add in the ring from the obj_table.\n* `free_space` -\nif non-NULL, returns the amount of space in the ring after the\nenqueue operation has finished.\n\n# Returns\n\nThe number of objects enqueued, either 0 or n"]
    #[link_name = "rte_ring_sp_enqueue_bulk_w"]
    pub fn rte_ring_sp_enqueue_bulk(
        r: *mut rte_ring,
        obj_table: *const *mut ::core::ffi::c_void,
        n: ::core::ffi::c_uint,
        free_space: *mut ::core::ffi::c_uint,
    ) -> ::core::ffi::c_uint;
}
unsafe extern "C" {
    #[doc = "Enqueue several objects on a ring.\nThis function calls the multi-producer or the single-producer\nversion depending on the default behavior that was specified at\nring creation time (see flags).\n\n# Arguments\n\n* `r` -\nA pointer to the ring structure.\n* `obj_table` -\nA pointer to a table of void * pointers (objects).\n* `n` -\nThe number of objects to add in the ring from the obj_table.\n* `free_space` -\nif non-NULL, returns the amount of space in the ring after the\nenqueue operation has finished.\n\n# Returns\n\nThe number of objects enqueued, either 0 or n"]
    #[link_name = "rte_ring_enqueue_bulk_w"]
    pub fn rte_ring_enqueue_bulk(
        r: *mut rte_ring,
        obj_table: *const *mut ::core::ffi::c_void,
        n: ::core::ffi::c_uint,
        free_space: *mut ::core::ffi::c_uint,
    ) -> ::core::ffi::c_uint;
}
unsafe extern "C" {
    #[doc = "Enqueue one object on a ring (multi-producers safe).\nThis function uses a \"compare and set\" instruction to move the\nproducer index atomically.\n\n# Arguments\n\n* `r` -\nA pointer to the ring structure.\n* `obj` -\nA pointer to the object to be added.\n\n# Returns\n\n- 0: Success; objects enqueued.\n- -ENOBUFS: Not enough room in the ring to enqueue; no object is enqueued."]
    #[link_name = "rte_ring_mp_enqueue_w"]
    pub fn rte_ring_mp_enqueue(
        r: *mut rte_ring,
        obj: *mut ::core::ffi::c_void,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    #[doc = "Enqueue one object on a ring (NOT multi-producers safe).\n\n# Arguments\n\n* `r` -\nA pointer to the ring structure.\n* `obj` -\nA pointer to the object to be added.\n\n# Returns\n\n- 0: Success; objects enqueued.\n- -ENOBUFS: Not enough room in the ring to enqueue; no object is enqueued."]
    #[link_name = "rte_ring_sp_enqueue_w"]
    pub fn rte_ring_sp_enqueue(
        r: *mut rte_ring,
        obj: *mut ::core::ffi::c_void,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    #[doc = "Enqueue one object on a ring.\nThis function calls the multi-producer or the single-producer\nversion, depending on the default behaviour that was specified at\nring creation time (see flags).\n\n# Arguments\n\n* `r` -\nA pointer to the ring structure.\n* `obj` -\nA pointer to the object to be added.\n\n# Returns\n\n- 0: Success; objects enqueued.\n- -ENOBUFS: Not enough room in the ring to enqueue; no object is enqueued."]
    #[link_name = "rte_ring_enqueue_w"]
    pub fn rte_ring_enqueue(r: *mut rte_ring, obj: *mut ::core::ffi::c_void) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    #[doc = "Dequeue several objects from a ring (multi-consumers safe).\nThis function uses a \"compare and set\" instruction to move the\nconsumer index atomically.\n\n# Arguments\n\n* `r` -\nA pointer to the ring structure.\n* `obj_table` -\nA pointer to a table of void * pointers (objects) that will be filled.\n* `n` -\nThe number of objects to dequeue from the ring to the obj_table.\n* `available` -\nIf non-NULL, returns the number of remaining ring entries after the\ndequeue has finished.\n\n# Returns\n\nThe number of objects dequeued, either 0 or n"]
    #[link_name = "rte_ring_mc_dequeue_bulk_w"]
    pub fn rte_ring_mc_dequeue_bulk(
        r: *mut rte_ring,
        obj_table: *mut *mut ::core::ffi::c_void,
        n: ::core::ffi::c_uint,
        available: *mut ::core::ffi::c_uint,
    ) -> ::core::ffi::c_uint;
}
unsafe extern "C" {
    #[doc = "Dequeue several objects from a ring (NOT multi-consumers safe).\n\n# Arguments\n\n* `r` -\nA pointer to the ring structure.\n* `obj_table` -\nA pointer to a table of void * pointers (objects) that will be filled.\n* `n` -\nThe number of objects to dequeue from the ring to the obj_table,\nmust be strictly positive.\n* `available` -\nIf non-NULL, returns the number of remaining ring entries after the\ndequeue has finished.\n\n# Returns\n\nThe number of objects dequeued, either 0 or n"]
    #[link_name = "rte_ring_sc_dequeue_bulk_w"]
    pub fn rte_ring_sc_dequeue_bulk(
        r: *mut rte_ring,
        obj_table: *mut *mut ::core::ffi::c_void,
        n: ::core::ffi::c_uint,
        available: *mut ::core::ffi::c_uint,
    ) -> ::core::ffi::c_uint;
}
unsafe extern "C" {
    #[doc = "Dequeue several objects from a ring.\nThis function calls the multi-consumers or the single-consumer\nversion, depending on the default behaviour that was specified at\nring creation time (see flags).\n\n# Arguments\n\n* `r` -\nA pointer to the ring structure.\n* `obj_table` -\nA pointer to a table of void * pointers (objects) that will be filled.\n* `n` -\nThe number of objects to dequeue from the ring to the obj_table.\n* `available` -\nIf non-NULL, returns the number of remaining ring entries after the\ndequeue has finished.\n\n# Returns\n\nThe number of objects dequeued, either 0 or n"]
    #[link_name = "rte_ring_dequeue_bulk_w"]
    pub fn rte_ring_dequeue_bulk(
        r: *mut rte_ring,
        obj_table: *mut *mut ::core::ffi::c_void,
        n: ::core::ffi::c_uint,
        available: *mut ::core::ffi::c_uint,
    ) -> ::core::ffi::c_uint;
}
unsafe extern "C" {
    #[doc = "Dequeue one object from a ring (multi-consumers safe).\nThis function uses a \"compare and set\" instruction to move the\nconsumer index atomically.\n\n# Arguments\n\n* `r` -\nA pointer to the ring structure.\n* `obj_p` -\nA pointer to a void * pointer (object) that will be filled.\n\n# Returns\n\n- 0: Success; objects dequeued.\n- -ENOENT: Not enough entries in the ring to dequeue; no object is\ndequeued."]
    #[link_name = "rte_ring_mc_dequeue_w"]
    pub fn rte_ring_mc_dequeue(
        r: *mut rte_ring,
        obj_p: *mut *mut ::core::ffi::c_void,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    #[doc = "Dequeue one object from a ring (NOT multi-consumers safe).\n\n# Arguments\n\n* `r` -\nA pointer to the ring structure.\n* `obj_p` -\nA pointer to a void * pointer (object) that will be filled.\n\n# Returns\n\n- 0: Success; objects dequeued.\n- -ENOENT: Not enough entries in the ring to dequeue, no object is\ndequeued."]
    #[link_name = "rte_ring_sc_dequeue_w"]
    pub fn rte_ring_sc_dequeue(
        r: *mut rte_ring,
        obj_p: *mut *mut ::core::ffi::c_void,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    #[doc = "Dequeue one object from a ring.\nThis function calls the multi-consumers or the single-consumer\nversion depending on the default behaviour that was specified at\nring creation time (see flags).\n\n# Arguments\n\n* `r` -\nA pointer to the ring structure.\n* `obj_p` -\nA pointer to a void * pointer (object) that will be filled.\n\n# Returns\n\n- 0: Success, objects dequeued.\n- -ENOENT: Not enough entries in the ring to dequeue, no object is\ndequeued."]
    #[link_name = "rte_ring_dequeue_w"]
    pub fn rte_ring_dequeue(
        r: *mut rte_ring,
        obj_p: *mut *mut ::core::ffi::c_void,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    #[doc = "Flush a ring.\nThis function flush all the elements in a ring\n@warning Make sure the ring is not in use while calling this function.\n\n# Arguments\n\n* `r` -\nA pointer to the ring structure."]
    pub fn rte_ring_reset(r: *mut rte_ring);
}
unsafe extern "C" {
    #[doc = "Return the number of entries in a ring.\n\n# Arguments\n\n* `r` -\nA pointer to the ring structure.\n\n# Returns\n\nThe number of entries in the ring."]
    #[link_name = "rte_ring_count_w"]
    pub fn rte_ring_count(r: *const rte_ring) -> ::core::ffi::c_uint;
}
unsafe extern "C" {
    #[doc = "Return the number of free entries in a ring.\n\n# Arguments\n\n* `r` -\nA pointer to the ring structure.\n\n# Returns\n\nThe number of free entries in the ring."]
    #[link_name = "rte_ring_free_count_w"]
    pub fn rte_ring_free_count(r: *const rte_ring) -> ::core::ffi::c_uint;
}
unsafe extern "C" {
    #[doc = "Test if a ring is full.\n\n# Arguments\n\n* `r` -\nA pointer to the ring structure.\n\n# Returns\n\n- 1: The ring is full.\n- 0: The ring is not full."]
    #[link_name = "rte_ring_full_w"]
    pub fn rte_ring_full(r: *const rte_ring) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    #[doc = "Test if a ring is empty.\n\n# Arguments\n\n* `r` -\nA pointer to the ring structure.\n\n# Returns\n\n- 1: The ring is empty.\n- 0: The ring is not empty."]
    #[link_name = "rte_ring_empty_w"]
    pub fn rte_ring_empty(r: *const rte_ring) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    #[doc = "Return the size of the ring.\n\n# Arguments\n\n* `r` -\nA pointer to the ring structure.\n\n# Returns\n\nThe size of the data store used by the ring.\nNOTE: this is not the same as the usable space in the ring. To query that\nuse ``rte_ring_get_capacity()``."]
    #[link_name = "rte_ring_get_size_w"]
    pub fn rte_ring_get_size(r: *const rte_ring) -> ::core::ffi::c_uint;
}
unsafe extern "C" {
    #[doc = "Return the number of elements which can be stored in the ring.\n\n# Arguments\n\n* `r` -\nA pointer to the ring structure.\n\n# Returns\n\nThe usable size of the ring."]
    #[link_name = "rte_ring_get_capacity_w"]
    pub fn rte_ring_get_capacity(r: *const rte_ring) -> ::core::ffi::c_uint;
}
unsafe extern "C" {
    #[doc = "Return sync type used by producer in the ring.\n\n# Arguments\n\n* `r` -\nA pointer to the ring structure.\n\n# Returns\n\nProducer sync type value."]
    #[link_name = "rte_ring_get_prod_sync_type_w"]
    pub fn rte_ring_get_prod_sync_type(r: *const rte_ring) -> rte_ring_sync_type::Type;
}
unsafe extern "C" {
    #[doc = "Check is the ring for single producer.\n\n# Arguments\n\n* `r` -\nA pointer to the ring structure.\n\n# Returns\n\ntrue if ring is SP, zero otherwise."]
    #[link_name = "rte_ring_is_prod_single_w"]
    pub fn rte_ring_is_prod_single(r: *const rte_ring) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    #[doc = "Return sync type used by consumer in the ring.\n\n# Arguments\n\n* `r` -\nA pointer to the ring structure.\n\n# Returns\n\nConsumer sync type value."]
    #[link_name = "rte_ring_get_cons_sync_type_w"]
    pub fn rte_ring_get_cons_sync_type(r: *const rte_ring) -> rte_ring_sync_type::Type;
}
unsafe extern "C" {
    #[doc = "Check is the ring for single consumer.\n\n# Arguments\n\n* `r` -\nA pointer to the ring structure.\n\n# Returns\n\ntrue if ring is SC, zero otherwise."]
    #[link_name = "rte_ring_is_cons_single_w"]
    pub fn rte_ring_is_cons_single(r: *const rte_ring) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    #[doc = "Dump the status of all rings on the console\n\n# Arguments\n\n* `f` -\nA pointer to a file for output"]
    pub fn rte_ring_list_dump(f: *mut FILE);
}
unsafe extern "C" {
    #[doc = "Search a ring from its name\n\n# Arguments\n\n* `name` -\nThe name of the ring.\n\n# Returns\n\nThe pointer to the ring matching the name, or NULL if not found,\nwith rte_errno set appropriately. Possible rte_errno values include:\n- ENOENT - required entry not available to return."]
    pub fn rte_ring_lookup(name: *const ::core::ffi::c_char) -> *mut rte_ring;
}
unsafe extern "C" {
    #[doc = "Enqueue several objects on the ring (multi-producers safe).\nThis function uses a \"compare and set\" instruction to move the\nproducer index atomically.\n\n# Arguments\n\n* `r` -\nA pointer to the ring structure.\n* `obj_table` -\nA pointer to a table of void * pointers (objects).\n* `n` -\nThe number of objects to add in the ring from the obj_table.\n* `free_space` -\nif non-NULL, returns the amount of space in the ring after the\nenqueue operation has finished.\n\n# Returns\n\n- n: Actual number of objects enqueued."]
    #[link_name = "rte_ring_mp_enqueue_burst_w"]
    pub fn rte_ring_mp_enqueue_burst(
        r: *mut rte_ring,
        obj_table: *const *mut ::core::ffi::c_void,
        n: ::core::ffi::c_uint,
        free_space: *mut ::core::ffi::c_uint,
    ) -> ::core::ffi::c_uint;
}
unsafe extern "C" {
    #[doc = "Enqueue several objects on a ring (NOT multi-producers safe).\n\n# Arguments\n\n* `r` -\nA pointer to the ring structure.\n* `obj_table` -\nA pointer to a table of void * pointers (objects).\n* `n` -\nThe number of objects to add in the ring from the obj_table.\n* `free_space` -\nif non-NULL, returns the amount of space in the ring after the\nenqueue operation has finished.\n\n# Returns\n\n- n: Actual number of objects enqueued."]
    #[link_name = "rte_ring_sp_enqueue_burst_w"]
    pub fn rte_ring_sp_enqueue_burst(
        r: *mut rte_ring,
        obj_table: *const *mut ::core::ffi::c_void,
        n: ::core::ffi::c_uint,
        free_space: *mut ::core::ffi::c_uint,
    ) -> ::core::ffi::c_uint;
}
unsafe extern "C" {
    #[doc = "Enqueue several objects on a ring.\nThis function calls the multi-producer or the single-producer\nversion depending on the default behavior that was specified at\nring creation time (see flags).\n\n# Arguments\n\n* `r` -\nA pointer to the ring structure.\n* `obj_table` -\nA pointer to a table of void * pointers (objects).\n* `n` -\nThe number of objects to add in the ring from the obj_table.\n* `free_space` -\nif non-NULL, returns the amount of space in the ring after the\nenqueue operation has finished.\n\n# Returns\n\n- n: Actual number of objects enqueued."]
    #[link_name = "rte_ring_enqueue_burst_w"]
    pub fn rte_ring_enqueue_burst(
        r: *mut rte_ring,
        obj_table: *const *mut ::core::ffi::c_void,
        n: ::core::ffi::c_uint,
        free_space: *mut ::core::ffi::c_uint,
    ) -> ::core::ffi::c_uint;
}
unsafe extern "C" {
    #[doc = "Dequeue several objects from a ring (multi-consumers safe). When the request\nobjects are more than the available objects, only dequeue the actual number\nof objects\nThis function uses a \"compare and set\" instruction to move the\nconsumer index atomically.\n\n# Arguments\n\n* `r` -\nA pointer to the ring structure.\n* `obj_table` -\nA pointer to a table of void * pointers (objects) that will be filled.\n* `n` -\nThe number of objects to dequeue from the ring to the obj_table.\n* `available` -\nIf non-NULL, returns the number of remaining ring entries after the\ndequeue has finished.\n\n# Returns\n\n- n: Actual number of objects dequeued, 0 if ring is empty"]
    #[link_name = "rte_ring_mc_dequeue_burst_w"]
    pub fn rte_ring_mc_dequeue_burst(
        r: *mut rte_ring,
        obj_table: *mut *mut ::core::ffi::c_void,
        n: ::core::ffi::c_uint,
        available: *mut ::core::ffi::c_uint,
    ) -> ::core::ffi::c_uint;
}
unsafe extern "C" {
    #[doc = "Dequeue several objects from a ring (NOT multi-consumers safe).When the\nrequest objects are more than the available objects, only dequeue the\nactual number of objects\n\n# Arguments\n\n* `r` -\nA pointer to the ring structure.\n* `obj_table` -\nA pointer to a table of void * pointers (objects) that will be filled.\n* `n` -\nThe number of objects to dequeue from the ring to the obj_table.\n* `available` -\nIf non-NULL, returns the number of remaining ring entries after the\ndequeue has finished.\n\n# Returns\n\n- n: Actual number of objects dequeued, 0 if ring is empty"]
    #[link_name = "rte_ring_sc_dequeue_burst_w"]
    pub fn rte_ring_sc_dequeue_burst(
        r: *mut rte_ring,
        obj_table: *mut *mut ::core::ffi::c_void,
        n: ::core::ffi::c_uint,
        available: *mut ::core::ffi::c_uint,
    ) -> ::core::ffi::c_uint;
}
unsafe extern "C" {
    #[doc = "Dequeue multiple objects from a ring up to a maximum number.\nThis function calls the multi-consumers or the single-consumer\nversion, depending on the default behaviour that was specified at\nring creation time (see flags).\n\n# Arguments\n\n* `r` -\nA pointer to the ring structure.\n* `obj_table` -\nA pointer to a table of void * pointers (objects) that will be filled.\n* `n` -\nThe number of objects to dequeue from the ring to the obj_table.\n* `available` -\nIf non-NULL, returns the number of remaining ring entries after the\ndequeue has finished.\n\n# Returns\n\n- Number of objects dequeued"]
    #[link_name = "rte_ring_dequeue_burst_w"]
    pub fn rte_ring_dequeue_burst(
        r: *mut rte_ring,
        obj_table: *mut *mut ::core::ffi::c_void,
        n: ::core::ffi::c_uint,
        available: *mut ::core::ffi::c_uint,
    ) -> ::core::ffi::c_uint;
}
#[doc = "64 bits vector size to use with unsigned 8 bits elements.\na = (rte_v64u8_t){ a0, a1, a2, a3, a4, a5, a6, a7 }"]
pub type rte_v64u8_t = [u8; 8usize];
#[doc = "64 bits vector size to use with unsigned 16 bits elements.\na = (rte_v64u16_t){ a0, a1, a2, a3 }"]
pub type rte_v64u16_t = [u16; 4usize];
#[doc = "64 bits vector size to use with unsigned 32 bits elements.\na = (rte_v64u32_t){ a0, a1 }"]
pub type rte_v64u32_t = [u32; 2usize];
#[doc = "128 bits vector size to use with unsigned 8 bits elements.\na = (rte_v128u8_t){ a00, a01, a02, a03, a04, a05, a06, a07,\na08, a09, a10, a11, a12, a13, a14, a15 }"]
pub type rte_v128u8_t = [u8; 16usize];
#[doc = "128 bits vector size to use with unsigned 16 bits elements.\na = (rte_v128u16_t){ a0, a1, a2, a3, a4, a5, a6, a7 }"]
pub type rte_v128u16_t = [u16; 8usize];
#[doc = "128 bits vector size to use with unsigned 32 bits elements.\na = (rte_v128u32_t){ a0, a1, a2, a3 }"]
pub type rte_v128u32_t = [u32; 4usize];
#[doc = "128 bits vector size to use with unsigned 64 bits elements.\na = (rte_v128u64_t){ a0, a1 }"]
pub type rte_v128u64_t = [u64; 2usize];
#[doc = "256 bits vector size to use with unsigned 8 bits elements.\na = (rte_v256u8_t){ a00, a01, a02, a03, a04, a05, a06, a07,\na08, a09, a10, a11, a12, a13, a14, a15,\na16, a17, a18, a19, a20, a21, a22, a23,\na24, a25, a26, a27, a28, a29, a30, a31 }"]
pub type rte_v256u8_t = [u8; 32usize];
#[doc = "256 bits vector size to use with unsigned 16 bits elements.\na = (rte_v256u16_t){ a00, a01, a02, a03, a04, a05, a06, a07,\na08, a09, a10, a11, a12, a13, a14, a15 }"]
pub type rte_v256u16_t = [u16; 16usize];
#[doc = "256 bits vector size to use with unsigned 32 bits elements.\na = (rte_v256u32_t){ a0, a1, a2, a3, a4, a5, a6, a7 }"]
pub type rte_v256u32_t = [u32; 8usize];
#[doc = "256 bits vector size to use with unsigned 64 bits elements.\na = (rte_v256u64_t){ a0, a1, a2, a3 }"]
pub type rte_v256u64_t = [u64; 4usize];
#[doc = "64 bits vector size to use with 8 bits elements.\na = (rte_v64s8_t){ a0, a1, a2, a3, a4, a5, a6, a7 }"]
pub type rte_v64s8_t = [i8; 8usize];
#[doc = "64 bits vector size to use with 16 bits elements.\na = (rte_v64s16_t){ a0, a1, a2, a3 }"]
pub type rte_v64s16_t = [i16; 4usize];
#[doc = "64 bits vector size to use with 32 bits elements.\na = (rte_v64s32_t){ a0, a1 }"]
pub type rte_v64s32_t = [i32; 2usize];
#[doc = "128 bits vector size to use with 8 bits elements.\na = (rte_v128s8_t){ a00, a01, a02, a03, a04, a05, a06, a07,\na08, a09, a10, a11, a12, a13, a14, a15 }"]
pub type rte_v128s8_t = [i8; 16usize];
#[doc = "128 bits vector size to use with 16 bits elements.\na = (rte_v128s16_t){ a0, a1, a2, a3, a4, a5, a6, a7 }"]
pub type rte_v128s16_t = [i16; 8usize];
#[doc = "128 bits vector size to use with 32 bits elements.\na = (rte_v128s32_t){ a0, a1, a2, a3 }"]
pub type rte_v128s32_t = [i32; 4usize];
#[doc = "128 bits vector size to use with 64 bits elements.\na = (rte_v128s64_t){ a1, a2 }"]
pub type rte_v128s64_t = [i64; 2usize];
#[doc = "256 bits vector size to use with 8 bits elements.\na = (rte_v256s8_t){ a00, a01, a02, a03, a04, a05, a06, a07,\na08, a09, a10, a11, a12, a13, a14, a15,\na16, a17, a18, a19, a20, a21, a22, a23,\na24, a25, a26, a27, a28, a29, a30, a31 }"]
pub type rte_v256s8_t = [i8; 32usize];
#[doc = "256 bits vector size to use with 16 bits elements.\na = (rte_v256s16_t){ a00, a01, a02, a03, a04, a05, a06, a07,\na08, a09, a10, a11, a12, a13, a14, a15 }"]
pub type rte_v256s16_t = [i16; 16usize];
#[doc = "256 bits vector size to use with 32 bits elements.\na = (rte_v256s32_t){ a0, a1, a2, a3, a4, a5, a6, a7 }"]
pub type rte_v256s32_t = [i32; 8usize];
#[doc = "256 bits vector size to use with 64 bits elements.\na = (rte_v256s64_t){ a0, a1, a2, a3 }"]
pub type rte_v256s64_t = [i64; 4usize];
pub mod rte_vect_max_simd {
    #[doc = "The max SIMD bitwidth value to limit vector path selection."]
    pub type Type = ::core::ffi::c_uint;
    pub const RTE_VECT_SIMD_DISABLED: Type = 64;
    pub const RTE_VECT_SIMD_128: Type = 128;
    #[doc = "< Limits path selection to AVX2 or below."]
    pub const RTE_VECT_SIMD_256: Type = 256;
    #[doc = "< Limits path selection to AVX512 or below."]
    pub const RTE_VECT_SIMD_512: Type = 512;
    pub const RTE_VECT_SIMD_MAX: Type = 32768;
}
unsafe extern "C" {
    #[doc = "Get the supported SIMD bitwidth.\n\n# Returns\n\nuint16_t bitwidth."]
    pub fn rte_vect_get_max_simd_bitwidth() -> u16;
}
unsafe extern "C" {
    #[doc = "Set the supported SIMD bitwidth.\nThis API should only be called once at initialization, before EAL init.\n\n# Arguments\n\n* `bitwidth` -\nuint16_t bitwidth.\n\n# Returns\n\n- 0 on success.\n- -EINVAL on invalid bitwidth parameter.\n- -EPERM if bitwidth is forced."]
    pub fn rte_vect_set_max_simd_bitwidth(bitwidth: u16) -> ::core::ffi::c_int;
}
pub type xmm_t = __m128i;
#[repr(C)]
#[repr(align(16))]
#[derive(Copy, Clone)]
pub union rte_xmm {
    pub x: xmm_t,
    pub u8_: [u8; 16usize],
    pub u16_: [u16; 8usize],
    pub u32_: [u32; 4usize],
    pub u64_: [u64; 2usize],
    pub pd: [f64; 2usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of rte_xmm"][::core::mem::size_of::<rte_xmm>() - 16usize];
    ["Alignment of rte_xmm"][::core::mem::align_of::<rte_xmm>() - 16usize];
    ["Offset of field: rte_xmm::x"][::core::mem::offset_of!(rte_xmm, x) - 0usize];
    ["Offset of field: rte_xmm::u8_"][::core::mem::offset_of!(rte_xmm, u8_) - 0usize];
    ["Offset of field: rte_xmm::u16_"][::core::mem::offset_of!(rte_xmm, u16_) - 0usize];
    ["Offset of field: rte_xmm::u32_"][::core::mem::offset_of!(rte_xmm, u32_) - 0usize];
    ["Offset of field: rte_xmm::u64_"][::core::mem::offset_of!(rte_xmm, u64_) - 0usize];
    ["Offset of field: rte_xmm::pd"][::core::mem::offset_of!(rte_xmm, pd) - 0usize];
};
impl Default for rte_xmm {
    fn default() -> Self {
        let mut s = ::core::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::core::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
pub type rte_xmm_t = rte_xmm;
unsafe extern "C" {
    #[doc = "Copy bytes from one location to another. The locations must not overlap.\n> **Note** This is implemented as a macro, so it's address should not be taken\nand care is needed as parameter expressions may be evaluated multiple times.\n\n# Arguments\n\n* `dst` -\nPointer to the destination of the data.\n* `src` -\nPointer to the source data.\n* `n` -\nNumber of bytes to copy.\n\n# Returns\n\nPointer to the destination data."]
    #[link_name = "rte_memcpy_w"]
    pub fn rte_memcpy(
        dst: *mut ::core::ffi::c_void,
        src: *const ::core::ffi::c_void,
        n: usize,
    ) -> *mut ::core::ffi::c_void;
}
unsafe extern "C" {
    #[doc = "Copy bytes from one location to another,\nlocations should not overlap.\nUse with n <= 15."]
    #[link_name = "rte_mov15_or_less_w"]
    pub fn rte_mov15_or_less(
        dst: *mut ::core::ffi::c_void,
        src: *const ::core::ffi::c_void,
        n: usize,
    ) -> *mut ::core::ffi::c_void;
}
unsafe extern "C" {
    #[doc = "Copy 16 bytes from one location to another,\nlocations should not overlap."]
    #[link_name = "rte_mov16_w"]
    pub fn rte_mov16(dst: *mut u8, src: *const u8);
}
unsafe extern "C" {
    #[doc = "Copy 32 bytes from one location to another,\nlocations should not overlap."]
    #[link_name = "rte_mov32_w"]
    pub fn rte_mov32(dst: *mut u8, src: *const u8);
}
unsafe extern "C" {
    #[doc = "Copy 64 bytes from one location to another,\nlocations should not overlap."]
    #[link_name = "rte_mov64_w"]
    pub fn rte_mov64(dst: *mut u8, src: *const u8);
}
unsafe extern "C" {
    #[doc = "Copy 128 bytes from one location to another,\nlocations should not overlap."]
    #[link_name = "rte_mov128_w"]
    pub fn rte_mov128(dst: *mut u8, src: *const u8);
}
unsafe extern "C" {
    #[doc = "Copy 256 bytes from one location to another,\nlocations should not overlap."]
    #[link_name = "rte_mov256_w"]
    pub fn rte_mov256(dst: *mut u8, src: *const u8);
}
unsafe extern "C" {
    #[link_name = "rte_memcpy_generic_w"]
    pub fn rte_memcpy_generic(
        dst: *mut ::core::ffi::c_void,
        src: *const ::core::ffi::c_void,
        n: usize,
    ) -> *mut ::core::ffi::c_void;
}
unsafe extern "C" {
    #[link_name = "rte_memcpy_aligned_w"]
    pub fn rte_memcpy_aligned(
        dst: *mut ::core::ffi::c_void,
        src: *const ::core::ffi::c_void,
        n: usize,
    ) -> *mut ::core::ffi::c_void;
}
unsafe extern "C" {
    #[doc = "Takes string \"string\" parameter and splits it at character \"delim\"\nup to maxtokens-1 times - to give \"maxtokens\" resulting tokens. Like\nstrtok or strsep functions, this modifies its input string, by replacing\ninstances of \"delim\" with '\\\\0'. All resultant tokens are returned in the\n\"tokens\" array which must have enough entries to hold \"maxtokens\".\n\n# Arguments\n\n* `string` -\nThe input string to be split into tokens\n* `stringlen` -\nThe max length of the input buffer\n* `tokens` -\nThe array to hold the pointers to the tokens in the string\n* `maxtokens` -\nThe number of elements in the tokens array. At most, maxtokens-1 splits\nof the string will be done.\n* `delim` -\nThe character on which the split of the data will be done\n\n# Returns\n\nThe number of tokens in the tokens array."]
    pub fn rte_strsplit(
        string: *mut ::core::ffi::c_char,
        stringlen: ::core::ffi::c_int,
        tokens: *mut *mut ::core::ffi::c_char,
        maxtokens: ::core::ffi::c_int,
        delim: ::core::ffi::c_char,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    #[doc = "@internal DPDK-specific version of strlcpy for systems without\nlibc or libbsd copies of the function"]
    #[link_name = "rte_strlcpy_w"]
    pub fn rte_strlcpy(
        dst: *mut ::core::ffi::c_char,
        src: *const ::core::ffi::c_char,
        size: usize,
    ) -> usize;
}
unsafe extern "C" {
    #[doc = "@internal DPDK-specific version of strlcat for systems without\nlibc or libbsd copies of the function"]
    #[link_name = "rte_strlcat_w"]
    pub fn rte_strlcat(
        dst: *mut ::core::ffi::c_char,
        src: *const ::core::ffi::c_char,
        size: usize,
    ) -> usize;
}
unsafe extern "C" {
    #[doc = "Copy string src to buffer dst of size dsize.\nAt most dsize-1 chars will be copied.\nAlways NUL-terminates, unless (dsize == 0).\n\n# Arguments\n\n* `dst` -\nThe destination string.\n* `src` -\nThe input string to be copied.\n* `dsize` -\nLength in bytes of the destination buffer.\n\n# Returns\n\nThe number of bytes copied (terminating NUL-byte excluded) on success.\n-E2BIG if the destination buffer is too small.\nrte_errno is set."]
    pub fn rte_strscpy(
        dst: *mut ::core::ffi::c_char,
        src: *const ::core::ffi::c_char,
        dsize: usize,
    ) -> isize;
}
unsafe extern "C" {
    #[doc = "@warning **EXPERIMENTAL:** this API may change without prior notice.\nSearch for the first non whitespace character.\n\n# Arguments\n\n* `src` -\nThe input string to be analysed.\n\n# Returns\n\nThe address of the first non whitespace character."]
    #[link_name = "rte_str_skip_leading_spaces_w"]
    pub fn rte_str_skip_leading_spaces(
        src: *const ::core::ffi::c_char,
    ) -> *const ::core::ffi::c_char;
}
unsafe extern "C" {
    #[doc = "Test if trace is enabled.\n\n# Returns\n\ntrue if trace is enabled, false otherwise."]
    pub fn rte_trace_is_enabled() -> bool;
}
unsafe extern "C" {
    #[doc = "@warning **EXPERIMENTAL:** this API may change, or be removed, without prior notice\nTest if trace feature is enabled at compile time.\n\n# Returns\n\ntrue if trace feature is enabled, false otherwise."]
    #[link_name = "rte_trace_feature_is_enabled_w"]
    pub fn rte_trace_feature_is_enabled() -> bool;
}
pub mod rte_trace_mode {
    #[doc = "Enumerate trace mode operation."]
    pub type Type = ::core::ffi::c_uint;
    #[doc = "In this mode, when no space is left in the trace buffer, the\nsubsequent events overwrite the old events."]
    pub const RTE_TRACE_MODE_OVERWRITE: Type = 0;
    #[doc = "In this mode, when no space is left in the trace buffer, the\nsubsequent events shall not be recorded."]
    pub const RTE_TRACE_MODE_DISCARD: Type = 1;
}
unsafe extern "C" {
    #[doc = "Set the trace mode.\n\n# Arguments\n\n* `mode` -\nTrace mode."]
    pub fn rte_trace_mode_set(mode: rte_trace_mode::Type);
}
unsafe extern "C" {
    #[doc = "Get the trace mode.\n\n# Returns\n\nThe current trace mode."]
    pub fn rte_trace_mode_get() -> rte_trace_mode::Type;
}
unsafe extern "C" {
    #[doc = "Enable/Disable a set of tracepoints based on globbing pattern.\n\n# Arguments\n\n* `pattern` -\nThe globbing pattern identifying the tracepoint.\n* `enable` -\ntrue to enable tracepoint, false to disable the tracepoint, upon match.\n\n# Returns\n\n- 0: Success and no pattern match.\n- 1: Success and found pattern match.\n- (-ERANGE): Tracepoint object is not registered."]
    pub fn rte_trace_pattern(
        pattern: *const ::core::ffi::c_char,
        enable: bool,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    #[doc = "Enable/Disable a set of tracepoints based on regular expression.\n\n# Arguments\n\n* `regex` -\nA regular expression identifying the tracepoint.\n* `enable` -\ntrue to enable tracepoint, false to disable the tracepoint, upon match.\n\n# Returns\n\n- 0: Success and no pattern match.\n- 1: Success and found pattern match.\n- (-ERANGE): Tracepoint object is not registered.\n- (-EINVAL): Invalid regular expression rule."]
    pub fn rte_trace_regexp(regex: *const ::core::ffi::c_char, enable: bool) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    #[doc = "Save the trace buffer to the trace directory.\nBy default, trace directory will be created at $HOME directory and this can\nbe overridden by --trace-dir EAL parameter.\n\n# Returns\n\n- 0: Success.\n- <0 : Failure."]
    pub fn rte_trace_save() -> ::core::ffi::c_int;
}
unsafe extern "C" {
    #[doc = "Dump the trace metadata to a file.\n\n# Arguments\n\n* `f` -\nA pointer to a file for output\n\n# Returns\n\n- 0: Success.\n- <0 : Failure."]
    pub fn rte_trace_metadata_dump(f: *mut FILE) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    #[doc = "Dump the trace subsystem status to a file.\n\n# Arguments\n\n* `f` -\nA pointer to a file for output"]
    pub fn rte_trace_dump(f: *mut FILE);
}
#[doc = "The tracepoint object."]
pub type rte_trace_point_t = u64;
unsafe extern "C" {
    #[doc = "Enable recording events of the given tracepoint in the trace buffer.\n\n# Arguments\n\n* `tp` -\nThe tracepoint object to enable.\n\n# Returns\n\n- 0: Success.\n- (-ERANGE): Trace object is not registered."]
    pub fn rte_trace_point_enable(tp: *mut rte_trace_point_t) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    #[doc = "Disable recording events of the given tracepoint in the trace buffer.\n\n# Arguments\n\n* `tp` -\nThe tracepoint object to disable.\n\n# Returns\n\n- 0: Success.\n- (-ERANGE): Trace object is not registered."]
    pub fn rte_trace_point_disable(tp: *mut rte_trace_point_t) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    #[doc = "Test if recording events from the given tracepoint is enabled.\n\n# Arguments\n\n* `tp` -\nThe tracepoint object.\n\n# Returns\n\ntrue if tracepoint is enabled, false otherwise."]
    pub fn rte_trace_point_is_enabled(tp: *mut rte_trace_point_t) -> bool;
}
unsafe extern "C" {
    #[doc = "Lookup a tracepoint object from its name.\n\n# Arguments\n\n* `name` -\nThe name of the tracepoint.\n\n# Returns\n\nThe tracepoint object or NULL if not found."]
    pub fn rte_trace_point_lookup(name: *const ::core::ffi::c_char) -> *mut rte_trace_point_t;
}
unsafe extern "C" {
    #[link_name = "rte_mempool_trace_ops_dequeue_bulk_w"]
    pub fn rte_mempool_trace_ops_dequeue_bulk(
        mempool: *mut ::core::ffi::c_void,
        obj_table: *mut *mut ::core::ffi::c_void,
        nb_objs: u32,
    );
}
unsafe extern "C" {
    #[link_name = "rte_mempool_trace_ops_dequeue_contig_blocks_w"]
    pub fn rte_mempool_trace_ops_dequeue_contig_blocks(
        mempool: *mut ::core::ffi::c_void,
        first_obj_table: *mut *mut ::core::ffi::c_void,
        nb_objs: u32,
    );
}
unsafe extern "C" {
    #[link_name = "rte_mempool_trace_ops_enqueue_bulk_w"]
    pub fn rte_mempool_trace_ops_enqueue_bulk(
        mempool: *mut ::core::ffi::c_void,
        obj_table: *const *mut ::core::ffi::c_void,
        nb_objs: u32,
    );
}
unsafe extern "C" {
    #[link_name = "rte_mempool_trace_generic_put_w"]
    pub fn rte_mempool_trace_generic_put(
        mempool: *mut ::core::ffi::c_void,
        obj_table: *const *mut ::core::ffi::c_void,
        nb_objs: u32,
        cache: *mut ::core::ffi::c_void,
    );
}
unsafe extern "C" {
    #[link_name = "rte_mempool_trace_put_bulk_w"]
    pub fn rte_mempool_trace_put_bulk(
        mempool: *mut ::core::ffi::c_void,
        obj_table: *const *mut ::core::ffi::c_void,
        nb_objs: u32,
        cache: *mut ::core::ffi::c_void,
    );
}
unsafe extern "C" {
    #[link_name = "rte_mempool_trace_generic_get_w"]
    pub fn rte_mempool_trace_generic_get(
        mempool: *mut ::core::ffi::c_void,
        obj_table: *const *mut ::core::ffi::c_void,
        nb_objs: u32,
        cache: *mut ::core::ffi::c_void,
    );
}
unsafe extern "C" {
    #[link_name = "rte_mempool_trace_get_bulk_w"]
    pub fn rte_mempool_trace_get_bulk(
        mempool: *mut ::core::ffi::c_void,
        obj_table: *mut *mut ::core::ffi::c_void,
        nb_objs: u32,
        cache: *mut ::core::ffi::c_void,
    );
}
unsafe extern "C" {
    #[link_name = "rte_mempool_trace_get_contig_blocks_w"]
    pub fn rte_mempool_trace_get_contig_blocks(
        mempool: *mut ::core::ffi::c_void,
        first_obj_table: *mut *mut ::core::ffi::c_void,
        nb_objs: u32,
    );
}
unsafe extern "C" {
    #[link_name = "rte_mempool_trace_default_cache_w"]
    pub fn rte_mempool_trace_default_cache(
        mempool: *mut ::core::ffi::c_void,
        lcore_id: u32,
        default_cache: *mut ::core::ffi::c_void,
    );
}
unsafe extern "C" {
    #[link_name = "rte_mempool_trace_cache_flush_w"]
    pub fn rte_mempool_trace_cache_flush(
        cache: *mut ::core::ffi::c_void,
        mempool: *mut ::core::ffi::c_void,
    );
}
#[doc = "A structure that stores a per-core object cache."]
#[repr(C)]
#[repr(align(64))]
#[derive(Debug, Copy, Clone)]
pub struct rte_mempool_cache {
    #[doc = "< Size of the cache"]
    pub size: u32,
    #[doc = "< Threshold before we flush excess elements"]
    pub flushthresh: u32,
    #[doc = "< Current cache count"]
    pub len: u32,
    pub __bindgen_padding_0: [u64; 6usize],
    #[doc = "Cache objects\nCache is allocated to this size to allow it to overflow in certain\ncases to avoid needless emptying of cache."]
    pub objs: [*mut ::core::ffi::c_void; 1024usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of rte_mempool_cache"][::core::mem::size_of::<rte_mempool_cache>() - 8256usize];
    ["Alignment of rte_mempool_cache"][::core::mem::align_of::<rte_mempool_cache>() - 64usize];
    ["Offset of field: rte_mempool_cache::size"]
        [::core::mem::offset_of!(rte_mempool_cache, size) - 0usize];
    ["Offset of field: rte_mempool_cache::flushthresh"]
        [::core::mem::offset_of!(rte_mempool_cache, flushthresh) - 4usize];
    ["Offset of field: rte_mempool_cache::len"]
        [::core::mem::offset_of!(rte_mempool_cache, len) - 8usize];
    ["Offset of field: rte_mempool_cache::objs"]
        [::core::mem::offset_of!(rte_mempool_cache, objs) - 64usize];
};
impl Default for rte_mempool_cache {
    fn default() -> Self {
        let mut s = ::core::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::core::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[doc = "A structure that stores the size of mempool elements."]
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct rte_mempool_objsz {
    #[doc = "< Size of an element."]
    pub elt_size: u32,
    #[doc = "< Size of header (before elt)."]
    pub header_size: u32,
    #[doc = "< Size of trailer (after elt)."]
    pub trailer_size: u32,
    pub total_size: u32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of rte_mempool_objsz"][::core::mem::size_of::<rte_mempool_objsz>() - 16usize];
    ["Alignment of rte_mempool_objsz"][::core::mem::align_of::<rte_mempool_objsz>() - 4usize];
    ["Offset of field: rte_mempool_objsz::elt_size"]
        [::core::mem::offset_of!(rte_mempool_objsz, elt_size) - 0usize];
    ["Offset of field: rte_mempool_objsz::header_size"]
        [::core::mem::offset_of!(rte_mempool_objsz, header_size) - 4usize];
    ["Offset of field: rte_mempool_objsz::trailer_size"]
        [::core::mem::offset_of!(rte_mempool_objsz, trailer_size) - 8usize];
    ["Offset of field: rte_mempool_objsz::total_size"]
        [::core::mem::offset_of!(rte_mempool_objsz, total_size) - 12usize];
};
#[doc = "Mempool object header structure\nEach object stored in mempools are prefixed by this header structure,\nit allows to retrieve the mempool pointer from the object and to\niterate on all objects attached to a mempool. When debug is enabled,\na cookie is also added in this structure preventing corruptions and\ndouble-frees."]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct rte_mempool_objhdr {
    #[doc = "< Next in list."]
    pub next: rte_mempool_objhdr__bindgen_ty_1,
    #[doc = "< The mempool owning the object."]
    pub mp: *mut rte_mempool,
    #[doc = "< IO address of the object."]
    pub iova: rte_iova_t,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct rte_mempool_objhdr__bindgen_ty_1 {
    #[doc = "next element"]
    pub stqe_next: *mut rte_mempool_objhdr,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of rte_mempool_objhdr__bindgen_ty_1"]
        [::core::mem::size_of::<rte_mempool_objhdr__bindgen_ty_1>() - 8usize];
    ["Alignment of rte_mempool_objhdr__bindgen_ty_1"]
        [::core::mem::align_of::<rte_mempool_objhdr__bindgen_ty_1>() - 8usize];
    ["Offset of field: rte_mempool_objhdr__bindgen_ty_1::stqe_next"]
        [::core::mem::offset_of!(rte_mempool_objhdr__bindgen_ty_1, stqe_next) - 0usize];
};
impl Default for rte_mempool_objhdr__bindgen_ty_1 {
    fn default() -> Self {
        let mut s = ::core::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::core::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of rte_mempool_objhdr"][::core::mem::size_of::<rte_mempool_objhdr>() - 24usize];
    ["Alignment of rte_mempool_objhdr"][::core::mem::align_of::<rte_mempool_objhdr>() - 8usize];
    ["Offset of field: rte_mempool_objhdr::next"]
        [::core::mem::offset_of!(rte_mempool_objhdr, next) - 0usize];
    ["Offset of field: rte_mempool_objhdr::mp"]
        [::core::mem::offset_of!(rte_mempool_objhdr, mp) - 8usize];
    ["Offset of field: rte_mempool_objhdr::iova"]
        [::core::mem::offset_of!(rte_mempool_objhdr, iova) - 16usize];
};
impl Default for rte_mempool_objhdr {
    fn default() -> Self {
        let mut s = ::core::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::core::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[doc = "A list of object headers type"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct rte_mempool_objhdr_list {
    #[doc = "first element"]
    pub stqh_first: *mut rte_mempool_objhdr,
    #[doc = "addr of last next element"]
    pub stqh_last: *mut *mut rte_mempool_objhdr,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of rte_mempool_objhdr_list"]
        [::core::mem::size_of::<rte_mempool_objhdr_list>() - 16usize];
    ["Alignment of rte_mempool_objhdr_list"]
        [::core::mem::align_of::<rte_mempool_objhdr_list>() - 8usize];
    ["Offset of field: rte_mempool_objhdr_list::stqh_first"]
        [::core::mem::offset_of!(rte_mempool_objhdr_list, stqh_first) - 0usize];
    ["Offset of field: rte_mempool_objhdr_list::stqh_last"]
        [::core::mem::offset_of!(rte_mempool_objhdr_list, stqh_last) - 8usize];
};
impl Default for rte_mempool_objhdr_list {
    fn default() -> Self {
        let mut s = ::core::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::core::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
unsafe extern "C" {
    #[doc = "@internal Logtype used for mempool related messages."]
    pub static mut rte_mempool_logtype: ::core::ffi::c_int;
}
#[doc = "A list of memory where objects are stored"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct rte_mempool_memhdr_list {
